[
  {
    "createdAt": "07/04/2023",
    "company": "GFT",
    "platform": "Própria",
    "idInPlatform": "814723901",
    "title": "Programa de indicação Front - projeto nacional - 86361",
    "url": "https://jobs.gft.com/job/Programa-de-indica%C3%A7%C3%A3o-Front-projeto-nacional-86361/814723901/",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": true,
    "type": "REMOTE",
    "description": "Já conhece a GFT?\n\nFundada em 1987 e localizada em 16 países para garantir a proximidade com seus clientes, a GFT emprega mais de 10.000 pessoas colaboradoras ao redor do mundo. Oferecemos oportunidades de carreira em todas as áreas de tecnologia e inovação.\n\n\n\nPioneira na transformação digital, a GFT desenvolve soluções sustentáveis em novas tecnologias. Com sua experiência tecnológica, fortes parcerias e amplo know-how de mercado, a GFT oferece consultoria aos setores financeiro, de seguros e industrial.\n\n\n\nNa GFT, a diversidade, a igualdade e a inclusão estão no centro de quem somos e garantir um ambiente de trabalho diversificado e inclusivo para todas as pessoas é um dos principais pilares da nossa estratégia. Fomos certificados para 2022/23 como um 'Great Place to Work', não só no Brasil, mas de forma Global.\n\n\n\nQueremos você no nosso #teamgft!\n\nVagas exclusivas para o Programa de indicação\n\nRequisitos e Qualificações:\n\nProfissionais de nível pleno e sênior com experiencia profissional em desenvolvimento.\n\nAngularjs;\n\nAngular 2+;\n\nJavascript, HTML e CSS;\n\nDiferencial:\n\nTestes unitários.\n\nProcuramos uma pessoa que:\n\nGoste de trabalhar em equipe e seja colaborativa em suas atribuições;\n\nTenha coragem para se desafiar e ir além, abraçando novas oportunidades de crescimento;\n\nTransforme ideias em soluções criativas e busque qualidade em toda sua rotina;\n\nTenha habilidades de resolução de problemas;\n\nPossua habilidade e se sinta confortável para trabalhar de forma independente e gerenciar o próprio tempo;\n\nTenha interesse em lidar com situações adversas e inovadoras no âmbito tecnológico.\n\nO que oferecemos:\n\nCartão multi-benefícios – você escolhe como e onde utilizar;\n\nBolsas de Estudos de 90% para cursos de Graduação, Pós, MBA e Idiomas;\n\nProgramas de incentivo à Certificações;\n\nHorário de trabalho flexível;\n\nPlano personalizado de carreira e possibilidade de carreira internacional;\n\nSalários competitivos;\n\nAvaliação de desempenho anual com possibilidade de bonificação;\n\nGympass;\n\nPrevidência Privada;\n\nAuxílio-Creche;\n\nAssistência Médica;\n\nAssistência Odontológica;\n\nSeguro de Vida.\n\nBig enough to deliver – small enough to care.\n\n\n\n#VempraGFT\n\n\n\n#VamosVoarJuntos\n\n\n\n#ProudToBeGFT",
    "Etapas": "07/04/2023 - Aplicação para a vaga\n17/05/2023 - Email com recusa"
  },
  {
    "createdAt": "07/04/2023",
    "company": "GFT",
    "platform": "Própria",
    "idInPlatform": "814723201",
    "title": "Programa de indicação Front - 86341 INT",
    "url": "https://jobs.gft.com/job/Wfh-Programa-de-indica%C3%A7%C3%A3o-Front-IDU-Int-86341-SP-Wfh/814723201/",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": true,
    "type": "REMOTE",
    "description": "Req#: 86341\n\n\n\nJá conhece a GFT?\n\n\n\nFundada em 1987 e localizada em 16 países para garantir a proximidade com seus clientes, a GFT emprega mais de 10.000 pessoas colaboradoras ao redor do mundo. Oferecemos oportunidades de carreira em todas as áreas de tecnologia e inovação.\n\n\n\nPioneira na transformação digital, a GFT desenvolve soluções sustentáveis em novas tecnologias. Com sua experiência tecnológica, fortes parcerias e amplo know-how de mercado, a GFT oferece consultoria aos setores financeiro, de seguros e industrial.\n\n\n\nNa GFT, a diversidade, a igualdade e a inclusão estão no centro de quem somos e garantir um ambiente de trabalho diversificado e inclusivo para todas as pessoas é um dos principais pilares da nossa estratégia. Fomos certificados para 2022/23 como um 'Great Place to Work', não só no Brasil, mas de forma Global.\n\n\n\nQueremos você no nosso #teamgft!\n\nVagas exclusivas para o Programa de indicação\n\nRequisitos e Qualificações:\n\nProfissionais de nível pleno e sênior com experiencia profissional.\n\nAngular\n\nReact\n\nJavascript\n\nTypescript\n\nTestes unitários\n\nGit\n\nInglês avançado/fluente\n\nDiferencial:\n\nCloud\n\nProcuramos uma pessoa que:\n\nGoste de trabalhar em equipe e seja colaborativa em suas atribuições;\n\nTenha coragem para se desafiar e ir além, abraçando novas oportunidades de crescimento;\n\nTransforme ideias em soluções criativas e busque qualidade em toda sua rotina;\n\nTenha habilidades de resolução de problemas;\n\nPossua habilidade e se sinta confortável para trabalhar de forma independente e gerenciar o próprio tempo;\n\nTenha interesse em lidar com situações adversas e inovadoras no âmbito tecnológico.\n\nO que oferecemos:\n\nCartão multi-benefícios – você escolhe como e onde utilizar;\n\nBolsas de Estudos de 90% para cursos de Graduação, Pós, MBA e Idiomas;\n\nProgramas de incentivo à Certificações;\n\nHorário de trabalho flexível;\n\nPlano personalizado de carreira e possibilidade de carreira internacional;\n\nSalários competitivos;\n\nAvaliação de desempenho anual com possibilidade de bonificação;\n\nGympass;\n\nPrevidência Privada;\n\nAuxílio-Creche;\n\nAssistência Médica;\n\nAssistência Odontológica;\n\nSeguro de Vida.\n\nBig enough to deliver – small enough to care.\n\n\n\n#VempraGFT\n\n\n\n#VamosVoarJuntos\n\n\n\n#ProudToBeGFT",
    "Etapas": "-"
  },
  {
    "createdAt": "08/04/2023",
    "company": "Devoteam",
    "platform": "LINKEDIN",
    "idInPlatform": "3166612314",
    "title": "Frontend Developer e ReactJS Developer",
    "url": "https://www.linkedin.com/jobs/view/3166612314/?refId=207a0c26-adda-4279-b1ff-a38d634f0f85&trackingId=kPbdT34oSeeN6HANLE4R%2Fg%3D%3D&trk=flagship3_job_home_appliedjobs&lipi=urn%3Ali%3Apage%3Ad_flagship3_myitems_savedjobs%3BiY4Et4p6RYOBKqAXPhgO%2BQ%3D%3D",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "About Devoteam\n\n\n\nAt Devoteam, we believe that technology with strong human values can actively drive change for the better. Discover how Tech for People unlocks the future, creating a positive impact on the people and the world around us. We are a global leading player in Digital Transformation for leading organisations across EMEA, with a revenue of €652M. We believe in transforming technology to create value for our clients, partners and employees in a world where technology is developed for people. We are proud of the culture we have built together. We are proud of our people at the service of technology. We are proud of our diverse environment. Because we are #TechforPeople. Join our multidisciplinary team of Cloud experts, Designers, Business consultants, Security experts, Engineers, Developers and other extraordinary talents, spread across more than 18 EMEA countries. Become one of our +8.000 tech and business leaders on cloud, data and cyber security. Let’s fuse creativity with technology together and build innovative solutions that actively change things for the better.\n\n\n\nAbout the job\n\n\n\nWe are currently looking for a ReactJS Developer.\n\n\n\nIf this opportunity is for you, apply today!\n\n\n\nWe will rely on you to\n\n\n\nDeveloping and maintaining software features based on visual mockups and UX descriptions,\n\nWriting tests,\n\nDelivering high-quality code, which is both functional and performant,\n\nSOLID understanding of best practices, processes and patterns in software development,\n\nContributing to the infrastructure that the team leverages for development,\n\nCode reviewing.\n\n\n\nWhat we're looking for\n\n\n\nBachelors’ degree in Computer Science or similar;\n\n>2 years of working experience with ReactJS;\n\nExperience with JavaScript or Typescript;\n\nStrong Knowledge of HTML and CSS;\n\nKnowledge of MySQL and/or PostgreSQL;\n\nExperience with agile environment with scrum framework;\n\nFluency in English (written and spoken).\n\n\n\nDoes this sound like you?\n\n\n\nCome build with us, innovative solutions that actively change things for the better.\n\n\n\nApply today!",
    "Etapas": "-"
  },
  {
    "createdAt": "10/04/2023",
    "company": "Croct",
    "platform": "Própria",
    "idInPlatform": null,
    "title": "Frontend Engineer",
    "url": "https://croct.com/careers/jobs/frontend-engineer/",
    "numberOfInterviews": 4,
    "numberOfTests": 1,
    "recused": true,
    "type": "REMOTE",
    "description": "About the Role\n\nExcellent code begins with incredible people. Nerd Smile\n\nIf you are a developer, work with React, and look for a startup with global potential, you'll like what we are offering for you.\n\nAs a Frontend Engineer, you'll deal with challenges like implementing a good design and learning new technologies to guarantee the best user experience. You'll work directly with Croct's founders and address issues related to the performance, optimization, and scalability of solutions.\n\nPinIf you wish to work and contribute to open source projects, this job is perfect for you.\n\nOur Stack\n\nReact JS ReactJS\n\nGraphQL GraphQL\n\nJavaScript JavaScript\n\nHTML HTML\n\nTypeScript TypeScript\n\nCSS CSS\n\nAs part of the job, you will:\n\nEnsure the delivery of ambitious projects with a significant impact on the business while working side-by-side with the Croct's founders\n\nParticipate in project planning to meet current and future business needs, anticipating and removing barriers\n\nCollaborate with other teams to understand problems, analyze opportunities and explore the best solutions\n\nDevelop and implement Croct's platform, where customers manage their personalized experiences\n\nDocument and map the processes related to the area\n\nWe are seeking:\n\nExperience in React, GraphQL, Javascript, Typescript, HTML5, CSS3, and LESS / SASS\n\nKnowledge on libraries/frameworks/tools for frontend: Relay, Storybook, Jest, Cypress, and Emotion\n\nAbility with unit, integration, and end-to-end tests when applicable to the development process\n\nTheoretical basis, skill, and focused on technical excellence and best development practices (TDD, BDD, code design, architecture, etc.)\n\nExperience with versioning (GitHub) and linting (ESLint) tools\n\nAbility with package managers such as NPM\n\nExperience in Continuous Integration and Continuous Delivery\n\nPointing UpWe consider experience with Design Systems and open source projects as an excellent cutting-edge difference.\n\nWe are offering:\n\nCompetitive salary\n\nOutsourced work\n\nFreedom to work anywhere\n\nFlexible working hours\n\nGrowth opportunity in a startup with potential global scale\n\nFlexibility to work with the stack of your choice\n\nWork side-by-side with the founders and an incredible team\n\nFreedom to work and contribute to open source projects",
    "Etapas": "10/04/2023 - Aplicação para a vaga\n10/04/2023 - Primeiro contato\n12/04/2023 - Primeira entrevista\n13/04/2023 - Segunda entrevista\n19/04/2023 - Entrega do teste técnico\n02/05/2023 - Terceira entrevista\n05/05/2023 - Email com congelamento da vaga"
  },
  {
    "createdAt": "17/04/2023",
    "company": "CPN Tecnologia",
    "platform": "Própria",
    "idInPlatform": null,
    "title": "Front end",
    "url": "",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": true,
    "type": "FACE_TO_FACE",
    "Etapas": "17/04/2023 - Primeiro contato\n18/04/2023 - Recusa de entrevista presencial"
  },
  {
    "createdAt": "24/04/2023",
    "company": "Agência Sonora",
    "platform": "Revelo",
    "idInPlatform": null,
    "title": "Desenvolvedor(a) Front-End",
    "url": "",
    "numberOfInterviews": 2,
    "numberOfTests": 0,
    "recused": true,
    "type": "REMOTE",
    "description": "Estamos em busca de um (a) Desenvolvedor (a) Front-end para incrementar nosso beat.\n\nSe você manja elaborar interfaces, dar vida a layouts e adora trabalhar com tecnologia, essa é a sua chance de entrar para uma das agências de maior destaque no mercado de campanhas de incentivo e promoção da atualidade. Ficou a fim? Então dá uma olhada:\n\n\n\nO que irá fazer:\n\n• Desenvolver interfaces e dar vida aos layouts dos criativos da agência;\n\n• Atuar em conjunto com demais front-ends na evolução do ambiente e das tecnologias utilizadas;\n\n• Realizar pair programming e code review com membros da equipe;\n\n• Participar de todas as etapas, desde o brainstorm ao desenvolvimento e deploy;\n\n• Contribuir nas discussões técnicas, sugerir novas abordagens e ideias para melhorar a agilidade nas stacks de desenvolvimento;\n\n• Aprender e compartilhar conhecimento em bate-papos com as equipes (não apenas de TI).\n\nTer experiência e conhecimento:\n\n• Desenvolvimento de sistemas web;\n\n• HTML5, CSS3, SASS e Javascript;\n\n• Framework Bootstrap 4+;\n\n• APIs REST e web services;\n\n• Responsive Web;\n\n• Navegação e extração de assets em ferramentas gráficas como Adobe Photoshop e de prototipagem (Adobe XD, Figma);\n\n• Versionamento Git;\n\n• User experience, cross-browsing e performance;\n\n\n\nSerão considerados diferenciais, conhecimento em:\n\n• Framework React;\n\n• Desenvolvimento com Typescript;\n\n• Aplicação de Semantic Web (W3C) e Progressive Enhancement;\n\n\n\nModelo de trabalho remoto.\n\nContratação PJ com benefícios.\n\n\n\nEnviar pretensão salarial no link de inscrição da vaga.\n\nSaiba mais e se inscreva:",
    "Etapas": "24/04/2023 - Primeiro contato\n25/04/2023 - Primeira entrevista\n09/05/2023 - Segunda entrevista\n12/05/2023 - Email com recusa"
  },
  {
    "createdAt": "08/05/2023",
    "company": "Estoca",
    "platform": "LINKEDIN",
    "idInPlatform": "3558855009",
    "title": "Software Engineer - FrontEnd",
    "url": "https://www.linkedin.com/jobs/view/3558855009/?refId=7faddd09-ca5f-44ce-a642-77fb09b4c9f8&trackingId=PiuKUsQdTv%2B5IAUn%2FE1Ylw%3D%3D&trk=flagship3_job_home_savedjobs",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "Sobre a vaga\n\nComo é trabalhar na Estoca?\n\n\n\nO grande diferencial da Estoca é ser uma empresa de Logística movida por tecnologia, o que se traduz em uma experiência mais rápida, operação com baixa fricção e maior visibilidade de tudo o que acontece para os e-commerces.\n\n\n\nInvestida por fundadores da Loggi, Rappi, pela aceleradora Y Combinator e fundos de VC como Canary, Marathon e 8VC, a Estoca está em rápido crescimento, tendo agora no início de 2023 recebido um investimento series A liderado pela Astella.\n\n\n\nEm 2023 completaremos três anos de existência, vimos o time triplicar ao longo do ano anterior, batemos a marca de 2 milhões de pedidos entregues e ganhamos a confiança de grandes clientes.\n\n\n\nNossos talentos impactam positivamente milhares de pedidos online processados por dia, simplificando a logística no Brasil! 🚀\n\n\n\nTrabalhamos todos os dias para construir um ambiente cada vez mais diverso onde todos possam trazer o seu melhor, para crescer tanto profissional como pessoalmente, atuando, com liberdade individual e autonomia.Estamos em busca de talentos que desejem impactar o crescimento da empresa trabalhando de maneira colaborativa, trazendo seus conhecimentos, questionando, sendo proativos em trazer soluções para os problemas existentes, construindo processos, implementando metodologias e deixando sua marca.\n\n\n\nFicou curioso para saber quais tecnologias estão por trás disso? Acesse: https: //stackshare.io/companies/estoca\n\n\n\nComo serão seus dias\n\n\n\nConstruir soluções com excelência técnica e que impactam milhares de pessoas todos os dias;\n\nIrá desenvolver produtos de alta qualidade, garantindo a funcionalidade, usabilidade, manutenibilidade, performance e escalabilidade;\n\nAplicar e evoluir práticas de testes e qualidade de software;\n\nAtuará junto com todo o time para analisar o impacto das soluções desenvolvidas no nosso produto, atuando em todo o ciclo de desenvolvimento de produtos em conjunto com outros papéis;\n\nIrá trabalhar em um ambiente colaborativo com um time de ponta (que está crescendo muito), em feedbacks e discussões saudáveis são um dos pilares da cultura de engenharia. - Garantir que todas as soluções técnicas estejam alinhadas a estratégia de produto e entender como elas se relacionam com o nosso ambiente (OKRs, Iniciativas, Objetivos de longo prazo);\n\nColaborar com o time no desenho de soluções com arquitetura evolutiva;\n\nColaborar com a evolução das skills das pessoas e ações de melhoria continua do time que faz parte, influênciando, orientando e agindo como mentor de outras pessoas;\n\nIdentificar e propor melhores práticas para o desenvolvimento de software, participando da sua definição, revisão do código, testes e evolução.\n\n\n\nO que buscamos nas pessoas\n\n\n\nConhecimento, habilidade e preocupação com a excelência técnica e boas práticas de desenvolvimento (Clean Code, DDD, TDD, arquitetura evolutiva, design de código, paradigmas, etc.);\n\nProficiência em HTML, CSS e JavaScript;\n\nExperiência em linguagens usadas para frontend como React ou Vue.js (e disposição para aprender outras stacks caso necessário);\n\nExperiência no consumo e utilização de APIs, sejam elas REST ou GraphQL;\n\nTer atuado em estruturas que utilizaram Design System e componetização;\n\nConhecimento em boas práticas de qualidade como testes unitários, testes de integração e outros;\n\nCompreensão dos serviços AWS.\n\n\n\nSeria muito bom se você\n\n\n\nTer atuado com pré-processadores de CSS; - Ter atuado na construção e utilização de pacotes compartilhados (e.g. NPM);\n\nTer atuado no desenvolvimento de Microfrontends e na implementação da sua arquitetura;\n\nTer atuado com Django (framework de web Python) ou Jinja em algum projeto profissional;\n\nExperiência em práticas de migração de softwares para arquiteturas escaláveis;\n\nConhecimento em Docker e Kubernetes.\n\n\n\nConfira o Nosso Pacote De Benefício\n\n\n\n📝 Regime CLT\n\n\n\n🍽️ Vale-Refeição ou Vale-Alimentação: Disponibilizamos o cartão flexível Flash Benefícios, podendo ser utilizado para as funções alimentação e refeição em qualquer estabelecimento com a bandeira MasterCard no valor de R$720,\n\n00/mês;\n\n\n\n🚚 Vale Transporte pago através do Flash;\n\n\n\n💻 Auxílio Home Office no valor de R$100,\n\n00;\n\n\n\n🩺 Assistência médica cobertura nacional SulAmérica: Sem desconto mensal para o colaborador\n\n\n\n🦷 Assistência odontológica SulAmérica\n\n\n\n🧡 Seguro de Vida Prudential: Múltiplo salarial de acordo com política interna;\n\n\n\n👨‍👩‍👧‍👦 Auxílio creche para mães e pais: De acordo com convenção coletiva, é oferecido para crianças de até 6 anos;\n\n\n\n🤸 Gympass: Plataformas que oferecem diversas redes de academias, estúdios e aplicativos de bem-estar;\n\n\n\n👟 Zero dress code, vista como se sentir mais confortável;\n\n\n\n🎂 Day off no mês do aniversário",
    "Etapas": "-"
  },
  {
    "createdAt": "08/05/2023",
    "company": "Blaze",
    "platform": "LINKEDIN",
    "idInPlatform": "3594698627",
    "title": "Front End Engineer (LATAM)",
    "url": "https://www.linkedin.com/jobs/view/3594698627/?refId=207a0c26-adda-4279-b1ff-a38d634f0f85&trackingId=UjadTojITRCTs%2FBcXNv1Fw%3D%3D&trk=flagship3_job_home_appliedjobs&lipi=urn%3Ali%3Apage%3Ad_flagship3_myitems_savedjobs%3BiY4Et4p6RYOBKqAXPhgO%2BQ%3D%3D",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "Sobre a vaga\n\nAs an online gaming startup, our software is the heart of our business. We strive to create a safe, engaging and unparalleled player experience. We research, experiment and iterate. Our mission: to build a product and an organization that puts the experience first, delivering high-quality products our players love while enabling our people to be productive and creative without unnecessary disturbances.\n\n\n\nWhat you will do:\n\nWork on a frontend React.js\n\nWork within an Agile team made of no more than 5 people\n\nAttend a weekly standup meeting\n\nBecome a member and owner of our engineering culture, learning from other talented people, and sharing your own knowledge\n\n\n\nRequirements\n\n\n\nYou are:\n\nReactJS\n\nReact-Redux Library\n\nCSS preprocessors such as LESS and SASS\n\nRESTful web services\n\nSocket.IO -Canvas/game libraries such as Pixi.js\n\n\n\nMin 4 years experience, pixi.js/canvas is important\n\n\n\n**Please include an English CV/Resume and a portfolio that contains your works**\n\n\n\nBenefits\n\n\n\nLocation: Fully remote",
    "Etapas": "-"
  },
  {
    "createdAt": "08/05/2023",
    "company": "Stone",
    "platform": "LINKEDIN",
    "idInPlatform": "3560433665",
    "title": "Pessoa Desenvolvedora Front End React-Native | Pleno",
    "url": "https://www.linkedin.com/jobs/view/3560433665/?refId=207a0c26-adda-4279-b1ff-a38d634f0f85&trackingId=B7VVJHNZQuygQpx3HInu6w%3D%3D&trk=flagship3_job_home_appliedjobs&lipi=urn%3Ali%3Apage%3Ad_flagship3_myitems_savedjobs%3BiY4Et4p6RYOBKqAXPhgO%2BQ%3D%3D",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "Sobre a vaga\n\nQuem é Stone Tech?\n\n\n\nA Stone nasceu com o propósito de ser protagonista na transformação da indústria de pagamentos, lutando para oferecer as melhores soluções para quem empreende no Brasil.\n\n\n\nPensando nisso, construímos a Stone Tech! A junção dos times de tecnologia Stone Co. e as empresas financeiras do grupo que reconhecem o potencial empreendedor de cada brasileiro. Por aqui, temos todas as inovações e tecnologias de ponta da Stone, Pagar.me, Ton e Vitta, com uma galera referência no mercado de tecnologia, em um ambiente descontraído, repleto de desafios, oportunidades, flexibilidade, teamplay e desenvolvimento contínuo.\n\n\n\nNossa Cultura\n\n\n\nPor aqui, vivemos nossa cultura no dia a dia, guiados por esses 5 pilares:\n\n\n\n⚡Own It: Ter espírito de dono te faz conquistar a liberdade. Valorizamos a autonomia e a proatividade, somos responsáveis pelo o que entregamos e queremos sempre evoluir o nosso negócio.\n\n\n\n🎢Live the Ride: Faça. Feito é melhor que perfeito. Aprendemos com os erros e encaramos desafios como oportunidades de aprendizado.\n\n\n\n🎤No Bullshit: Agir com simplicidade. Somos pessoas práticas, sinceras e gostamos de feedbacks. Sabemos que às vezes vamos errar e contamos com essa transparência para evoluirmos.\n\n\n\n🤝Team Play: Se quer ir rápido, vá sozinho(a). Se quer ir longe, trabalhe em equipe. É sempre possível aprender com as outras pessoas e a colaboração é a chave do sucesso.\n\n\n\n💚The Reason: O cliente não tem razão, ele é a razão. Nos motivamos a enxergar o impacto do nosso trabalho na vida do cliente, é vendo que melhoramos a vida dele que sabemos que fizemos uma boa entrega.\n\n\n\nO Time Do TON\n\n\n\nO time tem como objetivo oferecer uma solução inovadora no mercado de pagamentos, o TapTon, responsável por transformar um celular em uma maquininha capaz de aceitar cartões de crédito e débito das principais bandeiras do país utilizando apenas seu celular.\n\n\n\nComo é Ser Uma Pessoa Desenvolvedora Front End\n\n\n\nVocê atuará na elaboração de novas features, documentações, refinamentos, manutenção e melhorias em nosso app. Ajudar e reforçar nossos padrões de códigos e melhores práticas através de revisão de Pull Requests. Atuará em um time jovem com bastante disposição de gerar valor através de códigos, estrutura e arquitetura de app de qualidade, sempre seguindo padrões e normas da companhia, com liberdade para opinar, sugerir e implementar novas idéias para protagonizar e mostrar suas soluções. Se interessar por compartilhar conhecimento com o time e auxiliar a equipe de sua área em melhorias, implementações e refatorações para melhorar a qualidade e escalabilidade do produto. Interação e participação em refinamento e troca de ideias com nosso time de UX para novas demandas. Curiosidades para saber o funcionamento de todo App, mesmo as features cujo o nosso squad não é responsável e disponibilidade para ajudar os demais.\n\n\n\nO Que Esperamos De Você\n\n\n\nExperiência com uso de TypeScript\n\nConhecimento sólido em React-Native\n\nEntendimento sobre ciclo de vida de um componente\n\nComponentização - Separação e reutilização de componentes\n\nUso de hooks\n\nEscrita de testes unitários\n\nO que aumenta as suas chances:\n\n\n\nExperiência com utilização do Redux para React-Native\n\nExperiência com otimização de aplicações React-Native\n\nExperiência na integração de módulos nativos em projetos React-Native\n\nNossos benefícios:\n\n\n\n🩺 Plano de Saúde e Odontológico\n\n\n\n🏥 Hospital Digital, da Vitta: contamos com uma equipe médica multidisciplinar, terapeutas e um time de saúde disponível 24 horas por dia 7 dias por semana de forma rápida e prática\n\n\n\n🥗 Vale Refeição e/ou Vale Alimentação\n\n\n\n💻 Auxílio Remoto + Setup Inicial (exclusivo para vagas remotas)\n\n\n\n🕗 Horário flexível\n\n\n\n✏ Benefício Educação - Plataforma interna com acesso a diversos livros, podcasts, treinamentos e vídeo aulas visando o autodesenvolvimento (Studa e Biblioteca StoneCo)\n\n\n\n💪 Gympass\n\n\n\n👶 Auxílio Creche\n\n\n\n💰 PLR\n\n\n\n💚 Seguro de Vida\n\n\n\n🚗Vale Transporte (exclusivo para vagas presenciais)\n\n\n\nEtapas Do Processo Seletivo\n\n\n\n✍Inscrição: Aqui você começa a sua jornada conosco. Fique tranquilo(a), nosso time analisará as informações do seu perfil e entrará em contato em breve. Boa sorte!\n\n\n\n📞Entrevistas com o time de People: Este é o momento de nos conhecermos! Você terá um papo inicial com nosso time de recrutamento, com o objetivo de conhecer nossa cultura, estrutura e o desafio que está sendo proposto.\n\n\n\n🎯Avaliação Técnica: Nesta etapa vamos nos aprofundar nas suas hard skills! Geralmente essa avaliação é composta por dois papos ou um papo mais o desafio, com o objetivo de avaliar habilidades e competências técnicas específicas para a vaga. Além de te apresentar possíveis pares e liderança.\n\n\n\n✅Check de Cultura: Nossa cultura é muito importante e está sempre presente no dia a dia! Aqui, você terá um papo com uma das nossas pessoas guardiãs da cultura, com o objetivo de nos conhecer e garantir que nossas crenças, nosso jeito de pensar e nossa visão de futuro estão alinhadas com o que você acredita e busca vivenciar.\n\n\n\n🏁Feedback: Uma de nossas forças é a franqueza. Por isso, independente do resultado, iremos compartilhá-lo com você e alinhar os próximos passos.\n\n\n\nE aí? Curtiu? Então, não deixa de se inscrever e #VemSerStone 💚🚀\n\n\n\nAqui na Stone Co., valorizamos e procuramos as melhores pessoas para nos ajudar a melhorar a vida das pessoas empreendedoras do Brasil. Nosso sonho é do tamanho do universo e, se você se identifica com o nosso propósito, venha construí-lo com a gente!",
    "Etapas": "-"
  },
  {
    "createdAt": "08/05/2023",
    "company": "PagoNxt",
    "platform": "LINKEDIN",
    "idInPlatform": "3565951791",
    "title": "Front End Developer PL",
    "url": "https://www.linkedin.com/jobs/view/3565951791/?refId=207a0c26-adda-4279-b1ff-a38d634f0f85&trackingId=SK%2BHMCYeSDqDtIoBRtPdag%3D%3D&trk=flagship3_job_home_appliedjobs&lipi=urn%3Ali%3Apage%3Ad_flagship3_myitems_savedjobs%3BiY4Et4p6RYOBKqAXPhgO%2BQ%3D%3D",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "Sobre a vaga\n\nEstamos construindo uma nova Plataforma de Adquirência de alcance mundial, nos consolidando como referência internacional no negócio de pagamentos a partir da marca Getnet. Já nascemos globais, contando com sedes corporativas em Porto Alegre, Munique, Madri, Dubai e Chennai (India). E esse é só o começo! Sonhamos grande, testamos rápido e aprendemos mais rápido ainda. É por isso que fazemos o que fazemos e sempre buscamos melhorar. É assim que criamos o novo e surpreendente.\n\n\n\n\n\nComo parte do time, no papel Front End você terá a oportunidade de trabalhar no time de desenvolvimento, utilizando as melhores soluções tecnológicas para o desenvolvimento de novos produtos com atuação global, interagindo com times cross.\n\n\n\n\n\nO QUE TERÁ COMO DESAFIOS?\n\n\n\nColaborar com o time para entrega de um software de alta qualidade que atenda às necessidades do cliente;\n\n\n\nCompreender os princípios e melhores práticas de desenvolvimento de software e escrita de códigos limpos, sustentáveis e eficientes;\n\n\n\nApoiar na identificação de impedimentos e trabalhar com o time para removê-los;\n\n\n\nUtilizar ferramentas de integração contínua e de automação do processo de entrega de software;\n\n\n\nDesenvolver web componentes para o design system.\n\n\n\n\n\nPara isso você vai precisar conhecer sobre:\n\n\n\nReact;\n\n\n\nNext JS;\n\n\n\nAngular;\n\n\n\nTypeScript;\n\n\n\nJavaScript,\n\n\n\nES6, RxJS, Testes (Jeste Jasmine), Node, Express, API REST, GraphQL, BFF, Docker, Banco de dados (MySQL e MongoDB), CSS, SASS, Orientação a objetos;\n\n\n\nVersionamento de código: Git e GitHub.\n\n\n\n\n\nE será um diferencial se você tiver:\n\n\n\nInglês e/ou Espanhol nível básico.\n\n\n\n\n\nINFORMAÇÕES ADICIONAIS\n\n\n\n🩺Assistência Médica;\n\n\n\n🦷Assistência Odontológica;\n\n\n\n🏋️🧘🏻‍♀️Gympass;\n\n\n\n🎂Day off pelo dia do aniversário;\n\n\n\n🔐Seguro de Vida;\n\n\n\n🍕VR/VA;\n\n\n\n🤑PPR;\n\n\n\n👶👧Auxílio creche\n\n\n\n🤰Extensão dos períodos de licença maternidade e paternidade\n\n\n\n🧠SelfCare - Programa de Saúde Mental e Bem-estar;\n\n\n\n📚Incentivo Idiomas (Inglês ou Espanhol);\n\n\n\n🤓Acesso a uma plataforma de learning conectada a todos os conteúdos do LinkedIn Learning e o'Reilly\n\n\n\n📈Possibilidade de contratação de empréstimos pessoais com juros menores que os de mercado.\n\n\n\n\n\n✨ WE BOOST THE FUTURE OF PAYMENTS TO NOW, TO WOW!\n\n\n\nQuando um(a) cliente está satisfeito(a): Wow!\n\n\n\nQuando um(a) colaborador(a) se sente bem cuidado(a): Wow!\n\n\n\nQuando tornamos as coisas simples e rápidas: Wow!\n\n\n\nQuando criamos algo novo e surpreendente: Wow!\n\n\n\n\n\nWow Effect é o que queremos gerar em todas nossas interações com Nxters – como carinhosamente chamamos nossos(as) colaboradores(as) -, clientes e parceiros, traduzido pelos comportamentos 💡 IMAGINE, 💙 CARE e 🔑 SIMPLIFY.",
    "Etapas": "-"
  },
  {
    "createdAt": "08/05/2023",
    "company": "Nestig",
    "platform": "LINKEDIN",
    "idInPlatform": "3580160112",
    "title": "Mid-Level Frontend Engineer, Shopify",
    "url": "https://www.linkedin.com/jobs/view/3580160112/?refId=207a0c26-adda-4279-b1ff-a38d634f0f85&trackingId=NAYU2nh2QsaIclc6vH%2BWYA%3D%3D&trk=flagship3_job_home_appliedjobs&lipi=urn%3Ali%3Apage%3Ad_flagship3_myitems_savedjobs%3BiY4Et4p6RYOBKqAXPhgO%2BQ%3D%3D",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "Sobre a vaga\n\nThe ideal candidate will be responsible for designing, developing, testing, and debugging responsive web and mobile applications for the company. Using JavaScript, HTML, and CSS, this candidate will be able to translate user and business needs into functional frontend design, in our Shopify store.\n\n\n\nResponsibilities\n\n\n\nDesigning, developing, and testing UI for mobile and web applications\n\nBuild reusable code and libraries for future use\n\nAccurately translate user and business needs into functional frontend code\n\n\n\nQualifications\n\n\n\nBachelor's degree or equivalent in Computer Science\n\nIntermediate English\n\n2+ years' experience in frontend development\n\nFamiliarity using Scrum/Agile development methodologies\n\nExperience building object oriented web applications in JavaScript, HTML5, and CSS3",
    "Etapas": "-"
  },
  {
    "createdAt": "08/05/2023",
    "company": "Youpop",
    "platform": "Programathor",
    "idInPlatform": "28447",
    "title": "Desenvolvedor(a) Front End - Sênior",
    "url": "https://programathor.com.br/jobs/28447-desenvolvedor-a-front-end-senior",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "Descrição da empresa\n\nO Youpop é o seu hub de inovação: Fidelização, marketing\n\nde geolocalização, entregas inteligentes e marketplace em uma só plataforma\n\n\n\n\n\nAtividades e Responsabilidades\n\nTrabalhar no desenvolvimento e manutenção de soluções Web para software para Gestão de Restaurantes, com intuito de melhorar a experiência de nossos produtos para nossos clientes, com habilidades para codificação front-end de média e alta complexidade;\n\n• Garantir que as entregas estão em conformidade com as boas práticas e convenções internas;\n\n• Propor soluções para as situações que ocorrem no dia a dia. Conhecer a arquitetura front-end do software e ser capaz de atuar nela através da análise de seus componentes, organização e funcionalidades;\n\n• Criar testes de alta complexidade, sejam estes manuais ou automatizados, que cubram o comportamento desejado dos componentes técnicos desenvolvidos utilizando os requisitos e ferramentas de testes;\n\n• Documentar as etapas de desenvolvimento realizando o registro do desenvolvimento nas ferramentas de versionamento e documentação;\n\n• Resolver problemas complexos;\n\n• Desenvolvimento para encontrar soluções de negócio, arquitetura e desenho através da comunicação e trocas de conhecimento com o time;\n\n• Manter a qualidade do software verificando os processos, ferramentas e boas práticas disponíveis para o produto e tecnologia utilizados; e\n\n• Detalhar requisitos de média e alta complexidade através do contato com clientes e áreas envolvidas no projeto/atendimento.\n\n\n\n\n\nRequisitos\n\nO QUE ESPERAMOS DE VOCÊ:\n\n\n\n• Conhecimentos sólidos em desenvolvimento de aplicações web, utilizando ReactJS.\n\n• HTML, CSS, JavaScript e TypeScript;\n\n• Conhecimento em Git;\n\n• Experiência com a metodologia Ágil (Scrum);\n\n• Desejável conhecimento na biblioteca de componentes Mui.\n\n• Conhecimento em boas práticas de programação;\n\n• Tenha interesse em aprender sobre novas tecnologias e soluções que possam ajudar no desenvolvimento\n\n\n\n\n\nO que nós oferecemos\n\n Vale Refeição\n\n\n\n Plano de Saúde\n\n\n\n Plano Odontológico\n\n\n\n Academia/Gympass",
    "Etapas": "-"
  },
  {
    "createdAt": "08/05/2023",
    "company": "LuxOne",
    "platform": "Programathor",
    "idInPlatform": "28458",
    "title": "Desenvolvedor(a) Front-end Pleno CLT",
    "url": "https://programathor.com.br/jobs/28458-desenvolvedor-a-front-end-pleno-clt",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "Descrição da empresa\n\nA melhor e mais completa ferramenta de Gestão de Times e Projetos! Uma Plataforma completa para gestão de equipes de alta performance. Software que integra com simplicidade a estratégia e execução.\n\n\n\n\n\nAtividades e Responsabilidades\n\nA melhor e mais completa ferramenta de Gestão de Times e Projetos! Uma Plataforma completa para gestão de equipes de alta performance. Software que integra com simplicidade a estratégia e execução.\n\n\n\nEstamos recrutando os melhores talentos para atuar com o time de DEV da Lux Sistemas. O candidato a vaga atuará no desenvolvimento de interfaces de sistemas SPA, consumo de APIs do backend, integração com outras ferramentas, desenvolvimento de layout e manutenção de sites e sistemas (FrontEnd).\n\n\n\n\n\nRequisitos\n\n* HTML5, CSS3 e JavaScript.\n\n* Conhecimento em Vue 3\n\n* Conhecimentos sólidos de HTML 5 e semântica.\n\n* Pré-processadores como SASS, LESS, Stylus ou Pós-processador PostCSS.\n\n* Controle de Versão (GIT).\n\n* Inglês é um diferencial.\n\n* Ser comunicativo(a) e dinâmico(a).\n\n\n\n\n\nO que nós oferecemos\n\n Vale Alimentação\n\n\n\n Vale Transporte\n\n\n\n Bônus\n\n\n\nRemuneração a combinar durante entrevista final!",
    "Etapas": "-"
  },
  {
    "createdAt": "08/05/2023",
    "company": "<MBSS/>",
    "platform": "Programathor",
    "idInPlatform": "28457",
    "title": "Desenvolvedor(a) React Sênior",
    "url": "https://programathor.com.br/jobs/28457-desenvolvedor-a-react-senior",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "Descrição da empresa\n\nConsultoria de atração e seleção de talentos tech.\n\n\n\n\n\nAtividades e Responsabilidades\n\nJavaScript ou TypeScript;\n\nReact; \n\nHTML 5 e CSS3;\n\ntailwindcss ou chakra ui;\n\nhusky, ESLint,  Next.js, Node.js, Redux, single-spa, storybook;\n\nPrincípios e práticas de desenvolvimento de software ágil, incluindo o SCRUM;\n\nAnálise de requisitos funcionais e não-funcionais, padrões de projeto (enterprise integration patterns, design patterns, microservices patterns), modelagem de dados relacional;\n\nConhecer a arquitetura de aplicações para ambiente web, e arquitetura em três camadas, modelo MVC;\n\nDomain-driven design (DDD);\n\nIntegração entre sistemas: Mensageria (Kafka e/ou RabbitMQ), Web services, REST, GRPC;\n\nPublicação de aplicações em plataformas como serviço (Platform as a service - PaaS);\n\nIntegração contínua (continuous integration), test-driven development (TDD), acceptance test-driven development (ATDD), especificação por exemplo, refactoring, entrega contínua (continuous delivery);\n\nAnálise estática de código com a ferramenta SonarQube 5.0 ou superior;\n\nTeste de integração no frontend com ferramentas como Cypress ou similares;\n\nTestes unitários no frontend utilizando ferramentas como Jamine, Jest ou similares; \n\nConstrução de consultas a bancos de dados em linguagem SQL;\n\nConceitos de controle de versão de código-fonte e uso das ferramentas;\n\n\n\n\n\nRequisitos\n\n- 05 anos de experiência como Dev.\n\n- Formação Superior completa\n\n- Uma das seguintes certificações:\n\n\n\nPara atuar como Desenvolvedor:\n\nCSD – Certified Scrum Developer;\n\nPSD – Professional Scrum Developer;\n\n\n\nPara atuar como Scrum Master no time, além de desenvolvedor:\n\na) Scrum.Org: Professional Scrum Master – PSM:\n\nPSM I; PSM II ou PSM III;\n\nb) Scrum Alliance: Certified Scrum Master – CSM;\n\nc) Scrum Study: Scrum Master Certified – SMC\n\nd) EXIN: Agile Scrum Master - ASM\n\n\n\n*Caso não possua não há problemas, nós damos um prazo de 30 dias, após efetivação para tirar. Atenção a empresa não custeia, apenas dar o prazo*\n\n\n\n\n\nO que nós oferecemos\n\n Vale Refeição\n\n\n\n Plano de Saúde\n\n\n\nAuxilio Home Office",
    "Etapas": "-"
  },
  {
    "createdAt": "08/05/2023",
    "company": "Dynaccurate S.A.R.L",
    "platform": "Programathor",
    "idInPlatform": "28442",
    "title": "Desenvolvedor(a) Full Stack Pleno",
    "url": "https://programathor.com.br/jobs/28442-desenvolvedor-a-full-stack-pleno",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "description": "Descrição da empresa\n\nSomos uma startup com sede em Luxemburgo, dedicada a harmonizar dados dinâmicos de serviços em saúde. Fornecemos soluções avançadas envolvendo Inteligencia artificial e engenharia de dados, acessíveis em aplicativos simples de usar.\n\n\n\n\n\nAtividades e Responsabilidades\n\nEstamos em busca de um Desenvolvedor Full Stack Junior/Pleno com habilidades sólidas em frontend, especialmente em ReactJS, para se juntar à nossa equipe de desenvolvimento. O candidato selecionado será responsável por criar aplicações web interativas e responsivas, com foco em proporcionar a melhor experiência do usuário.\n\nResponsabilidades:\n\n• Desenvolver aplicações web de alta qualidade utilizando ReactJS no frontend e Python no backend.\n\n• Projetar e implementar interfaces de usuário atraentes e funcionais.\n\n• Colaborar com a equipe de design para garantir a consistência visual e a usabilidade das aplicações.\n\n• Implementar e otimizar recursos de desempenho e usabilidade no frontend.\n\n• Integrar APIs externas e serviços de terceiros para aprimorar as funcionalidades das aplicações.\n\nRequisitos:\n\n• Experiência prévia em desenvolvimento web com foco em frontend, utilizando ReactJS.\n\n• Sólido conhecimento em HTML5, CSS3 e JavaScript.\n\n• Familiaridade com conceitos de UX/UI e melhores práticas de design de interface do usuário.\n\n• Habilidades em resolução de problemas e depuração de código no frontend.\n\n• Capacidade de trabalhar em equipe, colaborar e comunicar-se efetivamente.\n\n• Experiência em desenvolvimento full stack, com conhecimento em Python ou outros frameworks backend.\n\nDiferenciais:\n\n• Familiaridade com outras tecnologias web, como frameworks de CSS, controle de estado (ex: Redux) e testes de unidade.\n\n• Conhecimento em metodologias ágeis de desenvolvimento, como Scrum ou Kanban.\n\nOferecemos:\n\n• Ambiente de trabalho remoto.\n\n• Oportunidade de aprendizado e crescimento profissional, com possibilidade de se especializar em frontend.\n\n• Remuneração competitiva.\n\n\n\n\n\nRequisitos\n\n• Experiência prévia em desenvolvimento web com foco em frontend, utilizando ReactJS.\n\n• Sólido conhecimento em HTML5, CSS3 e JavaScript.\n\n• Familiaridade com conceitos de UX/UI e melhores práticas de design de interface do usuário.\n\n• Habilidades em resolução de problemas e depuração de código no frontend.\n\n• Capacidade de trabalhar em equipe, colaborar e comunicar-se efetivamente.\n\n• Experiência em desenvolvimento full stack, com conhecimento em Python ou outros frameworks backend.",
    "Etapas": "-"
  },
  {
    "createdAt": "12/05/2023",
    "company": "Indicafix",
    "platform": "Programathor",
    "idInPlatform": "28576",
    "title": "Desenvolvedor(a) Front-end (React) Pleno",
    "url": "https://programathor.com.br/jobs/28576-desenvolvedor-a-front-end-react-pleno",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "Descrição da empresa\n\nIndicafix é uma startup que tem como principal objetivo descomplicar a mensuração da comunicação entre empresas e seus colaboradores. A ideia é medir, ajustar e melhorar.\n\n\n\n\n\nAtividades e Responsabilidades\n\n- Desenvolvimento e manutenção de aplicações web;\n\n- Realizar a manutenção e criação de novas funcionalidades;\n\n- Desenvolvimento de funcionalidades no Front-End;\n\n- Auxiliar testes e integraçòes no Back-End;\n\n- Liderar time de desenvolvedores;\n\n- Aplicar melhores práticas de documentação de código desenvolvido;\n\n- Desenvolver e sustentar integrações;\n\n- Buscar novas ferramentas e técnicas para a melhoria contínua de nossos sistemas;\n\n\n\n\n\nRequisitos\n\nExperiência de + de 3 anos com React\n\nConhecimento em MongoDB, Git, Docker e GCP",
    "Etapas": "-"
  },
  {
    "createdAt": "12/05/2023",
    "company": "E-xyon Legal Data",
    "platform": "Programathor",
    "idInPlatform": "28566",
    "title": "Analista de Desenvolvimento Pleno (Fullstack)",
    "url": "https://programathor.com.br/jobs/28566-analista-de-desenvolvimento-pleno-fullstack",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "Descrição da empresa\n\nFundada em 2001, a e-Xyon tem o objetivo de aprimorar os níveis de gestão no segmento jurídico, incorporando no setor metodologias já praticadas em outros segmentos de negócios, tais como garantia da qualidade, gerenciamento de risco, automação de procedimentos e ganhos de escala através de inovação tecnológica.\n\n\n\n​\n\n\n\nContamos com uma plataforma de soluções de gestão corporativa capaz de incorporar tecnologias para elevação dos níveis de gestão, produtividade, desempenho e compliance de departamentos jurídicos e escritórios de advocacia de qualquer porte.\n\n\n\n​\n\n\n\nA e-Xyon foi a primeira empresa a oferecer um completo software para gestão jurídica em um modelo de arquitetura de computação nas nuvens, para departamentos jurídicos e escritórios de advocacia e ao longo dos anos, ampliamos nossa oferta de soluções, incluindo softwares para as áreas de gestão de contratos e consultivo.\n\n\n\n​\n\n\n\nTrabalhamos seguindo todas as regras de governança corporativa, compliance, agências regulatórias e LGPD.\n\n\n\n​\n\n\n\nConsiderando esse cenário, a e-Xyon desenvolveu um conjunto de soluções tecnológicas e metodologias de gestão que auxiliam empresas e escritórios de advocacia a enfrentarem os desafios de um ambiente de negócios cada vez mais dinâmico e permitem a rápida operação e integração de equipes internas e externas, independentemente de sua distribuição geográfica através de uma arquitetura baseada em cloud computing.\n\n\n\nEntregamos qualidade de segurança de dados - Backup e auditoria assistida através de uma equipe de auditoria especializada.\n\n\n\n\n\nAtividades e Responsabilidades\n\nHTML;\n\nBootStrap;\n\nJava Script;\n\nJson;\n\nJQuery;\n\nNodejs;\n\nExpressjs;\n\nBanco de Dados (SQL e PostgreSQL);\n\n\n\n\n\nRequisitos\n\nDiferenciais:\n\nAngular;\n\nReact.js;\n\nReact Native;\n\nMaterial-ui\n\nAsp.net core;\n\nC3;\n\n\n\n\n\nO que nós oferecemos\n\n Vale Refeição\n\n\n\n Vale Alimentação\n\n\n\n Plano de Saúde\n\n\n\n Plano Odontológico\n\n\n\n Seguro de Vida",
    "Etapas": "-"
  },
  {
    "createdAt": "12/05/2023",
    "company": "Deliver IT",
    "platform": "GUPY",
    "idInPlatform": "4796271",
    "title": "Desenvolvedor Full-Stack React Pleno",
    "url": "https://deliverit.gupy.io/jobs/4796271?jobBoardSource=gupy_opportunities",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": true,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nVocê se considera uma pessoa que tem sede por aprendizado, gosta de trabalhar em equipe e curte compartilhar conhecimento? Então essa oportunidade é para você!\n\n\n\n\n\nEstamos em busca de um(a) Desenvolvedor Full-stack em React - Pleno, para atuar em uma empresa do segmento de educação, com desafio de modernizar e implementar novas funcionalidades na solução do cliente.\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\nNa sua rotina de trabalho, você vai se deparar com as seguintes atividades:\n\n\n\n\n\nAtuação em análise e implementação das soluções de software para evolução do produto, com novas funcionalidades, integrações adequações a legislação e normativas.\n\nAnálise e solução de incidentes e problemas para investigação e correção em causa raiz. \n\nProjeto de evolução e manutenção da aplicação que é um produto do cliente, focado principalmente em novas funcionalidades com alta expectativa de qualidade e processo maduro de desenvolvimento de software.\n\nCliente possui diversas integrações com outros sistemas terceiros onde devemos fazer a comunicação.\n\n\n\nREQUISITOS E QUALIFICAÇÕES\n\nConfere abaixo o que você vai precisar saber pra se dar bem nessa oportunidade!\n\n\n\n\n\nCONHECIMENTOS EXIGIDOS\n\n\n\nReact\n\nNextJS\n\nMongoDB\n\nAPI REST e SOAP\n\nGit, GIT Lab CI\n\nScrum\n\nJavaScript, HTML, CSS\n\nPHP, Wordpress\n\n\n\n\n\nCONHECIMENTOS DESEJÁVEIS\n\n\n\nJava framework Micronaut\n\nDigital Ocean \n\nTerraform\n\nJava\n\nWebHooks\n\nINFORMAÇÕES ADICIONAIS\n\nA Deliver IT vai deixar a digital nesse projeto e quer convidar você para fazer parte dessa construção! 🙆‍♀️\n\n\n\nTemos uma cultura leve, descontraída, colaborativa e diversa, além de um ambiente enriquecedor, com muitos colegas feras em diversos segmentos e muitos desafios. Aqui você vai encontrar projetos inovadores, conexão e muita troca de conhecimento! 😊\n\n\n\n\n\nTodas as nossas posições seguem o modelo de contrato CLT em 44h/semanais.\n\n\n\n\n\nCONFIRA NOSSOS BENEFÍCIOS\n\n\n\nModalidade: 100% Remoto\n\nVA e/ou VR\n\nPrograma Bem-Estar: apoio psicológico, apoio jurídico, apoio social, apoio financeiro e ginástica laboral. \n\nPlano de Saúde e Plano Odontológico\n\nSeguro de Vida\n\nIncentivo ao inglês\n\nWorkshops mensais\n\nParcerias que te dão desconto: Sucesu, Target Trust, Sesc e Seprorgs\n\nPremiação por aniversário de empresa\n\nPremiação por indicação contratada\n\nJUNTE-SE A NÓS\n\nO universo da tecnologia é gigante, assim como as nossas oportunidades de carreira e os motivos que você tem para ser Deliver IT. Descubra e trilhe seu futuro com a gente.\n\n\n\n\n\nVALORES QUE ENTREGAMOS PARA VOCÊ\n\n\n\n \n\n\n\nIT IS TECH\n\n\n\nAqui utilizamos a tecnologia para fortalecer as relações entre pessoas e negócios.\n\n\n\n\n\nIT IS COLLABORATION\n\n\n\nO nosso espírito de colaboração promove um ambiente produtivo, leve, transparente e humano.\n\n\n\n\n\nIT IS RESPONSIBILITY\n\n\n\nSabemos que para ter liberdade e autonomia para criar soluções inovadoras tem que ter responsabilidade.\n\n\n\n\n\nIT IS OPPORTUNITIES\n\n\n\nSomos valorizados por nossas capacidades e temos o estímulo necessário para desenvolver nossos talentos.",
    "Etapas": "12/05/2023 - Aplicação para a vaga\n07/06/2023 - Email com recusa"
  },
  {
    "createdAt": "12/05/2023",
    "company": "Dream Work",
    "platform": "Recrutei",
    "idInPlatform": null,
    "title": "Desenvolvedor (a) Front-end React - PL/SR",
    "url": "https://jobs.recrutei.com.br/grupo-dream-work/vacancy/12957-dw1137-desenvolvedor-a-front-end-react-plsr",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "Descrição da vaga\n\nSelecionamos para empresa de tecnologia da informação de Porto Alegre / RS\n\n\n\nDescrição da Vaga:\n\n\n\nProdutora de software, especilizada no mercado de comunicação digital, contrata Desenvolvedor(a) para atuar no time de desenvolvimento e manutenção de projetos envolvendo ReactJS.\n\nRequisitos:\n\n\n\n2 anos de experiência em projetos no framework;\n\nReactJs+ CSS e HTML;\n\nConhecimentos Typescript, React JS, HTML5, CSS3, ES6;\n\nNoções de Design e Usabilidade;\n\nDomínio em implementações de APIs restfull;\n\nMVC e orientação a objetos;\n\nBootstrap;\n\nExperiência com versionamento (GIT).\n\nDiferencial:\n\n\n\nExperiência com React Native;\n\nExperiência com TailwindCSS\n\nExperiência com GraphQL\n\nFormação:\n\n\n\nSuperior concluído ou em andamento.\n\nInglês Intermediário.\n\nCarga horária semanal\n\n40 horas\n\nRegime de Contratação\n\nPessoa Jurídica",
    "Etapas": "-"
  },
  {
    "createdAt": "12/05/2023",
    "company": "Ateliware",
    "platform": "GUPY",
    "idInPlatform": "4740684",
    "title": "Mid-Level Full-Stack Engineer (Front-end Focused)",
    "url": "https://ateliware.gupy.io/job/eyJzb3VyY2UiOiJndXB5X3B1YmxpY19wYWdlIiwiam9iSWQiOjQ3NDA2ODR9?jobBoardSource=gupy_public_page",
    "numberOfInterviews": 1,
    "numberOfTests": 1,
    "recused": true,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nAt ateliware, we believe in impactful well-built products. Our 11 years of experience in the digital transformation of both brazilian, european and north-american markets (we're currently in 6 different countries!) made us reference in performance, technology growth and custom hand-made product delivery. Do you want to be part of it?\n\n\n\n\n\nWe rely on experience (hard and soft skills) and willingness to continue learning every day so that we can grow together more and more: we strongly believe in continuous improvement. We value collaboration and mutual respect, we are very curious and constantly face challenges. At the end of the day, we are unbeatable problem solvers.\n\n\n\n\n\nIf you identify with this challenge and dream to work with technologies that create real and positive impacts, keep on reading: there's a high chance that you would like to join us.\n\n\n\n\n\nThe position available is Mid-Level Full-Stack Engineer (Front-end Focused). You will be an integral part of a multidisciplinary design and development (D&D) team, co-creating digital products for our customers and also for the market in our ateliLAB – ateliware's product development laboratory.\n\n\n\n\n\nIf you want to take the next step in your career with us, you will be able to work with different technologies and languages. For example, we currently have products being developed in: Elixir, Javascript/Typescript environments (Node, Express, React, Vue, React Native), Python, Ruby, Kotlin and Flutter.\n\n\n\n\n\nBy the way, we are a remote first company, that is, working remotely is our standard business – but if you are in Curitiba, you can opt for a hybrid model without any problem. In any case, all internal processes remain 100% remote, including the hiring process, which takes place entirely online.\n\n\n\n\n\nWe value constant and frequent knowledge sharing, partnership and good conversations, whether in internal events, happy hours with the whole group in our physical office and/or virtual environment and, of course, on a daily basis. We are a united and very collaborative team, and it will be a pleasure to welcome you to our #teamateliware.\n\n\n\nREQUISITOS E QUALIFICAÇÕES\n\n3+ years of experience with web/mobile frontend engineering (or equivalent experience);\n\nAbility to solve complex problems with simple and elegant solutions;\n\nAdvanced/Fluent English;\n\nProficient with one or more modern front-end frameworks such as React (with Hooks and Typescript), Vue or Angular 13+;\n\nSolid knowledge with one or more back-end technologies, such as Node/Express, Django/Flask, Rails, ASP.NET, Phoenix;\n\nKnowledge of the entire software creation and support lifecycle;\n\nExperience maintaining (but not necessarily building) infrastructures on AWS, Azure or any other Cloud environments;\n\nRelational databases (MySQL, Postgres, SQL Server, etc.);\n\nExperience, albeit small, with non-relational databases;\n\nExperience, albeit small, using Docker;\n\nExperience inside iterative and incremental methods for software engineering & delivery;\n\nAutomated tests (unit tests, integration tests, regression tests and others);\n\nCode versioning with any Git environment.\n\nINFORMAÇÕES ADICIONAIS\n\nWhat are we going to provide you to do a wonderful job?\n\n\n\n\n\nCompetitive remuneration and incentives =)\n\nWorking in a company with a sensational, flexible and dynamic environment;\n\nHere you can be yourself, we need different people with new ideas and mindsets;\n\nOpportunity to always work on new projects and with the most modern and diverse technologies;\n\nEnvironment that provides constant learning, always new challenges and a lot of autonomy;\n\nThe best and most modern tools for you do your job in the best way;\n\nOpportunities and help so that you are always learning and studying new things.\n\n\n\nWe can guarantee that it is going to be challenging. But we can also guarantee growth, support from the leadership at all times and lot's of fun. Does all that match with you? Come work with us! =)\n\n\n\nSOMOS UM ATELIER DE SOFTWARE E DESENVOLVEMOS PRODUTOS E SOLUÇÕES DIGITAIS CUSTOMIZADAS – SOB MEDIDA.\n\nPresente no mercado há mais de 10 anos, somos um ateliê de software que desenvolve produtos digitais sob demanda. Iniciamos desenvolvendo softwares customizados em Curitiba/PR e agora atuamos em todo o mundo, atendendo empresas internacionais. Somos uma empresa remote first, mas também temos nossa sede em Curitiba, uma opção de local de trabalho e reuniões aos que tiverem interesse. Mas caso o trabalho presencial não seja a sua opção, nos encontramos em nosso escritório virtual. \n\n\n\n \n\n\n\nAqui na ateliware, transformamos e descomplicamos negócios e fazemos a diferença desde a primeira entrega. Nosso foco é construirmos junto com o cliente a melhor solução, então tudo é desenvolvido a quatro mãos (ateliware e clientes).\n\n\n\nContamos com equipes de design e desenvolvimento especialistas em produtos digitais, seja para a criação de aplicações móveis (web, híbrida ou nativa), web ou desktop. Nosso time trabalha junto desde a fase inicial, o discovery, em que ideias e investimentos são analisados e validados; passando pela fase de product concept, quando toda a parte de UX e UI são desenhadas; até a etapa de build, momento que o back-end e front-end são construídos. Nós já tivemos como parceiros marcas como Amazon, Banco Santander e Unimed, e atualmente atendemos empresas como Grupo Votorantim, Grupo Alliar e Getnet.\n\n\n\n \n\n\n\nAlém disso, aqui dentro da ateliware já nasceram três startups: a minestore, em 2014 como uma plataforma SaaS de e-commerce descomplicada para simplificar a criação e o gerenciamento de lojas virtuais, em 2015 a Pipefy, plataforma de gerenciamento e otimização de processos de trabalho que aumenta a agilidade e a eficiência, gerando melhores resultados e a Trio, em 2021, uma techfin voltada para o Open Banking e Open Finance.\n\n\n\n \n\n\n\nMais do que um fornecedor que entende de tecnologia, nos consolidamos como quem ajuda clientes a transformar e descomplicar o mundo dos negócios, tendo a tecnologia como meio e não como fim! Então se você quer fazer parte da transformação digital, participe do nosso processo seletivo e junte-se ao #teamateliware!",
    "Etapas": "12/05/2023 - Aplicação para a vaga\n16/05/2023 - Primeira entrevista (por telefone)\n23/05/2023 - Cancelamento da vaga"
  },
  {
    "createdAt": "16/05/2023",
    "company": "ProcessMind",
    "platform": "GUPY",
    "idInPlatform": "4787933",
    "title": "Desenvolvedor Front-End Pleno",
    "url": "https://processmind.gupy.io/jobs/4787933?jobBoardSource=gupy_opportunities",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nHá 20 anos, a ProcessMind é uma empresa focada na obtenção dos melhores resultados para os clientes a partir de uma visão moderna de seus processos de negócio.\n\n\n\nVisamos entregar consultorias, automações de processos e sistemas sob medida, além de soluções aderentes as necessidades de nossos clientes.\n\n\n\n\n\nE não seria diferente com os nossos colaboradores, se você busca uma empresa na qual você tenha oportunidades de aprender e compartilhar você está no lugar certo, aqui cada Minder é único, respeitamos a sua trajetória e oferecemos um ambiente no qual você poderá traçar novos caminhos e aprendizados.\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\nVocê irá nos ajudar com a modernização dos serviços dos cartórios de Registro Civil do Brasil, facilitando a vida de inúmeros cidadãos que necessitam ir ao cartório para realizar diversos serviços como:\n\n\n\nPedidos de certidões;\n\nProcurações;\n\nReconhecimento de firma.\n\n\n\nPara isso buscamos um profissional que tenha experiência em arquitetar e produzir Single Page Application (SPA) consumindo API's REST utilizando o seguinte toolbelt:\n\n\n\nHTML Semântico\n\nVue.JS ou outro framework JavaScript\n\nSASS ou outro pré-processador de CSS\n\nWebpack\n\nSearch Engine Optimization (SEO)\n\nProdução Web Responsiva\n\nGIT\n\nREQUISITOS E QUALIFICAÇÕES\n\nConhecimentos e skills que valorizamos:\n\n\n\nVuex, Redux ou outro 'Gerenciador de estado' de aplicação; \n\nDocker;\n\nArquitetura da informação;\n\nBoas práticas de usabilidade e design;\n\nFamiliaridade com cultura e metodologias ágeis.\n\nINFORMAÇÕES ADICIONAIS\n\nO que você encontrará aqui\n\nAmbiente colaborativo, inclusivo e descontraído\n\nProjeto de desenvolvimento e mentoria para seu crescimento profissional\n\nOportunidade de disseminar seu conhecimento ministrando workshops internos\n\nInvestimento em cursos e formações superiores\n\nVale refeição\n\nPlano de saúde integral com possibilidade de upgrade\n\nPlano odontológico\n\nSeguro de vida\n\nDay off no seu aniversário\n\nEquipamentos necessários para seu trabalho\n\nHome-Office Híbrido\n\nDESCRIÇÃO DA EMPRESA\n\nA ProcessMind nasceu em 2002, fruto da fusão de duas outras consultorias que já atuavam no mercado desde 1996: uma delas especializada em projetos de consultoria em gestão de processos e qualidade, e a outra cujo atuação estava voltada principalmente para o desenvolvimento de sistemas sob medida para seus clientes. O resultado desta união foi uma combinação interessante e eficaz de competências complementares, que é exatamente onde está o valor agregado e diferencial de nossos serviços, sendo nosso foco melhorar a performance dos processos de negócio de nossos clientes através do uso da tecnologia. Ao longo de todos estes anos de atuação, com a execução de diversos projetos tanto de mapeamento e análise como de automação de processos, pudemos aperfeiçoar nossas metodologias de trabalho, baseadas principalmente nos conceitos ágeis de desenvolvimento, e passamos a prestar serviços contínuos tanto de gestão contínua dos processos melhorados como de operação e suporte dos sistemas entregues aos nossos clientes. Fruto de um destes desenvolvimentos, lançamos um produto específico para gestão operacional e financeira de Jobs de marketing e publicidade, o JobOne, hoje já implantado com sucesso em diversas agências de publicidade e promoção.",
    "Etapas": "-"
  },
  {
    "createdAt": "16/05/2023",
    "company": "FCamara",
    "platform": "GUPY",
    "idInPlatform": "4734899",
    "title": "Desenvolvedor(a) Front End React.js Sênior",
    "url": "https://fcamara.gupy.io/jobs/4734899?jobBoardSource=gupy_opportunities",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": true,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nA FCamara está em busca de uma Pessoa Desenvolvedora Front React SR para atuar em uma das maiores empresas da América Latina líder no mercado em exames diagnósticos clínicos.\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\n\n\n\n\n• Desenvolvimento de aplicações web;\n\n\n\n• Manutenção de sistemas para correção de falhas/erros;\n\n\n\n• Implementação de melhorias;\n\n\n\n• Realizar Pair Programming;\n\n\n\n• Fazer Code Review do código desenvolvido por seus colegas;\n\n\n\n• Aprender e ensinar com seus colegas de equipe;\n\n\n\n• Desenvolver e manter testes unitários do código da aplicação;\n\n\n\n• Atuar como parte da equipe ágil;\n\n\n\n• Desenvolver, implantar e operar aplicações na cultura DevOps;\n\n\n\n• Desenvolver as funcionalidades de contato com o usuário;\n\n\n\n• Otimizar a aplicação para melhor velocidade e escalabilidade;\n\n\n\n• Garantir a validação dos dados fornecidos pelos usuários;\n\n\n\n• Criar código e bibliotecas reutilizáveis para uso futuro;\n\n\n\n• Colaborar com outros membros da equipe, Engenheiros, PO, QA, Designers, Scrum Master e Tech Leader para resolver os desafios existentes.\n\n\n\n \n\n\n\nREQUISITOS E QUALIFICAÇÕES\n\nREQUISITOS E QUALIFICAÇÕES\n\n\n\n• Sólido Conhecimentos em aplicações web com Frontend em React.\n\n\n\n• Conhecimento em backend NodeJs;\n\n\n\n• Sólido Conhecimentos Javascript (ES6), TypeScript, CSS3 e HTML5.\n\n\n\n• Sólido conhecimento em testes unitários utilizando Jest;\n\n\n\n• Conhecimento em Pré-processadores de estilo (SASS/SCSS ou outros).\n\n\n\n• Experiência com microsfront-end e federation;\n\n\n\n• Conhecimento avançado em versionamento de código (Git);\n\n\n\n• Desejável Conhecimentos da cultura DEVOPS (Jenkins, Pipeline scripts).\n\n\n\n \n\n\n\nDIFERENCIAL\n\n\n\n• Experiência com cloud Azure;\n\n\n\nTRANSFORMAMOS MUNDOS SONHADOS EM TRAJETÓRIAS REAIS.🧡🚀\n\n\n\n\n\nAqui somos #SangueLaranja!\n\n\n\n\n\nEstamos há 16 anos no mercado, lado a lado com nossos clientes, proporcionando experiências transformadoras. \n\n\n\nSomos um ecossistema de tecnologia e inovação, com expansão global; atuamos no Brasil, Portugal e Reino Unido. 🌎\n\n\n\n  \n\n\n\nF de Formação: acreditamos na prática da cultura do compartilhamento, no senso de comunidade, e que o conhecimento\n\n\n\ntem o poder da transformação!\n\n\n\n \n\n\n\nPossuímos iniciativas, e ações sociais, que promovem o desenvolvimento, como a comunidade tech Orange Juice, o Programa de Formação,\n\n\n\nnossa escola de liderança e diversas parcerias com ONGs e Edtechs. \n\n\n\n  \n\n\n\nNa FCamara todos são bem-vindos, para nós, Diversidade, Respeito e Ética, são elementos inegociáveis e fazem parte do nosso DNA. \n\n\n\n  \n\n\n\nE aí, está pronto para fazer parte de um time incrível e ser protagonista da própria história? ",
    "Etapas": "16/05/2023 - Aplicação para a vaga\n23/05/2023 - Email com recusa por falta de anos de experiência"
  },
  {
    "createdAt": "16/05/2023",
    "company": "Hotmart",
    "platform": "Indeed",
    "idInPlatform": null,
    "title": "Desenvolvedor(a) Front-end- 3120",
    "url": "https://br.indeed.com/viewjob?jk=14ac40416a60601f",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "O que você precisa saber sobre esta vaga\n\nO nosso time de Desenvolvimento é uma das principais engrenagens da Hotmart, utilizando o que há de mais inovador entre as tecnologias do mercado. Por isso, estamos à procura de um(a) desenvolvedor(a) front-end que não poupe esforços para descobrir as melhores tecnologias para proporcionar aos nossos usuários uma experiência impecável.\n\nSuas responsabilidades / Seu dia a dia\n\nAtuar na construção de soluções que objetivem agir sobre problemas de diversos níveis de complexidade, buscando sempre otimizar os nossos processos e tecnologias;\n\nAtuar na análise, definição, desenho técnico e na proposta de solução para o escopo de um problema;\n\nRealizar a implantação da solução desenvolvida;\n\nAnalisar os possíveis pontos de impacto que afetem a execução técnica do trabalho;\n\nRevisar a qualidade das soluções propostas pelos seus pares.\n\nQualificações que você precisa ter:\n\nInglês intermediário;\n\nDominar JavaScript, TypeScript, HTML, CSS, ES6 e ES7;\n\nSólido conhecimento e experiência em React;\n\nConsiderável experiência em modelagem e arquitetura front-end, integrações utilizando API REST e com controle de versão, preferencialmente Git e uso do GitHub.\n\nVocê terá ainda mais vantagens se possuir…\n\nConhecimento em Vue, Flux, bundlers e transpilers;\n\nExperiência com metodologias ágeis, PWA e Service Workers.\n\nBenefícios\n\nPlano de saúde e odontológico;\n\nBolsa de idiomas e incentivo à educação;\n\nVale Refeição/Alimentação em cartão flexível;\n\nLicença Maternidade e Paternidade estendidas;\n\nAuxílio kids;\n\nBonificações e Participação nos Lucros;\n\nHotmart Recharge: Bônus de 30% como incentivo à utilização das férias dentro do período aquisitivo;\n\nSaúde e Bem-estar: parceria com rede de psicólogos, nutricionistas e Gympass.\n\nPor que a Hotmart?\n\nFundada em 2011, a Hotmart é uma empresa global de tecnologia, líder em produtos digitais e focada na Creator Economy (Economia dos Criadores de Conteúdo). Nossa missão é possibilitar que as pessoas vivam de suas paixões, transformando sua audiência em clientes, habilidades em produtos, e influência em negócios.\n\nNa Hotmart, você vai encontrar um ambiente com pessoas que são apaixonadas pelo que fazem, entusiasmadas para inovarem e se desenvolverem sempre alinhadas aos pilares da nossa cultura: Liberdade, Autonomia e Love.\n\nDiversidade e Inclusão\n\nA Hotmart é formada por pessoas apaixonadas, diversas e autênticas. Nossas oportunidades são abertas para profissionais, independentemente de gênero, raça/etnia, orientação afetivo-sexual, idade, deficiência, condição física ou religião. O que importa é seu talento e o seu desejo de disseminar nossa missão pelo mundo.\n\nVenha com a gente!\n\nConheça a Hotmart\n\nSite",
    "Etapas": "-"
  },
  {
    "createdAt": "17/05/2023",
    "company": "Devoteam",
    "platform": "LINKEDIN",
    "idInPlatform": "3609944446",
    "title": "ReactJS Developer",
    "url": "https://www.linkedin.com/jobs/view/3609944446/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=sTzT2p4N267ss8jE8T2lLg%3D%3D&trackingId=jpZYsUOs8AgJlYX%2FCgzQeg%3D%3D&trk=flagship3_search_srp_jobs",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "Sobre a vaga\n\nAbout Devoteam\n\n\n\nAt Devoteam, we believe that technology with strong human values can actively drive change for the better. Discover how Tech for People unlocks the future, creating a positive impact on the people and the world around us. We are a global leading player in Digital Transformation for leading organisations across EMEA, with a revenue of €652M. We believe in transforming technology to create value for our clients, partners and employees in a world where technology is developed for people. We are proud of the culture we have built together. We are proud of our people at the service of technology. We are proud of our diverse environment. Because we are #TechforPeople. Join our multidisciplinary team of Cloud experts, Designers, Business consultants, Security experts, Engineers, Developers and other extraordinary talents, spread across more than 18 EMEA countries. Become one of our +8.000 tech and business leaders on cloud, data and cyber security. Let’s fuse creativity with technology together and build innovative solutions that actively change things for the better.\n\n\n\nAbout the job\n\n\n\nWe are currently looking for a ReactJS Developer.\n\n\n\nIf this opportunity is for you, apply today!\n\n\n\nWe will rely on you to\n\n\n\nDeveloping and maintaining software features based on visual mockups and UX descriptions,\n\nWriting tests,\n\nDelivering high-quality code, which is both functional and performant,\n\nSOLID understanding of best practices, processes and patterns in software development,\n\nContributing to the infrastructure that the team leverages for development,\n\nCode reviewing.\n\n\n\nWhat we're looking for\n\n\n\nBachelors’ degree in Computer Science or similar;\n\n>2 years of working experience with ReactJS;\n\nExperience with JavaScript or Typescript;\n\nStrong Knowledge of HTML and CSS;\n\nKnowledge of MySQL and/or PostgreSQL;\n\nExperience with agile environment with scrum framework;\n\nFluency in English (written and spoken).\n\n\n\nDoes this sound like you?\n\n\n\nCome build with us, innovative solutions that actively change things for the better.\n\n\n\nApply today!",
    "Etapas": "-"
  },
  {
    "createdAt": "17/05/2023",
    "company": "InnoTech.pt",
    "platform": "LINKEDIN",
    "idInPlatform": "3483131716",
    "title": "Front-End Developer (Remote)",
    "url": "https://www.linkedin.com/jobs/view/3483131716/?alternateChannel=search&refId=sTzT2p4N267ss8jE8T2lLg%3D%3D&trackingId=eFsI6dZJYox4z%2Bog8k0dbA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": true,
    "type": "REMOTE",
    "description": "Sobre a vaga\n\nA Company you will be happy to grow with!\n\n\n\nAt InnoTech it´s all about connecting people with business through technology.\n\n\n\nWe care about you, your happiness and well-being. We seek people that want to learn and further improve their skills with us - growth is part of our DNA.\n\n\n\nFor us, sustainability is not just a word. Integrity and social responsibility leads our behaviour.\n\n\n\nWe dare to be different, to be ambitious, to dream big, to deliver value like no other! You will have the opportunity to work with top-level partners in banking area, insurance, retail, telecommunications, financial services, and so much more!\n\n\n\nWe are 100+ InnoTechers and we want your talent as a Front-End Developer.\n\n\n\n\n\nYou Will Need\n\n\n\nAt least 4 years of experience as a React Developer;\n\nKnowledge of Git and Code Versioning tools.\n\n\n\nWould Be Awesome If You Have\n\n\n\nBSc or MSc in Computer Science/Engineering, Information Technology, or related fields;\n\nExperience working with JavaScript frameworks;\n\nService-Oriented Architectures and Microservices Architectures;\n\nExperience with CI/CD tools.\n\n\n\nWith Us You Can Be a\n\n\n\nTechThinker – people who want to re-imagine technology with us;\n\nTechSolver – strategic, resilient, and little bit a puzzle lover;\n\nInnoMinder – inhale innovation, exhale digital transformation;\n\nInnoTecher – no words needed. Just happiness, talent and all the above!\n\n\n\nAre you convinced? Come see it for yourself.\n\n\n\nJoin our Top-Notch Team!",
    "Etapas": "18/05/2023 - Aplicação para vaga\n18/05/2023 - Email solicitando visto de trabalho"
  },
  {
    "createdAt": "17/05/2023",
    "company": "Chess.com",
    "platform": "CHESS",
    "idInPlatform": "226412",
    "title": "Senior FrontEnd Engineer",
    "url": "https://chesscom.rippling-ats.com/job/226412/senior-frontend-engineer",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": true,
    "type": "REMOTE",
    "description": "About Us\n\n\n\n\n\n\n\nChess.com is one of the largest gaming sites in the world and the #1 platform for playing, learning, and enjoying chess.\n\n\n\nWe are a team of 600+ fully remote people in 60+ countries working hard to serve the global chess community. We are here to support 100M+ chess players worldwide with the best possible product, content, and tools to serve the community!\n\n\n\nWe are a tech company. A gaming company. A content company. And we do it all with passion and commitment to the game. Above all we prize our mission-driven, flat, life-celebrating, no-corporate culture, and we look forward to meeting you and learning more about what you can bring to the team.\n\n\n\nAbout You\n\n\n\nYou are a master of coding languages with a designer's eye for detail. You know how to see through the eyes of the user and develop a smooth platform experience.  You are humble with a sense of humor and don’t take yourself too seriously.  You have been working in or dreamed of working in the gaming industry and are ready to turn your talents towards chess!\n\n\n\n\n\nWhat You’ll Do\n\n\n\nThrough a combination of design, technology, and programming to code you will ensure our platform is a seamless experience\n\nYou will maintain the system by identifying and fixing bugs\n\nYou will collaborate with design and development teams to implement new features and products.\n\n\n\nPreferred Skills\n\n\n\nExpert level CSS knowledge including Flexbox and Grid layout\n\nExpert level CSS preprocessor knowledge including SCSS\n\nExcellent understanding of component based Javascript/Typescript architectures such as Vue\n\nFamiliar with local scope CSS strategies such as Scoped CSS and CSS Variables\n\nAbility to create pixel perfect, fully responsive design implementations with minimal CSS\n\nWorks well with others doing PRs, code reviews, etc\n\nExperience working with diverse teams, large projects, and high-traffic sites is a bonus\n\nStrong collaboration and communication skills working in a fully distributed team\n\nSense of ownership and responsibility\n\nChess player\n\nLifelong learner\n\nAbout the Opportunity\n\n\n\nThis is a full time or equivalent position\n\nWe are 100% remote (work from anywhere!)\n\nThis is open to applicants from anywhere!\n\nLinks\n\n\n\nYou can learn more about us here:\n\n\n\nhttps://www.chess.com/blog/erik/how-chess-com-s-100-person-virtual-team-works-together\n\nhttps://www.chess.com/about \n\n\n\n\n\nWe look forward to meeting you!",
    "Etapas": "18/05/2023 - Aplicação para a vaga\n19/05/2023 - Email com recusa"
  },
  {
    "createdAt": "18/05/2023",
    "company": "Portobello",
    "platform": "GUPY",
    "idInPlatform": "3569578",
    "title": "Pessoa Desenvolvedora Front-end React",
    "url": "https://portobello.gupy.io/job/eyJqb2JJZCI6MzU2OTU3OCwic291cmNlIjoibGlua2VkaW4ifQ==?jobBoardSource=linkedin",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": true,
    "type": "REMOTE",
    "Etapas": "18/05/2023 - Aplicação para a vaga\n19/05/2023 - Congelamento da vaga"
  },
  {
    "createdAt": "18/05/2023",
    "company": "Meta",
    "platform": "RECRUT_AI",
    "idInPlatform": "V4K34F",
    "title": "Desenvolvedor React Pleno",
    "url": "https://meta.jobs.recrut.ai/job/V4K34F?source=linkedin",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": true,
    "type": "REMOTE",
    "description": "Job Description - Desenvolvedor React Pleno - Immediate Start\n\nWe are looking for an expert Desenvolvedor React Pleno to join our amazing team at Meta in São Leopoldo, RS.\n\nGrowing your career as a Full Time Desenvolvedor React Pleno is an incredible opportunity to develop relevant skills.\n\nIf you are strong in presentation, adaptability and have the right experience for the job, then apply for the position of Desenvolvedor React Pleno at Meta today!\n\n\n\nEstamos muito felizes que você queira fazer parte do nosso time!\n\nSobre o Cargo:\n\nDesenvolver aplicações web com foco em Front-End;\n\nProgramar, codificar e testar sistemas na linguagem, transitando entre projetos\n\nde desenvolvimento Front-End e Back-End;\n\nExecutar o desenvolvimento das funcionalidades complexas;\n\nManter os padrões de projeto existentes e sugerir melhorias;\n\nValidar as novas funcionalidades das aplicações;\n\nExecutar a manutenção dos sistemas, fazendo eventuais correções necessárias,\n\nvisando atender às necessidades dos usuários;\n\nDesenvolver trabalhos de montagem, depuração e testes de programas, executando\n\nserviços de manutenção nos programas já desenvolvidos;\n\nUtilizar as melhores práticas de desenvolvimento.\n\nO que você precisa para participar desse processo seletivo?\n\nExperiência mínima de 2 (dois) anos em desenvolvimento de aplicações web com\n\nfoco em Front-End;\n\nPrincipais tecnologias: React, NextJS, Javascript, Typescript, NodeJS, HTML,\n\nCSS;\n\nConhecimentos em Design System.\n\nO que faz com que você seja um diferencial entre seus concorrentes?\n\nSua capacidade de colaborar em equipes remotas e com pertencimento inerente ao\n\nprocesso ágil serão um grande diferencial, além da vontade de estar em constante\n\nevolução técnica e pessoal.\n\nBenefits of working as a Desenvolvedor React Pleno in São Leopoldo, RS:\n\n\n\n● Excellent benefits\n\n● Advancement opportunities\n\n● Advantageous package",
    "Etapas": "18/05/2023 - Aplicação para a vaga\n02/06/2023 - Congelamento da vaga"
  },
  {
    "createdAt": "18/05/2023",
    "company": "Nuvem",
    "platform": "GUPY",
    "idInPlatform": "4485855",
    "title": "Pessoa Desenvolvedora FrontEnd Sênior (typescript & reactjs)",
    "url": "https://nuvem.gupy.io/job/eyJqb2JJZCI6NDQ4NTg1NSwic291cmNlIjoibGlua2VkaW4ifQ==?jobBoardSource=linkedin",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": true,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nVocês sabiam que a Nuvem Tecnologia é uma empresa de desenvolvimento de software, com mais de 10 anos de experiência no mercado? Carregamos em nosso DNA uma cultura de inovação, criatividade e cuidado com pessoas que reflete diretamente no valor que entregamos para nossos colaboradores, parceiros e clientes 💙\n\n\n\n\n\n\n\nHoje o nosso time se encontra espalhado pelo Brasil, carregando nossa cultura de inclusão, diversidade e inquietação para encontrar soluções criativas! 🎯\n\n\n\n\n\n\n\nSe o seu perfil é de uma pessoa que preza pela boa experiência de pessoas para pessoas, então aqui pode ser o seu lugar! ☁️☁️\n\n\n\n\n\n\n\nVamos te oferecer \n\n\n\n\n\n\n\nGympass - nós valorizamos o equilíbrio na vida das nossas pessoas, por isso incentivamos a prática de exercícios e atividades que promovam autocuidado 🧘🏽‍♂️🥇\n\nAcesso na plataforma Alura e apoio em cursos de capacitação - queremos te apoiar no seu aprendizado contínuo 📚🤓\n\nJornada de trabalho flexível - para nós, o que realmente importa são as entregas com qualidade e as relações juntas e transparentes com o seu time ⌚️\n\nRemuneração competitiva - feedback é bom e somado com reconhecimento financeiro é melhor ainda, né? 🤝🏆\n\nEquipamentos de trabalho modernos - acreditamos que o equipamento de trabalho deve ser seu aliado na criação de soluções inovadoras 💻📱\n\nIndicação vale ouro - As indicações sempre foram um ponto positivo na nossa cultura, e somos gratos ao nosso time que confia a nós o futuro profissional de seus amigos e colegas 🥇\n\nDia de folga para aniversariantes - Você merece descansar e comemorar o seu dia 🎉🍻\n\nFolgas semestrais - aqui na Nuvem nossas pessoas são incentivadas a pausas para o descanso 📅🏖\n\nMentorias - nosso objetivo é acelerar o seu crescimento de maneira rápida e eficaz para que você atinja seus objetivos pessoais e profissionais 🎯🚀\n\nJornada de carreira - você não estará sozinhx, nós iremos embarcar junto contigo nessa jornada de desafios & aprendizados.\n\n\n\n\n\n#issoésernuvem\n\n\n\n#ambiçãoparacrescerjuntos\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\nSua principal missão será ...\n\n\n\n\n\nManter uma base de código atualizada e prezar pela qualidade e consistência da base de código.\n\n\n\n\n\nPrincipais atividades junto ao time\n\n\n\n\n\nContribuir com tomadas de decisões junto ao time;\n\nRealizar avaliação dos códigos;\n\nImplementar os projetos propostos;\n\nInstruir e acompanhar os colegas desenvolvedores sempre que necessário;\n\nEscrever a avaliar testes (unitários, de componentes ou integração).\n\nREQUISITOS E QUALIFICAÇÕES\n\nEstamos buscando pessoais com ...\n\n\n\n\n\nVivência sólida em projetos usando ReactJs;\n\nExperiência com TypeScript;\n\nExperiência com versionamento de código usando Github;\n\nExperiência em pré - processadores CSS e Styled Components;\n\nConhecimento em Docker;\n\nConhecimento e experiência com testes. \n\n\n\nCompetências Comportamentais:\n\n\n\nCuriosidade, comprometimento, criatividade, trabalho em equipe, pensamento crítico e desejo em aprender.\n\n\n\n\n\nPessoas & Tecnologia & Negócios 💙\n\n\n\nVem ser Nuvem ☁️\n\n\n\nINFORMAÇÕES ADICIONAIS\n\n✅ Trabalho full remoto;\n\n\n\n✅ Necessário disponibilidade para eventuais viagens\n\n\n\nPESSOAS & TECNOLOGIA!\n\nNão tem sensação melhor que acordar para trabalhar e ter um ambiente onde as pessoas do time são amigáveis e protagonistas das suas próprias trajetórias! Aqui na Nuvem nós prezamos por uma jornada de trabalho horizontal pensada no bem-estar e no desenvolvimento das nossas pessoas. Somos uma empresa matogrossense de desenvolvimento de soluções tecnológicas com 12 anos de experiência no mercado de softwares e aplicativos, carregamos em nosso DNA uma cultura de inovação, criatividade e cuidado com pessoas, que reflete diretamente no valor que entregamos para nossos parceiros e clientes 💙",
    "Etapas": "18/05/2023 - Aplicação para a vaga\n19/05/2023 - Email com recusa"
  },
  {
    "createdAt": "18/05/2023",
    "company": "INDI Staffing Services",
    "platform": "LINKEDIN",
    "idInPlatform": "3605406254",
    "title": "Work From Home React Developer",
    "url": "https://www.linkedin.com/jobs/view/3605406254/?alternateChannel=search&refId=2I%2BIvDGMSch3p%2F5A%2Ft31GA%3D%3D&trackingId=j5tqMbngu5NEB7SpD%2F6R0w%3D%3D&trk=d_flagship3_jobs_discovery_jymbii&lipi=urn%3Ali%3Apage%3Ad_flagship3_jobs_discovery_jymbii%3BYOTON9enSl6uFb0wpYMX2A%3D%3D",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "Etapas": "-"
  },
  {
    "createdAt": "18/05/2023",
    "company": "Trustly",
    "platform": "LINKEDIN",
    "idInPlatform": "3555393870",
    "title": "Senior Front-End Engineer",
    "url": "https://www.linkedin.com/jobs/view/3555393870/?alternateChannel=search&refId=2I%2BIvDGMSch3p%2F5A%2Ft31GA%3D%3D&trackingId=HerxzDLET%2B6P0wXZnixRwQ%3D%3D&trk=d_flagship3_jobs_discovery_jymbii&lipi=urn%3Ali%3Apage%3Ad_flagship3_jobs_discovery_jymbii%3BnihRHbp7TtyNRcKRZZj%2FVQ%3D%3D",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "Sobre a vaga\n\nWho We Are\n\n\n\n\n\n\n\nFounded in 2008, Trustly is the global leader in Open Banking Payments, and the U.S. is Trustly’s fastest-growing market. Today we serve 10,000 merchants, connecting them with over 650 million consumers and 7,600 banks in over 30 countries. In 2021, we processed over $20 billion in transaction volume in our global network.\n\n\n\n\n\n\n\nOur digital account-to-account platform redefines the speed, simplicity, and security of payments. Consumers pay for purchases by simply signing into their bank accounts, bypassing the card networks, and never leaving a merchant’s site or app – no credit card numbers or separate account setup necessary. With offices in Vitoria, Brazil, Silicon Valley in the US, and global headquarters in Stockholm, Sweden, we are a culturally diverse team. Across Brazil, we have embraced remote work from home policy.\n\n\n\n\n\n\n\nAt Trustly, we believe that inclusion and diversity are essential foundations for building a fair and equitable society. We do not discriminate based on race, religion, ancestry, color, national origin, gender identity, sexual orientation, age, citizenship, marital status, or disability status. Our main goal is to provide a fair, welcoming, diverse environment with opportunities for all collaborators. The stages of our selection process take place online and without distinction of any kind.\n\n\n\n\n\n\n\nIt’s a great time to join Trustly as the Americas team is growing fast. If you thrive in an entrepreneurially-minded, fast-paced, casual, professional, positive, and rewarding work environment, check us out!\n\n\n\n\n\nAbout the team:\n\n\n\n\n\n\n\nThe Customer Experience team is responsible for the entire presentation layer of Trustly for our customers. Our focus is to offer the best experience with a simple, efficient and accessible platform.\n\n\n\n\n\n\n\nWhat you'll do:\n\n\n\n\n\nCreate and maintain features in Web including integration scripts applications and be able to develop unit tests for the same features.\n\nResponsible to investigating problems in applications in collaboration with support teams, backend teams and merchant teams.\n\nPropose and do refactors.\n\nEstimate efforts for tasks with a high level of accuracy.\n\nAnalyze large volumes of data to find possible problems and propose performance improvements.\n\nIdentify performance issues and propose solutions.\n\nParticipate in technical meetings and propose solutions to problems.\n\nCreate alarms in metrics systems used by the company.\n\nIndicate new tools and technologies.\n\nSupport new developers on company and train them on the development process, patterns and features.\n\nParticipate in functional meetings with non-engineering teams with knowledge about all front end features and with skills to propose solutions.\n\nDocument features in the available tool.\n\nCreation of integrated tests in the tool provided.\n\nIn refinement meetings, analyze all proposals and be able to define the best solution.\n\nBe able to participate in war rooms and create an action plan.\n\n\n\n\n\nWho you are:\n\n\n\n\n\nExperience developing/designing software systems.\n\nUnderstanding of layout aesthetics, and a drive to create thoughtful UX experiences and pixel-perfect web pages.\n\nExcellent coding skills in Javascript (ES6), HTML and CSS.\n\nExpert in React Framework.\n\nExcellent coding skill and understanding of OO concepts.\n\nPrevious experience with source control.\n\nStrong written and verbal English skills is a plus.\n\n\n\n\n\nOur perks and benefits:\n\n\n\n\n\nBradesco health and dental plan, for you and your dependents, with no co-payment cost\n\nLife insurance with differentiated coverage\n\nMeal voucher and supermarket voucher\n\nHome Office Allowance\n\nGympass - Platform that gives access to spaces for physical activities and online classes\n\nTrustly Club - Discount at educational institutions and partner stores\n\nMonthly happy hours with iFood coupon\n\nEnglish Program - Here you have space to develop your English, and you can choose an Online Platform or English Classes in company\n\nExtended maternity and paternity leave\n\nBirthday Off\n\nFlexible hours/Home Office - our culture is remote-first! You can work in every city in Brazil\n\nWelcome Kit - We work with Apple equipment (Macbook Pro, iPhone) and we send many more treats! Spoiler alert: Equipment can be purchased by you according to internal criteria!\n\nAnnual premium - As a member of our team, you are eligible to receive an annual bonus, at the company's discretion, based on the achievement of our KPI's.\n\nReferral Program - If you refer a candidate and we hire the person, you will receive a reward for that!\n\n\n\n\n\n#LIRemote\n\n\n\n\n\n\n\nCheck out our Brazil Life page on LinkedIn for more details about Brazil, our culture and much more.\n\n\n\n\n\nAt Trustly, we embrace and celebrate diversity of all forms and the value it brings to our employees and customers. We are proud and committed to being an Equal Opportunity Employer and believe an open and inclusive environment enables people to do their best work. All decisions regarding hiring, advancement, and any other aspects of employment are made solely on the basis of qualifications, merit, and business need.\n\n\n\n\n\nWant to make a difference in a fast-growing business? Apply now!",
    "Etapas": "-"
  },
  {
    "createdAt": "18/05/2023",
    "company": "Trade Technology",
    "platform": "GUPY",
    "idInPlatform": "4802189",
    "title": "Desenvolvedor Front End - Home Office",
    "url": "https://tradetechnology.gupy.io/job/eyJqb2JJZCI6NDgwMjE4OSwic291cmNlIjoibGlua2VkaW4ifQ==?jobBoardSource=linkedin",
    "numberOfInterviews": 0,
    "numberOfTests": 1,
    "recused": true,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nEntendemos que a nossa missão é entregar soluções inteligentes e em gerar valor para todos os envolvidos.\n\n\n\nA Trade Technology conta com uma equipe diversificada e altamente capacitada, oferecendo Consultoria On Demand, soluções efetivas, flexíveis e qualificadas em TI, softwares de inteligência cognitiva e infraestrutura objetivando simplificar a gestão de negócio dos nossos clientes.\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\nComo DEV. TRADE você ajudará nossos clientes a terem acesso a inovação, inteligência artificial e ciência de dados.\n\n\n\nDesenvolverá APIs e softwares customizados e apoiará especialistas para o desenvolvimento de robôs de automação de leitura e extração de dados com machine learning, inteligência artificial e processamento de linguagem natural. Atuar em projetos de clientes de diferentes tipos e regras de negócio.\n\n\n\nProcuramos um profissional comprometido e proativo para buscar novidades e tecnologias para agregar valor as soluções e ao time da Trade.\n\n\n\nREQUISITOS E QUALIFICAÇÕES\n\nConhecimento em HTML, CSS e Javascript/Typescript;\n\nExperiência com ReactJS/Angular;\n\nIntegrações com APIs;\n\nControle de versão com o GIT;\n\nTestes Unitários (Jest/Jasmine);\n\nÉ necessário ter concluído ou estar cursando graduação em Tecnologia da Informação, Ciência da Computação, Engenharia da Computação, Sistemas de Informação, Análise e Desenvolvimento de Sistemas ou áreas afins.\n\n\n\nDiferenciais\n\n\n\nConhecimento em Redux/Flux, React Hooks e RxJS;\n\nConhecimento em TDD e Testes E2E;\n\nConhecimento em Banco de Dados SQL e/ou NoSQL;\n\nExperiência com NodeJS.\n\nINFORMAÇÕES ADICIONAIS\n\nVaga CLT\n\nModelo 100% home office ou híbrido\n\n\n\nBenefícios:\n\nIncentivo a Capacitação\n\n\n\nA sede pelo conhecimento faz parte do nosso dia-a-dia! Incentivamos a capacitação dos nossos colaboradores e apoiamos sua trajetória em eventos e jornadas de certificação.\n\n\n\nIncentivamos a capacitação dos nossos colaboradores e apoiamos seu crescimento oferecendo participação em eventos e certificações.\n\n\n\nSomos parceiros IBM, Oracle, Microsoft e de outros players do mercado de tecnologia, o que garante acesso às plataformas de treinamento online mais renomadas do mundo todo.\n\n\n\n\n\nVale Alimentação e Refeição\n\n\n\nFlexível - Flash Cartões\n\n\n\nPara manter as energias necessárias para realizar os desafios diários você recebe um cartão com créditos mensais para utilizar em lanchonetes, restaurantes, mercados e estabelecimentos cooperados.\n\n\n\n\n\nPlano de Saúde\n\n\n\nZelamos pelo seu bem-estar e para isso oferecemos um plano de saúde corporativo.\n\n\n\n\n\nPlano Odontológico\n\n\n\nNossos colaboradores recebem um plano odontológico 100% para realizar os mais diversos procedimentos dentais. Mais motivos para sorrir! Assim como o plano de saúde, também oferecemos aos nossos colaboradores, plano odontológico sem custos algum de mensalidade.\n\n\n\n\n\nPlano de Carreira\n\n\n\nPlanejar o futuro faz parte da ideologia da Trade Technology. Através da definição de metas a curto/ médio e longo prazo e uma política de feedbacks, estimulamos o crescimento profissional dos nossos colaboradores. Definimos metas de curto a longo prazo e estabelecemos feedbacks periódicos para que o progresso de todos seja pleno e contínuo.\n\n\n\n\n\nR2D2\n\n\n\nRecebemos créditos galácticos, nossa própria moeda, criada para dar acesso à geladeira mais amada do pedaço que carinhosamente chamamos de R2D2, repleta de refris, energéticos, águas e sucos.\n\n\n\nOs créditos galácticos também abrem os portais do freezer Gela Boca, e quem resiste a um sorvetinho pós almoço!\n\n\n\n\n\nSeguro de Vida\n\n\n\nTodos os colaboradores da Trade Technology contam com seguro de vida ativo, custeado completamente pela empresa.\n\n\n\n\n\nBonificação\n\n\n\nA cada semestre, de acordo com as entregas e indicadores de cada área, realizamos as bonificações dos times como forma de reconhecer todos o empenho e dedicação envolvidos no período.\n\n\n\n\n\nPlataforma de Gestão de Pessoas\n\n\n\nUtilizamos a plataforma Qulture.Rocks para incentivar nossa cultura de feedback\n\n\n\nÉ pelo Qulture que alinhamos nossas prioridades semanais, fazemos e recebemos elogios, marcamos reuniões de metas, gestão de OKRS e planos de desenvolvimento com nossos gestores. Essa plataforma auxilia gestores, RH e todos os colaboradores para que não desviem de seus objetivos, de modo intuitivo, fácil e divertido.\n\n\n\n\n\n﻿Área:\n\n\n\nInformática, TI, Internet e Telecomunicação\n\n\n\nDESCRIÇÃO DA EMPRESA\n\nVamos criar soluções inteligentes e fazer a diferença juntos?\n\nQueremos gerar valor e fazer a diferença na vida de todos que nos rodeiam.\n\n\n\nA Trade Technology acredita e incentiva talentos, investindo continuamente na evolução de seus colaboradores. Contamos com o modelo de trabalho home office e híbrido, assim, nossa sede possui um ambiente acolhedor e descontraído, na qual aproveitamos para realizar reuniões presenciais, rever outros times e também aproveitar as delícias da R2D2.  \n\n\n\n\n\nSe você busca crescimento profissional, faça parte dessa história!​\n\n\n\nAbaixo você conhece um pouco mais das nossas áreas e também das vagas em aberto.\n\n\n\n\n\n\n\n\n\nCiência Cognitiva\n\nA Ciência Cognitiva tem como visão transformar o futuro por meio do tratamento da informação, atuando diretamente na personalização de serviços e criação de produtos inovadores com tecnologia de ponta.\n\n\n\nModelo de trabalho: remoto | híbrido.\n\n\n\nParcerias: IBM, Oracle, Lenovo, entre outros grandes players do mercado de tecnologia que garantem certificações e plataformas para execução das entregas.\n\n\n\n\n\n\n\n\n\nInfraestrutura de TI\n\nNosso time de Infraestrutura é destaque pelo conhecimento técnico agregado e reconhecido como ativo estratégico pelos nossos clientes.\n\n\n\nSua missão é implantar e sustentar soluções de TI com foco em agilidade e qualidade.\n\n\n\nModelo de trabalho: remoto | híbrido\n\n\n\nParcerias: IBM, Oracle, Lenovo, VMware, entre outros grandes players do mercado de tecnologia que garantem certificações, atualizações e plataformas para realização das entregas.\n\n\n\n\n\n\n\n\n\nConsultoria\n\nA Consultoria entrega soluções de valor que sejam apropriadas às necessidades de cada cliente.\n\n\n\nEssa é a área responsável por potencializar o sucesso dos nossos clientes, entregando serviços em conformidade com as expectativas alinhadas, partindo dos princípios gerais de Segurança da Informação e Lei Geral de Proteção de Dados.\n\n\n\nModelo de trabalho: remoto | híbrido",
    "Etapas": "18/05/2023 - Aplicação para a vaga\n19/05/2023 - Entrega do teste técnico\n12/06/2023 - Email com recusa"
  },
  {
    "createdAt": "18/05/2023",
    "company": "Saúde Pra Já",
    "platform": "LINKEDIN",
    "idInPlatform": "3606888402",
    "title": "Software Engineer",
    "url": "https://www.linkedin.com/jobs/view/3606888402/?alternateChannel=search&refId=2I%2BIvDGMSch3p%2F5A%2Ft31GA%3D%3D&trackingId=tPcjoqRKIZmdvtv7URCmpw%3D%3D&trk=d_flagship3_jobs_discovery_jymbii&lipi=urn%3Ali%3Apage%3Ad_flagship3_jobs_discovery_jymbii%3BnihRHbp7TtyNRcKRZZj%2FVQ%3D%3D",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": true,
    "type": "REMOTE",
    "description": "Sobre a vaga\n\nDesenvolvedor(a) Pleno Full-stack\n\n\n\nProcuramos uma pessoa com experiência de trabalho com Django, que também seja apaixonada pelo propósito de facilitar o acesso à saúde, por desafios e pelo crescimento.\n\n\n\n\n\nSeu papel aqui:\n\n\n\nVocê vai contribuir para os fundamentos de um negócio, participando do planejamento, da definição e da priorização das entregas, visando gerar o maior impacto com o menor esforço. Deverá pesquisar, analisar e tomar decisões de desenvolvimento de tecnologia com muita responsabilidade e autonomia. Também irá rever código, apoiar e tirar dúvidas dos devs mais juniores, quando eles precisarem.\n\n\n\n\n\nAtividades:\n\n\n\nParticipar da definição e priorização das funcionalidades a serem desenvolvidas;\n\nApoio em decisões técnicas e orientação de estagiários de desenvolvimento;\n\nDesenvolvimento de funcionalidades usando o método ágil de desenvolvimento de produto;\n\nDeploy de novas funcionalidades e refatorações;\n\nCriação e manutenção de documentação do software (comentários em código, automatização de documentação e documentação de sistemas);\n\nRevisão e planejamento do banco de dados;\n\nIdentificação de melhorias e otimização para fins de SEO e de redução do tempo de carregamento;\n\nImplementação de tracking;\n\nIntegração com áreas administrativas, criação e alteração de APIs;\n\nCriação e manutenção de testes automatizados.\n\n\n\nPerfil:\n\n\n\nIdentificação com a visão da empresa, vontade contribuir e gerar resultados;\n\nOrganizado para trabalhar remotamente e excelente comunicação;\n\nProativo, team-player e que goste de contribuir para desenvolver pessoas.\n\n\n\nQualificação:\n\n\n\nExperiência com Django;\n\nExperiência com library ou framework de desenvolvimento frontend como Vue.JS;\n\nFluência em JavaScript, Python e SQL;\n\nConhecimento de boas práticas e clean code;\n\nExperiência com metodologias ágeis;\n\nExperiência geral de WEB e os protocolos envolvidos (HTTP, TLS, DNS, etc);\n\nExperiência com Vue e Nuxt.js é um diferencial;\n\nSerão considerados diferenciais conhecimento de SEO, AWS e segurança de dados.\n\n\n\nA startup:\n\n\n\nO Saúde Pra Já é um marketplace que tem a visão de facilitar o acesso a serviços de saúde de qualidade para todos os brasileiros. Nós conectamos pessoas que não têm plano de saúde a exames e consultas e qualquer serviço de saúde. Assim, ajudamos as pessoas a terem acesso aos serviços quando precisam e por um preço acessível, além de ajudar profissionais de saúde e clínicas a aumentarem o volume de atendimentos e faturarem mais.\n\n\n\nComeçamos em set/2020 e mais de 60 mil usuários já acessaram o site de buscas de serviços. Temos 3,5 mil MAU (Monthly Active Users) no site de pacientes e custo de aquisição de lead de R$ 10,00. Assim, atingimos 10% de salvamento de leads únicos por usuários. No site de parceiros, o cadastro online foi disponibilizado em fev/22 e desde lá mais de 700 parceiros já se cadastraram (+850% no ano). Já saímos na mídia em mais 30 artigos publicados, incluindo Pequenas Empresas & Grandes Negócios e UOL.\n\n\n\nNosso desafio é grande e temos muito trabalho, pois queremos mudar o setor de saúde no país. Queremos pessoas que se identificam com a visão, motivadas por gerar impacto positivo para a sociedade, que querem assumir responsabilidades e possivelmente obterem participação na empresa.\n\n\n\n\n\nRemuneração e condições:\n\n\n\nDedicação full-time e remuneração a combinar.\n\n\n\nO trabalho será completamente remoto, com contrato de PJ.\n\n\n\nPoderá ser concedida participação na empresa.\n\n\n\n\n\nEnviar CV para querosaudepraja@gmail.com\n\n\n\n\n\nSaiba mais sobre nós:\n\n\n\nSite para pacientes: www.saudepraja.com.br\n\n\n\nSite para parceiros: parceiros.saudepraja.com.br\n\n\n\nInstagram: @saude.pra.ja\n\n\n\nFacebook: @saudepraja",
    "Etapas": "18/05/2023 - Aplicação para a vaga\n21/05/2023 - Email com recusa"
  },
  {
    "createdAt": "18/05/2023",
    "company": "L.A. Head Hunter",
    "platform": "LINKEDIN",
    "idInPlatform": "3611355916",
    "title": "Work From Home React Developer",
    "url": "https://www.linkedin.com/jobs/view/3611355916/?alternateChannel=search&refId=2I%2BIvDGMSch3p%2F5A%2Ft31GA%3D%3D&trackingId=KEuBL3JZLLD6uvnjkLyH1Q%3D%3D&trk=d_flagship3_jobs_discovery_jymbii&lipi=urn%3Ali%3Apage%3Ad_flagship3_jobs_discovery_jymbii%3BWLMXUV%2BmQPSbiDesME6RhQ%3D%3D",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "Sobre a vaga\nRecognized as the leading software development company in the Americas, our client offers 100% remote modality and an excellent work environment in which employees can thrive, work in multicultural teams, with flexible schedules and endless growth opportunities.\n\n\nAbout the Role:\n\n\nWe are looking for React Senior Developers to join our Development team to design and implement user interface components for web and mobile applications using the React open-source library ecosystem.\n\n\nMain Activities:\n\n\n- Design practical solutions to solve problems.\n\n- Participate in code reviews, testing.\n\n- Provide the technology for a platform that facilitates monthly requests.\n\n- Work with big data and predictive analytics on a distributed system.\n\n- Collaborate with the developing team, product owners, client services, to innovate and get the tasks done.\n\n\nRequirements:\n\n\n- At least 5 years of experience in FrontEnd development with strong skills in Javascript, CSS3 and HTML5.\n\n- At least 1 year of experience developing Web applications using ReactJS, Flux, Redux, Relay, etc.\n\n- Experience with other Javascript Frameworks such as Angular, Backbone, Marionette.\n\n- Experience using ES2015 (ES6 / ES7).\n\n- Experience with command lines, APIs, and client-side performance.\n\n- Familiar with the concepts of basic programming, data structures, types of variables and idiosyncrasies.\n\n- Proficient in English.\n\n\nBenefits:\n\n\n- 100% remote work.\n\n- Flexible hours - make your own schedule!\n\n- Diverse and multicultural work environment.\n\n- Paid parental leave, vacation & holidays.\n\n- Hardware setup for you to work from home.\n\n- Excellent compensation — well above the market average.\n\n- Extensive opportunities for growth and professional development thanks to our mentoring system.\n\n\nEnjoy the opportunity to have a dynamic lifestyle, better health, and wellness. Find renewed passion in your job, improve your productivity, and benefit from attractive growth opportunities for your career.\n\n\nIf you are interested in being part of a team composed of the best professionals and working 100% goal-oriented in an innovative environment, but with the structure and resources of a multinational market leader, do not hesitate to apply!",
    "Etapas": "18/05/2023 - Aplicação para a vaga\n20/05/2023 - Email dizendo que se houver interesse eles entram em contato"
  },
  {
    "createdAt": "18/05/2023",
    "company": "Flash",
    "platform": "GUPY",
    "idInPlatform": "4817117",
    "title": "Pessoa Engenheira de Software Node.js/React (Sênior)",
    "url": "https://flash.gupy.io/job/eyJzb3VyY2UiOiJndXB5X3B1YmxpY19wYWdlIiwiam9iSWQiOjQ4MTcxMTd9?jobBoardSource=gupy_public_page",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": true,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nPrazer! Nós somos a Flash.\n\n\n\nSomos uma startup criada para revolucionar o mercado de benefícios corporativos! Fazemos isso por meio de uma plataforma intuitiva, rápida, inovadora e socialmente responsável que permite consolidar todos os benefícios numa solução flexível.\n\n\n\n\n\nContamos para você, desde já, que o Cliente é nosso foco é o que nos move é Inovar. Na Flash, aprendemos juntos como podemos ser ainda melhores, questionando o status quo. E sabemos que podemos ir mais longe com trabalho em equipe, afinal, somos Flamingos: Ser Flash é Pensar Coletivo!\n\n\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\nNa Flash você terá a oportunidade de exercitar:\n\n\n\nExcelência técnica (desenvolvimento de código);\n\nArquitetura e integrações de sistemas;\n\nMentoria técnica e alinhamentos com as pessoas desenvolvedoras mais juniors através de revisões de código e feedbacks;\n\nCriação e monitoramento de métricas e SLAs;\n\nDirecionamento técnico e de inovação e definição de padrões de tecnologia;\n\nAlinhamento com as outras pessoas desenvolvedoras seniores;\n\nAtividades de team building e disseminação da cultura.\n\n \n\n\n\nResponsabilidades:\n\n\n\nExpertise em tecnologias como NodeJS, Typescript, ReactJS, arquitetura de serviços;\n\nAjudar a estruturar e a melhorar a arquitetura do sistema da Flash, aplicando conceitos de Clean Architecture, Event Driven Architecture e DDD;\n\nComo uma pessoa desenvolvedora, esperamos que você não somente utilize suas capacidades técnicas, mas que também compartilhe-as com seu time;\n\nCom o suporte de SRE, você deve ajudar a liderança do time a construir, monitorar e perseguir métricas que garantam o bom funcionamento do sistema e do produto. As métricas definidas aqui tem grande sinergia com os OKRs das áreas e da empresa como um todo;\n\nAs inovações devem fazer parte do seu dia a dia, tanto fazendo pesquisas e compartilhando com o time, quanto experimentando e implementando protótipos. Além disso, para podermos ter espaço para inovação é necessário estabelecermos padrões bem definidos para as pessoas desenvolvedoras mais juniores conseguirem ter conforto e segurança para desenvolver de forma ágil;\n\nDe forma a alcançar todos os objetivos que temos como empresa, alinhamentos com todos os peers são essenciais, sejam eles do seu time ou de outros times;\n\nCompartilhamento de conhecimento, tecnologias e ideias novas tem que fazer parte do seu dia a dia;\n\nAjudar a construir times com práticas de eventos e rituais;\n\nAlocação de profissionais de maneira coesa dentro de grupos de trabalho;\n\nFomentar junto ao time a disseminação de cultura como compartilhamento de conhecimento, aprendizagem contínua, feedbacks, celebração de conquistas, entre outras relacionadas aos pilares da empresa.\n\nREQUISITOS E QUALIFICAÇÕES\n\nExperiência:\n\n\n\nExperiência em NodeJS, ReactJS e outros frameworks de Javascript;\n\nExperiência com APIs REST, RPC ou Graphql (de preferência!);\n\nPessoas que buscam aprender e fazer parte de uma solução de alto impacto, entregando software de alta qualidade, orientado por dados e sempre focado no cliente.\n\n \n\n\n\nE serão considerados diferenciais:\n\n\n\nNestJS, NextJS e Clean Architecture;\n\nMongoDB;\n\nDesenvolvimento de micro serviços escaláveis;\n\nPlataformas de serviço em nuvem: como AWS, GCP, Azure, etc;\n\nFerramentas de CI/CD;\n\nTestes e ferramentas associadas.\n\nINFORMAÇÕES ADICIONAIS\n\nBenefícios:\n\n\n\n\n\nRefeição\n\nAlimentação\n\nMobilidade\n\nEducação\n\nCultura\n\nSaúde\n\nBem-Estar\n\n\n\n\n\nTodos no seu cartão e app Flash! E não para por aí:\n\n\n\n\n\nPLR\n\nSeguro de Vida\n\nPlano de Saúde\n\nAuxílio Home Office\n\nLicença-Maternidade e Paternidade estendida\n\nAcesso aos nossos super parceiros com descontos no app da Flash\n\n \n\n\n\nTudo isso em um ambiente colaborativo e informal, no qual você fará parte de uma equipe fantástica e contribuirá com projetos que impactam positivamente a vida de milhares de pessoas. E o melhor, sendo você! \n\n\n\n\n\nSeja, sinta e se expresse como você é. Na Flash, valorizamos todas as diversidades com relações baseadas no respeito e na liberdade.\n\n\n\n\n\nE aí, combina com você? Então, vem revolucionar com a Flash!\n\n\n\nCONHEÇA A FLASH\n\nSomos uma empresa de tecnologia que já nasceu revolucionando o mercado de benefícios corporativos no Brasil. Em poucos anos de atuação, voamos alto e desenvolvemos soluções que livram o RH da burocracia e ajudam a construir o futuro do trabalho com mais liberdade. Conheça nossas três unidades de negócio: \n\n\n\n \n\n\n\nFlash Benefícios\n\n\n\nUma solução para o RH gerenciar todos os benefícios com total respaldo jurídico, enquanto oferece a melhor experiência de uso para o colaborador. São mais de nove benefícios corporativos em um só aplicativo, além do cartão com bandeira MasterCard, aceito em mais de 4 milhões de estabelecimentos.\n\n\n\n\n\nFlash Expense\n\n\n\nEm 2022 compramos a ExpenseOn e inauguramos uma nova frente de negócios. A partir de então, a Flash tornou-se também um produto digital completo para controle de gastos, desde a plataforma e app para gestão de despesas até o cartão corporativo.\n\n\n\n \n\n\n\nFlash People\n\n\n\nAinda em 2022 lançamos a unidade de negócio Flash People. Uma única plataforma que viabiliza processos de admissão online, treinamentos, desenvolvimento e engajamento dos colaboradores. Um produto que facilita a gestão de pessoas e cultura das empresas a partir de dados. \n\n\n\n\n\nAqui na Flash, acreditamos na praticidade e, acima de tudo, na flexibilidade. \n\n\n\n\n\nE olha só: nossa cultura está dando resultado! Nosso time cresceu cinco vezes entre 2021 e 2022. Isso não é coincidência. É a transformação se tornando realidade.\n\n\n\n\n\nE aí, se identificou? Então, vem fazer parte da revolução rosa!",
    "Etapas": "18/05/2023 - Aplicação para a vaga\n22/05/2023 - Email com recusa"
  },
  {
    "createdAt": "23/05/2023",
    "company": "Mercado Diferente ≠",
    "platform": "LINKEDIN",
    "idInPlatform": "3591707427",
    "title": "Sênior Frontend Software Engineer - (Remote)",
    "url": "https://www.linkedin.com/jobs/view/3591707427/?refId=MSBgaM1KSweDH6f71RDe2Q%3D%3D&trackingId=mcsXIuGWRh6YKV6p1HfiZw%3D%3D",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": true,
    "type": "REMOTE",
    "description": "Sobre a vaga\n\nSobre a Diferente:\n\n\n\nA Diferente ≠ busca democratizar a alimentação saudável para toda a América Latina, com alimentos até 40% mais baratos que mercados tradicionais, enquanto combate o desperdício de comida.\n\n\n\nFaça parte da construção de uma empresa que já nasce com impacto na sociedade, além de democratizar o acesso e consumo de produtos orgânicos no Brasil. Nosso time é super mão na massa, comprometido em fazer a diferença, resolvendo problemas e trabalhando em conjunto para oferecer soluções positivas ao planeta.\n\n\n\n\n\nSobre o desafio:\n\n\n\nNossos engenheiros de front-end estão focados em garantir uma experiência de compra única para nossos clientes. Temos como princípio ser mobile first experience. Você usará tecnologias e estruturas modernas, como Typescript, React, Rest, e os mais recentes padrões da Web em HTML, CSS, JavaScript, React e Ruby on Rails, para desenvolver grandes aplicativos da Web front-end que escalam e têm bom desempenho em todos os dispositivos. E você desenvolverá nossa experiência de aplicativo através do React Native.\n\n\n\nPara nossa web app, nosso time trabalha junto com designers e gerentes de produto para criar e lançar novos recursos para nosso aplicativo. Nossas equipes estão trabalhando com o React Native.\n\n\n\n\n\nAlgumas coisas que gostaríamos que você tivesse:\n\n\n\nProficiência com pelo menos um framework/biblioteca de componentes Javascript (Vue, React, AngularJS ou similar) e um forte conhecimento de CSS3 moderno (Flexbox, Grid).\n\nPaixão e curiosidade em aprender constantemente coisas novas; A Diferente muda rapidamente, e precisamos de pessoas que trabalham aqui para poder mudar e aprender rápido também.\n\nExperiência em trabalhar em um ambiente interdisciplinar com designers e outros engenheiros para produzir e avaliar ideias por meio da prototipagem de conceitos iniciais.\n\n\n\nO que a Diferente proporciona?\n\n\n\nPlano de saúde SulAmérica;\n\nPlano odontológico OdontoPrev (opcional);\n\nSeguro de vida;\n\nCartão Caju;\n\nAuxilio home office;\n\nAuxílio creche;\n\nAuxílio conta de luz/internet;\n\nLicença maternidade e paternidade estendidas;\n\n13° salário;\n\nFérias Flexíveis - 30 dias úteis de férias!\n\nHorário Flexível.\n\n\n\n#Fazdiferençaserdiferente #sejadiferente🧡🍉🍓🥑🥕",
    "Etapas": "23/05/2023 - Aplicação para a vaga\n23/05/2023 - Email com recusa"
  },
  {
    "createdAt": "23/05/2023",
    "company": "GUPY",
    "platform": "GUPY",
    "idInPlatform": "4536386",
    "title": "Front-end Engineer Senior",
    "url": "https://tech-career.gupy.io/job/eyJzb3VyY2UiOiJndXB5X3B1YmxpY19wYWdlIiwiam9iSWQiOjQ1MzYzODZ9?jobBoardSource=gupy_public_page",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": true,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nBuscamos uma pessoa desenvolvedora Front-end transformar a empregabilidade do Brasil com o time da Gupy\n\n\n\n\n\nLocal de trabalho: Remoto\n\n\n\nModelo de contratação: CLT\n\n\n\n\n\nConheça mais sobre a gente\n\n\n\n\n\nA Gupy é uma empresa de tecnologia que une um grupo de pessoas apaixonadas por gerar inovação e impactar o mercado. Somos movidos por grandes desafios e temos um sonho maior ainda: transformar a empregabilidade do país por meio de contratações mais ágeis, justas e encantadoras. 💙\n\n\n\n\n\nPor isso, estamos sempre em busca de profissionais que amem tecnologia, aprendizado constante e que topem embarcar nessa jornada com a gente. Buscamos pessoas engajadas, com muita garra e, claro, que se identifiquem com nosso propósito e a nossa maior missão.\n\n\n\n\n\nEstamos crescendo muito rápido e criando produtos ainda mais poderosos a cada dia. O segredo disso? As pessoas incríveis que fazem parte dessa construção diária aqui dentro da Gupy.\n\n\n\n\n\nAh, e as vagas são para todo o Brasil, tá bem? Nosso formato de trabalho é 100% remoto, ou seja, você trabalha de onde quiser!\n\n\n\n\n\nVocê é uma pessoa com deficiência e tem dúvidas se pode se candidatar? Saiba que todas as nossas vagas também são para você.\n\n\n\n\n\n\n\nE aí, curtiu? Venha fazer parte do time de uma das HRTechs que mais cresce no Brasil!\n\n\n\n\n\n\n\nEtapas do processo seletivo:\n\n\n\n\n\nInscrição e avaliação inicial;\n\nBate-papo com a pessoa recrutadora;\n\nEntrevista técnica;\n\nEntrevista com a liderança da área;\n\nEntrevista de cultura;\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\nComo Front-end, você vai:\n\n\n\n\n\nDesenvolvimento de novas telas utilizando HTML, CSS, JavaScript, React e SASS;\n\nMonitorar a saúde das nossas aplicações;\n\nContribuir com evoluções arquiteturais;\n\nAjudar com resoluções e melhorias em débitos técnicos;\n\nPropor novas ideias e soluções arquiteturais reutilizáveis;\n\nIdentificar melhorias no design de nossos componentes;\n\nParticipação na direção estratégica no time de engenharia;\n\nMentorar e ajudar pessoas a crescerem e evoluírem na carreira;\n\nIdentificar gargalos e melhorias de performance em nossas páginas;\n\nSer referência em relação a boas práticas durante a construção e componentização;\n\nGarantir que nosso bundle carrega aquilo que precisa e continua enxuto;\n\nGarantir que nossas telas continuem ou melhorem a responsividade;\n\nGarantir que nossas telas continuem ou melhorem a acessibilidade;\n\nExperiência com Webpack;\n\nExperiência com Babel;\n\n\n\nDesafios\n\n\n\nMelhorias em nossas métricas atuais, diminuindo tempo de carregamento das nossas páginas;\n\nEscalabilidade de aplicações web;\n\nSeparação de nosso monólito para uma arquitetura micro front-ends e componentização;\n\nPróximos passos com nossa evolução e sonho arquitetural;\n\nTimes autônomos e independentes com baixo acoplamento, custo de coordenação e gargalos de comunicação.\n\n\n\n\n\nREQUISITOS E QUALIFICAÇÕES\n\nComo requisitos básicos, você deve ter:\n\n\n\nExperiência como profissional de tecnologia;\n\nExperiência com arquitetura e design de aplicações web;\n\nExperiência com testes.\n\n\n\n\n\nVocê se destaca, se tiver:\n\n\n\n+3 anos de experiência como profissional de tecnologia;\n\n+3 anos com desenvolvimento em aplicações React;\n\nExperiência com gerenciamento de estados;\n\nExperiência com processos ágeis;\n\nExperiência com responsividade;\n\nExperiência com acessibilidade;\n\nExperiência com design system;\n\nExperiência com micro front-end.\n\n\n\n\n\nINFORMAÇÕES ADICIONAIS\n\nBenefícios:\n\n\n\n\n\nFlexibilidade nos seus horários (sim, mesmo no home office);\n\nVale-refeição no cartão Caju;\n\nPlano médico 100% custeado pela Gupy para você e seus dependentes;\n\nPlano odontológico;\n\nAuxílio home office;\n\nApoio à saúde mental por meio de nossos benefícios como o Zenklub;\n\nApoio à saúde física por meio de nossos benefícios como o Gympass;\n\nLicença-maternidade de 6 meses;\n\nLicença-paternidade de 6 meses;\n\n*Nossa política de licença parental é igualmente aplicável a casais homoafetivos, a mães não gestantes e aos casos de adoção, independentemente da idade;\n\n\n\nLicença-casamento de 5 dias;\n\nReconhecimento interno com as nossas Gupy Coins, que você pode resgatar em forma de crédito no seu cartão Caju (prêmios como Vale Netflix, Vale Spotify, Vale Pizza, Vale Gamer, Vale Jantar Romântico);\n\nDia de folga no seu aniversário;\n\nShort-Friday, isto é, nas sextas-feiras trabalhamos apenas meio período (esse é um favorito por aqui);\n\nCrédito Consignado Creditas, com parcelas descontadas direto na folha de pagamento e juros mais baixos;\n\nEducação Financeira Creditas, com conteúdos exclusivos para você focar na sua educação financeira;\n\nCreditas Store, uma loja para você comprar produtos ou adquirir serviços efetuando o pagamento direto na sua folha de pagamento;  \n\nFérias&Co, que são créditos anuais para você organizar viagens de férias comprando hospedagens e passagens pelo Brasil e pelo mundo via assinatura! Subsidiamos uma parte da mensalidade e é você quem decide se quer contratar o serviço, tá bem?\n\nOportunidade de se tornar sócio da Gupy.\n\n\n\n\n\nCarreira\n\n\n\n\n\nOferecemos todo o apoio para que as pessoas sejam as protagonistas em suas jornadas de crescimento, possuímos uma jornada de carreira muito clara com várias opções de transições e oportunidades de aprendizados e desafios.\n\n\n\n\n\nNossa carreira em Y atende os diferentes tipos de perfis onde pessoas podem seguir para caminhos de gestão ou continuar em suas trajetórias técnicas.\n\n\n\n\n\nNão temos burocracias referente a promoções, estamos frequentemente avaliando pessoas aptas para serem promovidas e dando oportunidades para que deem seus próximos passos em suas jornadas.\n\n\n\nIMAGINA USAR DEEP LEARNING, NLP E MACHINE LEARNING PARA TER UM MUNDO COM GENTE REALIZADA EM SUAS JORNADAS PROFISSIONAIS?\n\nÉ essa a nossa missão. ♥  \n\n\n\n\n\nDesenvolvemos a primeira Inteligência Artificial aplicada à Recrutamento e Seleção do Brasil e, com isso, impactamos diariamente a vida de milhões de pessoas de forma direta e indireta! 🤩\n\n\n\n\n\nPremiados como a Melhor empresa para se trabalhar 🏆 (GPTW) há quatro anos consecutivos, já fomos residentes no Google Campus, acelerados pela Wayra, investidos pela Yellow Ventures, Canary, Maya Capital, Valor e Oria. Somos apoiados pela Endeavor — e inclusive ganhamos o Prêmio de destaque em Diversidade e Inclusão em 2021! Demais, né?\n\n\n\n\n\nNossa cultura de testes nos dá a segurança de que enquanto escalamos, mantemos a qualidade da nossa aplicação e nossas pessoas usuárias satisfeitas. Trabalhamos de maneira ágil com soluções em Node, React, Python, entre outras. Servimos milhares de requisições por minuto e utilizamos Kubernetes que nos possibilita fazer dezenas de deploys por dia enquanto mantemos altíssima disponibilidade.\n\n\n\n\n\nTrabalhamos hoje com 4 grandes produtos e diversos times garantindo a segurança, escalabilidade e inovação de mercado dessas soluções: Recrutamento & Seleção; Admissão; e Educação Corporativa e Clima e Engajamento.\n\n\n\n\n\nNosso time tech é formado por mais de 200 pessoas, espalhadas por vários estados do Brasil! E como aqui na Gupy gente vem primeiro, priorizamos a liberdade e o bem-estar dos gupiers, instaurando oficialmente um regime de trabalho remote first. Isto é, você trabalha de onde quiser, sempre! 😎\n\n\n\n\n\nCom muito orgulho, podemos dizer que somos a HRTech que mais cresce no Brasil, e estamos só começando!\n\n\n\n#Vempragupy 🚀\n\n\n\n\n\nNão é do time de Tecnologia mas também quer trabalhar na Gupy? Acesse aqui: vempra.gupy.io/",
    "Etapas": "23/05/2023 - Aplicação para a vaga\n23/05/2023 - Email com recusa por falta de anos de experiência"
  },
  {
    "createdAt": "23/05/2023",
    "company": "Carbonaut",
    "platform": "LINKEDIN",
    "idInPlatform": "3599567236",
    "title": "Desenvolvimento Front-end Pleno/Sênior",
    "url": "https://www.linkedin.com/jobs/view/3599567236/?refId=491b82b0-fe63-4ed6-9f35-ca912ca03623&trackingId=F%2FMWK%2BNXQvCBDcvRQjULVg%3D%3D&trk=flagship3_job_home_savedjobs",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": true,
    "type": "REMOTE",
    "description": "Sobre a vaga\n\nOlá!\n\n\n\n\n\nSomos a Carbonaut e desenvolvemos soluções web e mobile para nossos produtos e também para clientes ao redor do mundo. Damos suporte a todo o ciclo de desenvolvimento, desde a ideação, passando por rounds de investimento, até escalar o produto/serviço.\n\n\n\nSomos uma equipe que valoriza muito o equilíbrio entre vida pessoal e profissional, o bem-estar e a entrega de soluções impactantes.\n\n\n\nEstamos procurando aumentar nossa equipe para dar vazão à crescente demanda interna e externa que temos aqui na Carbonaut.\n\n\n\nNo front-end usamos Angular, Ionic, Capacitor, Svelte e Vue.js.\n\n\n\n\n\nVaga\n\n\n\n\n\nLocal: escolha entre trabalho remoto, híbrido ou presencial, o que for mais conveniente para você.\n\n\n\nDisponibilizamos escritório em Curitiba para quem é da região e não quiser trabalhar 100% remoto.\n\n\n\nContratação: CLT 40 horas, com jornada flexível.\n\n\n\nFaixa Salarial: R$ 7.700,00 - R$ 10.080,00.\n\n\n\nBenefícios:\n\n\n\nVale-refeição de R$ 700,00/mês;\n\nPlano de saúde Unimed;\n\nGympass;\n\nSeguro de vida;\n\nAuxílio para capacitação e desenvolvimento profissional.\n\n\n\nO que procuramos em você\n\n\n\n\n\nExperiência na área de desenvolvimento front-end;\n\nInglês intermediário/avançado que permita uma plena comunicação oral e escritaI. Na carbonaut você terá contato diário com clientes do exterior inclusive conduzindo reuniões, explicando decisões técnicas e extraindo requerimentos para o projeto em inglês;\n\nJavaScript/TypeScript;\n\nAngular ou React ou Vue.js ou similar (arquitetura baseada em componentes, gerenciamento de estados, roteamento, ciclos de vida da aplicação, etc);\n\nHTML/CSS (layout responsivo, grid, flex, animações);\n\nGit (git flow, gerenciamento de branches e resolução de conflitos);\n\nFamiliaridade com arquitetura de software, clean code e refatoração;\n\nAtenção e Iniciativa;\n\nComunicação clara e objetiva;\n\nEspírito de equipe;\n\nMindset positivo e orientado à solução de problemas;\n\nAutonomia e bom gerenciamento de tempo de rotina.\n\n\n\nConhecimentos além dos citados acima não são exigidos para a posição, mas destacarão você e serão levados em conta. Por exemplo:\n\n\n\nConhecimento básicos de conceitos de otimização como lazy-load, source-maps, bundle explorer, Google Lighthouse, etc.;\n\nConhecimento e experiência com testes unitários, de integração e end-to-end;\n\n\n\nPor que a Carbonaut?\n\n\n\n\n\nAmbiente leve e descontraído;\n\nTrabalhamos em projetos internacionais;\n\nCultura de feedbacks frequentes;\n\nContribuir para projetos sem fins lucrativos;\n\nDefinir seu horário de trabalho;\n\nTrilha de carreira transparente;\n\nFoco no bem-estar;\n\nTrabalhamos em projetos em diferentes estágios do ciclo de vida;\n\nContato direto com clientes, usuários e desenvolvedores de todos os níveis;\n\nIncentivo para assumir responsabilidades e experimentar ideias;\n\nVoz ativa e participação nas decisões;\n\nHappy hours mensais (em Curitiba).\n\n\n\nComo se candidatar:\n\n\n\n\n\nAplique-se através da vaga que publicamos no LinkedIn e entraremos em contato.\n\n\n\nNão esqueça de enviar junto seu:\n\n\n\nCurrículo, deixando claro quais foram as suas responsabilidades e as suas atividades de destaque em empregos anteriores;\n\nPortfolio, com projetos pessoais ou algum código que você mesmo tenha desenvolvido. Esteja preparado para ser questionado sobre os desafios que você encontrou nesses projetos e como fez para superá-los!\n\n\n\nValorizamos a diversidade, a inclusão e o equilíbrio entre habilidades técnicas e alinhamento com os nossos valores. Contratamos pessoas qualificadas independente de sexo, grupo étnico/raça, orientação sexual, identidade de gênero, religião, nacionalidade, idade, estado civil ou deficiência.\n\n\n\n\n\nEntre em contato conosco se houver alguma coisa que você queira saber!\n\n\n\n\n\nNossas últimas vagas tiveram números altíssimos de inscrições. Tentaremos responder o maior número de aplicações possível, mas caso não receba um retorno é porque, infelizmente, não tivemos a capacidade de analisar e responder a todos.",
    "Etapas": "23/05/2023 - Aplicação para a vaga\n23/05/2023 - Email com recusa"
  },
  {
    "createdAt": "24/05/2023",
    "company": "FCamara",
    "platform": "GUPY",
    "idInPlatform": "4838930",
    "title": "Software Frontend Engineer (react), Mid",
    "url": "https://fcamara.gupy.io/job/eyJqb2JJZCI6NDgzODkzMCwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nFCamara Europe is looking for a new talented individual for the position of React Engineer, Mid to join our team in an exciting project in the retail sector. Our customer is a global leader in online retail and is a leader in almost every market where they operate, with huge investments in advanced technology in the areas of commerce, logistics, customer service and analytics.\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\n• Development of apps for different web architectures;\n\n\n\n• Asynchronous programming.\n\n\n\nREQUISITOS E QUALIFICAÇÕES\n\nHard Skill:\n\n\n\n• The professional must have at least 3 years of experience in: HTML5/CSS3, Javascript (including ES6), front-end development in React or Angular;\n\n\n\n• Experience with methodologies and agile teams (Kanban, Scrum, etc.);\n\n\n\n• JS design standards;\n\n\n\n• Data structures;\n\n\n\n• CI/CD; \n\n\n\n• Web architecture;\n\n\n\n• Devops.\n\n\n\n• English at least intermediate for understanding and conversation - from B2.\n\n\n\n\n\nDifferential:\n\n\n\n• Have experience in online retail (especially in luxury retail);\n\n\n\n• Have worked with multicultural teams.\n\n\n\n\n\nSoft Skill:\n\n\n\n• Have agility in deliveries;\n\n\n\n• Get involved in the project actively;\n\n\n\n• Attend meetings with the camera open;\n\n\n\n• Fulfill your commitments and ask for help when you do not know how to do something;\n\n\n\n• Seek to interact with colleagues from different areas in order to obtain the necessary resource to fulfill their tasks;\n\n\n\n• Actively participate, offering new ideas and ways to get the job done.\n\n\n\nTRANSFORMAMOS MUNDOS SONHADOS EM TRAJETÓRIAS REAIS.🧡🚀\n\n\n\n\n\nAqui somos #SangueLaranja!\n\n\n\n\n\nEstamos há 16 anos no mercado, lado a lado com nossos clientes, proporcionando experiências transformadoras. \n\n\n\nSomos um ecossistema de tecnologia e inovação, com expansão global; atuamos no Brasil, Portugal e Reino Unido. 🌎\n\n\n\n  \n\n\n\nF de Formação: acreditamos na prática da cultura do compartilhamento, no senso de comunidade, e que o conhecimento\n\n\n\ntem o poder da transformação!\n\n\n\n \n\n\n\nPossuímos iniciativas, e ações sociais, que promovem o desenvolvimento, como a comunidade tech Orange Juice, o Programa de Formação,\n\n\n\nnossa escola de liderança e diversas parcerias com ONGs e Edtechs. \n\n\n\n  \n\n\n\nNa FCamara todos são bem-vindos, para nós, Diversidade, Respeito e Ética, são elementos inegociáveis e fazem parte do nosso DNA. \n\n\n\n  \n\n\n\nE aí, está pronto para fazer parte de um time incrível e ser protagonista da própria história? ",
    "Etapas": "-"
  },
  {
    "createdAt": "24/05/2023",
    "company": "Zappts",
    "platform": "GUPY",
    "idInPlatform": "4806739",
    "title": "Pessoa Desenvolvedora Frontend (React) com Vtex - PL",
    "url": "https://zappts.gupy.io/job/eyJqb2JJZCI6NDgwNjczOSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nOlá, somos a Zappts, muito prazer!💙\n\n\n\n\n\nNascemos em 2014, no interior de São Paulo, com o propósito de sermos parceiros dos clientes na criação das melhores experiências digitais para os usuários. Em um ritmo de crescimento exponencial, desenvolvemos metodologias próprias que tem auxiliado grandes marcas no processo de aceleração da transformação digital dos negócios.\n\n\n\nHoje já somos mais de 100 Zappters, e temos certeza que nossa história está apenas começando, e adoraríamos dividi-la com você! 😉\n\n\n\n\n\nPor que ser um Zappter? \n\n\n\n\n\nAqui você tem a oportunidade de trabalhar em projetos que otimizam as experiências digitais de marcas reconhecidas em todo esse mundão! 🌍\n\nNossa cultura é 100% remota, e você pode trabalhar de qualquer lugar. Não é atoa que já estamos presentes em 18 estados do Brasil! 🏠\n\nTrabalhará ao lado de pessoas que são apaixonadas pelo que fazem, tendo a chance de aprender diariamente e ampliar seus conhecimentos;\n\nAlém disso, nós Zappters cuidamos para crescer, conquistamos resultados com qualidade, inspiramos protagonistas e semeamos transformação. Somos presença que representa porque nossa harmonia vem de todas as vozes. Nossa cultura é nossa marca no mundo, é forte e autêntica🙂\n\n\n\nGostou? Então, junte-se a nós para fazer parte deste time multidisciplinar, com o qual você terá a oportunidade de colaborar e trocar experiências na criação de soluções de tecnologia.\n\n\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\nComo será seu dia a dia?\n\n\n\nExperiência sólida em desenvolvimento de sites em React\n\nExperiência em desenvolvimento de sites responsivo\n\nExperiência em desenvolvimento com Typescript\n\nVersionamento de código utilizando Git\n\nDesenvolvimento de testes unitários\n\nConhecimento em vtex IO\n\nConhecimento de metodologias ágeis\n\n\n\n\n\nREQUISITOS E QUALIFICAÇÕES\n\nE, para tirar de letra, você precisa:\n\n\n\nExperiência sólida em desenvolvimento de sites em React\n\nExperiência em desenvolvimento de sites responsivo\n\nExperiência em desenvolvimento com Typescript\n\nVersionamento de código utilizando Git\n\nDesenvolvimento de testes unitários\n\nConhecimento em vtex IO\n\nConhecimento de metodologias ágeis\n\nForte habilidade de comunicação e de lidar com clientes trabalhando em um ambiente de parceria\n\n\n\n\n\nAlém disso, se tiver os itens abaixo, será ainda melhor! \n\n\n\nExperiência no desenvolvimento de sites em Node\n\nConhecimento em GraphQL \n\nConhecimento em padrão de projetos\n\nConhecimento em padrão REST\n\nConsumo de Api's com dados em JSON\n\nInglês Intermediário\n\n\n\n\n\nINFORMAÇÕES ADICIONAIS\n\nO que vamos te oferecer para que realize um trabalho incrível?\n\n\n\n\n\nSabe a vida fitness? Está garantida! Temos Gympas para cuidar da sua saúde física e mental! \n\nTambém nos preocupamos com a sua saúde, por isso oferecemos o plano de saúde Amil com cobertura nacional e sem mensalidade; 🩺\n\nQueremos ver a felicidade estampada no seu rosto, por isso temos convênio odontológico para você ostentar aquele sorrisão!😁\n\nSomos flexíveis! Temos o Cartão Caju com bandeira Visa para sua alimentação ou refeição. 🍜\n\nZappters possuem aquele descontão! Oferecemos desconto de até 35% para compra em farmácias selecionadas; \n\nSeguro de vida.\n\n\n\nPara apoiar seu dia a dia:\n\n\n\nAtuação remote first, nossa tribo trabalha de qualquer lugar no Brasil.\n\nAuxílio home office mensal todos os meses para investir em um setup incrível. 💻\n\nVoucher para Happy Hour & Fun com o time para celebrar as conquistas!\n\nPrêmio para indicações assertivas de novos Zappters.\n\n\n\nPara desenvolver sua carreira:\n\n\n\nA cada 6 meses de empresa, você ganha um auxílio no valor de R$300 para investir na sua educação. Além de ter descontos incríveis na mensalidade de vários cursos (afinal, os Zappters adoram aprender!)🎓;\n\nBônus 'meu mimo' para deixar o momento da alteração salarial mais memorável! Você receberá um bônus (na mesma semana) no valor do seu aumento para comprar um presente especial para você, afinal você merece!\n\n\n\n\n\nTambém é legal você saber que...\n\n\n\n\n\nUm dos nossos 7 valores é o '“'Sawabona', seu significado é pra lá de especial, e praticado diariamente aqui na Zappts! 🥰\n\n\n\nA saudação #Sawabona se originou no Sul da África, onde se acredita que todos nascemos pessoas boas, mas que, às vezes, podemos cometer alguns erros. Segundo a cultura deste lugar, quando alguém comete erros, toda a população se junta e, durante dois dias, só falam sobre as coisas boas que aquela pessoa já fez. Ao final desse período, todo o povo cumprimenta seu conterrâneo com a expressão 'Sawabona'. Esse, por sua vez, responde '#Shikoba'. 🌍\n\n\n\nSendo assim, Sawabona significa: 'Eu te vejo, eu te respeito, você é importante para mim'. E a resposta, Shikoba: 'Então eu sou bom e existo para você'. 🙏\n\n\n\nAqui na Zappts, Sawabona traduz e representa o que mais prezamos em nossas relações: o respeito e a valorização do outro.\n\n\n\nSe você é apaixonado por tecnologia e sentiu conexão com os nossos valores, venha para nossa tribo aqui é seu lugar!\n\n\n\nPRAZER, SOMOS A ZAPPTS!\n\nA Zappts é uma empresa 100% remota focada em projetos de transformação digital de grandes marcas. Estamos em mais de 14 estados do Brasil e somos referência em consultoria e desenvolvimento de canais, plataformas e produtos digitais, com entrega de soluções em Design, Front & Back-End, Middleware, Quality Assurance e muito mais. Estamos avançando em nossa missão de sermos parceiros dos clientes na criação das melhores experiências digitais para os usuários, impulsionados pela visão de ser referência em experiências digitais, fortalecendo a comunidade de tecnologia através de nossos valores.\n\n\n\n \n\n\n\nJunte-se a nós para fazer parte deste time multidisciplinar, com o qual você terá a oportunidade de colaborar e trocar experiências na criação de soluções de tecnologia.\n\n\n\n\n\nSaia do beta e venha ser você mesmo!",
    "Etapas": "-"
  },
  {
    "createdAt": "24/05/2023",
    "company": "Confidencial",
    "platform": "GUPY",
    "idInPlatform": "4778885",
    "title": "Frontend Engineer Pleno",
    "url": "https://pagina_confidential.gupy.io/job/eyJqb2JJZCI6NDc3ODg4NSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": true,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nVenha fazer parte do nosso time!\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\nAtuação na evolução do frontend de banking.\n\n\n\nFoco em entender as necessidades de Negócio e o roadmap de Produto, traduzindo para soluções\n\n\n\ntécnicas escaláveis e conectadas com o nosso Design System.\n\n\n\nSerá pessoa chave na propagação da cultura de qualidade no time de Engenharia.\n\n\n\n\n\nREQUISITOS E QUALIFICAÇÕES\n\nJavascript (obrigatório)\n\n\n\nReact (obrigatório)\n\n\n\nstyled-components (desejável)\n\n\n\nTypescript (desejável)\n\n\n\nNode.js (opcional)\n\n\n\nFocado e proativo\n\n\n\nFamiliarizado com a dinâmica de uma startup\n\n\n\nGosta de trabalhar em equipe e se comunica bem\n\n\n\nINFORMAÇÕES ADICIONAIS\n\nVale-refeição flexível;\n\nVale Transporte;\n\nAssistência médica;\n\nAssistência odontológica;\n\nGympass;\n\nSeguro de Vida;\n\nAuxílio Creche.",
    "Etapas": "24/05/2023 - Aplicação para a vaga\n24/05/2023 - Eliminação pelas perguntas iniciais"
  },
  {
    "createdAt": "24/05/2023",
    "company": "Afya",
    "platform": "GUPY",
    "idInPlatform": "4687809",
    "title": "ICLINIC | Pessoa Engenheira de Software Frontend Sênior",
    "url": "https://afya.gupy.io/job/eyJqb2JJZCI6NDY4NzgwOSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nSomos o futuro da Saúde e Educação!   \n\n\n\n\n\n\n\nA Afya é o maior ecossistema de educação em saúde e healthtechs do Brasil. Nascemos do sonho de democratizar o acesso à saúde a todas as pessoas do país.  \n\n\n\n\n\n\n\nAcompanhamos os profissionais de saúde em toda a sua jornada. Somos o único grupo do país parceiro de longo prazo do médico, com entrega de valor em todas as etapas acadêmicas, no exercício da profissão e no seu relacionamento com o mercado de saúde.  \n\n\n\n\n\n\n\nNosso propósito é revolucionar o jeito de ensinar, aprender e aplicar a medicina para formar os melhores profissionais médicos em todas as fases de sua trajetória, combinando educação e saúde para potencializar a formação, atualização, assertividade e produtividade.  \n\n\n\n\n\n\n\nQueremos nos tornar referência na jornada médica, capacitando nossos clientes para transformarem seus sonhos em experiências extraordinárias ao longo da vida.   \n\n\n\nDesde a nossa existência, apoiamos milhares de vidas, impactando positivamente ponta a ponta do clico médico e ajudando a transformar a saúde no Brasil. 🚀  \n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n🔎 SOBRE O PRODUTO:  \n\nA iClinic é líder de mercado em soluções online para gestão de clínicas e consultórios.\n\n\n\nPrincipais funções:\n\n\n\nAGENDA MÉDICA\n\nPRONTUÁRIO ELETRÔNICO​\n\nMARKETING MÉDICO\n\nGESTÃO FINANCEIRA\n\nTELECONSULTA\n\nAGENDAMENTO ONLINE​\n\n \n\n\n\n♿ Todas as nossas oportunidades são extensivas à pessoas com deficiência e reabilitadas do INSS. \n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\n💻🩺 Como será seu dia-dia?  \n\nDefinir a estratégia junto ao time de Plataforma garantindo o alinhamento com liderança e stakeholders;\n\nConstruir e evoluir aplicações Frontend com Reactjs e Nextjs;\n\nManter contato com diferentes times, sendo a referência técnica em Frontend.\n\nContribuir com a priorização e evolução do produto junto ao time, buscando a maior entrega de valor para o negócio;\n\nContribuir com o desenvolvimento, utilizando metodologias ágeis;\n\nContribuir com o desenvolvimento técnico do time;\n\nAcompanhar tendências de mercado e inovações da sua área.\n\nREQUISITOS E QUALIFICAÇÕES\n\n🔎 Buscamos as seguintes Skills (mas não esperamos que uma única pessoa possua todos eles): \n\nSólido conhecimento em HTML, CSS, React e Typescript;\n\nConhecimento com sistemas de templates Django e/ou PayloadCMS;\n\nExperiência com infraestrutura em nuvem na AWS;\n\nConhecimento em Docker;\n\nConhecimento em testes automatizados;\n\nDomínio de sistemas operacionais baseados em Linux/Unix; Conhecimento em CI/CD;\n\nAgir em conformidade aos requisitos legais e adequação às normas internas, por meio da participação efetiva nos treinamentos e relato de possíveis desvios. Zelar pelo sigilo das informações, conforme Código de Ética Afya.\n\nINFORMAÇÕES ADICIONAIS\n\nAlém de transformar a saúde no Brasil, você ganha uma lista de benefícios:  \n\n🌞Para o dia a dia:   \n\n\n\nVale alimentação / refeição;  \n\nFlexibilidade de horários e locações (para vagas remotas);  \n\nVale Transporte (para vagas Hibridas ou Presencial) \n\n💰UP na remuneração:  \n\n\n\nPLR;   \n\nTech Coins (Créditos via Cartão Flash que pode ser utilizado como quiser);  \n\n👩‍👩‍👧‍👦Família, Saúde e Bem-estar:  \n\n\n\nGympass;  \n\nAssistência Médica e Odontológica;  \n\nSeguro de Vida;  \n\nDay Off de Aniversário (Um dia de folga para tirar no dia ou durante o mês do seu aniversário.);  \n\n📖Desenvolvimento e Aprendizado:  \n\n\n\nPlataformas com +40 Cursos voltados para o nicho de negócio (UCA)   \n\nAcademia de idiomas (AIA). \n\nTRANSFORMAR A SAÚDE NO BRASIL\n\nSEJA BEM-VINDO(A) À AFYA 💖\n\nSomos o futuro da Saúde e Educação!  \n\n\n\n\n\nA Afya é o maior ecossistema de educação em saúde e healthtechs do Brasil. Nascemos do sonho de democratizar o acesso à saúde a todas as pessoas do país. \n\n\n\nAcompanhamos os profissionais de saúde em toda a sua jornada. Somos o único grupo do país parceiro de longo prazo do médico, com entrega de valor em todas as etapas acadêmicas, no exercício da profissão e no seu relacionamento com o mercado de saúde. \n\n\n\n\n\n\n\nTemos orgulho de nossa liderança na formação médica de alta qualidade, na oferta de serviços digitais e na geração de impacto social através da promoção da saúde e prevenção de doenças nas comunidades no entorno das nossas operações. \n\n\n\n\n\n\n\nNosso propósito é revolucionar o jeito de ensinar, aprender e aplicar a medicina para formar os melhores profissionais médicos em todas as fases de sua trajetória, combinando educação e saúde para potencializar a formação, atualização, assertividade e produtividade. \n\n\n\n\n\n\n\nQueremos nos torna-se referência na jornada médica, capacitando nossos clientes para transformarem seus sonhos em experiências extraordinárias ao longo da vida.  \n\n\n\nDesde a nossa existência, apoiamos milhares de vidas, impactando positivamente ponta a ponta do clico médico e ajudando a transformar a saúde no Brasil. 🚀 \n\n\n\n\n\n\n\n🩺 Ecossistema: \n\nO nosso ecossistema Afya está presente em todo Brasil e já conta com +30 instituições e +10 healthtechs, como a PEBMED, iClinic, Medcel, CliqueFarma, Glic, Cardiopapers, Além da Medicina e muito mais. Contamos com mais de 265 mil médicos no ecossistema, representando mais de 40% dos médicos do Brasil.  \n\n\n\n\n\n\n\n🔍 Curiosidade: \n\nVocê sabia que a Afya está na bolsa de valores?! \n\n\n\nEm 19 de julho de 2019, fizemos uma oferta pública de ações (IPO) na Nasdaq - bolsa de valores norte-americana, que tem como principal característica reunir empresas especializadas em alta tecnologia. A Afya se destacou como a primeira empresa especializada em educação médica, em termos globais, a negociar ações.\n\n\n\n\n\n🚀 Como atingimos nossos objetivos? \n\nMontando um time de pessoas incríveis e diversas, capazes de colocar os nossos clientes no centro do processo de criação e desenvolvimento do nosso sistema. Por aqui somos encantados e comprometidos com nosso propósito, buscamos entregar o melhor com brilho nos olhos, afinal, estamos ajudando a transformar vidas. Somos colaborativos, temos pensamento digital e buscamos inovação, agindo como donos do negócio e trazemos excelência em nossa execução. \n\n\n\n\n\n💡 Diversidade: \n\nA diversidade faz parte do nosso DNA, acreditamos que a diversidade contribui com diferentes visões de mundo, tornando nosso ambiente mais dinâmico e criativo!  \n\n\n\nSem padrões, não temos espaço para o preconceito: acreditamos em pessoas e seus poderes e potenciais, independentemente das diferenças que apresentam. Por isso, lutamos por um ambiente mais justo, no qual a acessibilidade e a inclusão sejam propósitos diários. \n\n\n\n\n\n\n\nA Afya quer garantir um espaço diverso e igualitário para todo mundo. Aqui temos um espaço de respeito, empatia, acolhimento e bastante debate, contando com grupos de afinidade para nos ajudar a ter uma cultura e ambiente mais inclusivo e representativo. Trabalhamos diariamente por um ambiente mais acessível e inclusivo para todos.   \n\n\n\n\n\n\n\n💻 Desenvolvimento e Oportunidades de Carreiras \n\nAqui, a oportunidade de crescer é constante e para todos. Na Afya, temos o Ciclo de Gente composto por avaliações frequentes e estruturadas com base nas nossas competências, visando uma cultura de feedback contínuo, com planos de desenvolvimento individuais, oportunidades de reconhecimento e progressão na carreira. \n\n\n\n\n\n\n\nRealizamos ainda programas de desenvolvimento da liderança, programa de trainee, cursos de linguagens e uma universidade corporativa contando com uma plataforma acessível e democratizado a todos com mais de 70 conteúdos disponíveis fortalecendo a gestão do conhecimento interno, entre outras iniciativas. \n\n\n\n\n\nGente é tudo pra gente! 😍",
    "Etapas": "-"
  },
  {
    "createdAt": "24/05/2023",
    "company": "Luby",
    "platform": "GUPY",
    "idInPlatform": "4581490",
    "title": "Sr Frontend React Developer",
    "url": "https://luby.gupy.io/job/eyJqb2JJZCI6NDU4MTQ5MCwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": true,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nCome with us and become a #Luber✨\n\n\n\n\n\nIf you love technology we have some exciting news for you: SO DO WE!💚\n\n\n\n\n\nCheck out our package and the reasons to become a #Luber:\n\n\n\nhttps://drive.google.com/file/d/1BbXpYhkboXQaHHiV0oSVWJij-3GnP_Qi/view?usp=sharing\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\n👉What will be your attributions at #Luby ?\n\n\n\n\n\n﻿We are seeking a Front-End Developer to join our team. This role requires an innovative and motivated leader who can develop and deliver reactive web interfaces for our market leading product. This role will be part of our engineering team in an Agile environment to efficiently create, design, implement, and test solutions for our clients/projects.\n\n\n\n\n\nThe successful candidate will have experience conducting the following tasks in a fast-paced small team environment:\n\n\n\n\n\nHelp build and lead an efficient front-end development team comprised of local, remote, and contract developers\n\nFront-End development using current, applicable technologies such as React and GraphQL\n\nDevelop clean and elegant code (including unit test cases) with a high attention to detail\n\nIdentify, recommend, and integrate common open-source plugin libraries that can be used to meet requirements when appropriate\n\nCreates an appropriate level of documentation for coding implementations such that other team members can easily understand what was built or needs to be built\n\nDesign, develop, recommend, and get buy-in for coding standards and best practices to follow for any given project.\n\nTranslate mockups into visually appealing, professional-looking applications with a high standard for coding best practices\n\nReviews developer implementations and provides feedback during the implementation of the UX/UI designs\n\nMentor/train team members in UI development best practices and languages\n\nREQUISITOS E QUALIFICAÇÕES\n\n👉Position's Requirements:\n\n\n\n\n\n4+ years of experience in front-end development using React, Javascript, HTML, and CSS.\n\n3+ years of development experience with GraphQL\n\nDevelopment of multiple production enterprise applications using React (or similar framework) including at least 1 greenfield implementation\n\nExperience leading a team (including remote developers) of front-end developers\n\nDemonstrated experience with Agile, TDD, continuous integration, continuous deployment, configuration management, and unit testing\n\nAptitude and desire to learn, apply, and espouse new technical concepts\n\nStrong problem solving and analytical skills\n\nDetail orientation and strong follow-through on personal and team tasks\n\nMust be a self-motivated, creative problem-solver with strong attention to detail\n\nStrong verbal and written communication skills\n\n\n\n👉Nice to Have Skills:\n\n\n\n\n\n5+ years of experience in front-end development\n\n5+ years of experience with React\n\n2+ years of experience with Swift\n\nExperience with Progressive Web Apps (PWA) and Cordova/Ionic\n\nDevelopment experience with GraphQL\n\nDevelopment experience with Kubernetes and/or Docker\n\nDevelopment experience with websockets or other messaging systems\n\nFamiliarity with hospitality industry, workflow/task management systems, and search engine optimization\n\nExperience with start-ups or small companies\n\nINFORMAÇÕES ADICIONAIS\n\n👉 Our benefits range:\n\n\n\n\n\n🤑 We hire through 'PJ' contracts while also offering many benefits (...so you get the best of\n\n\n\nboth worlds \\o/):\n\n\n\n● Fully Remote\n\n\n\n● Health Care (Regular, Vision and Dental included)\n\n\n\n● LubyCare (Wellness and Mental Health Program)\n\n\n\n● Life Insurance\n\n\n\n● Gympass\n\n\n\n● Flexible Hours\n\n\n\n● Bonus per year (80h)\n\n\n\n● English classes\n\n\n\n● Program of indication\n\n\n\n● Multilaser e-commerce discounts - 30% on any purchase on their website, everytime!\n\n\n\nCONHEÇA A LUBY\n\nA Luby é uma Software House brasileira com sólida presença internacional. Temos mais de 8 anos de atuação no mercado de Bancos e Fintechs americanas, assim como 20 anos de desenvolvimento de soluções digitais para o mercado nacional.\n\n\n\n\n\nAtualmente, a Luby conta com mais de 260 colaboradores que usam as tecnologias mais atuais do mercado em Squads Multidisciplinares espalhados pelo Brasil.\n\n\n\n\n\nAqui, buscamos grandes talentos para fazerem parte da missão Luby de ser A referência técnica no Brasil. Seja em projetos nacionais ou internacionais.",
    "Etapas": "24/05/2023 - Aplicação para a vaga\n25/05/2023 - Email com recusa"
  },
  {
    "createdAt": "24/05/2023",
    "company": "Elo",
    "platform": "GUPY",
    "idInPlatform": "4450051",
    "title": "Pessoa Engenheira de Software Frontend Sênior (React) - [Vaga Afirmativa para Mulheres]",
    "url": "https://vempraelo.gupy.io/job/eyJqb2JJZCI6NDQ1MDA1MSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nJá pensou trabalhar em um ambiente descontraído, cheio de pessoas talentosas e apaixonadas pelo que faz? Na Elo é assim! A empresa de tecnologia em meios de pagamentos 100% BRASILEIRA está buscando profissionais para o time de [NOME DA ÁREA].\n\n\n\n\n\nVai na sua, Vai com Elo!\n\n\n\nLançada há mais de uma década, a Elo é a maior bandeira brasileira, ultrapassando a marca de 140 milhões de cartões emitidos. Produtos e serviços para você e para empresas, nas modalidades crédito, débito e pré-pago. Encontre a opção ideal para seu estilo em nosso site ;)\n\n\n\nhttps://www.elo.com.br/\n\n\n\n\n\nAqui na Elo nós respeitamos as individualidades e promovemos uma cultura inclusiva, que busca a equidade e valoriza as diferenças (ex: Gênero, Religião, PcD, LGBTQIAP+, Raça e Etnia). Todas as nossas vagas respeitam esse compromisso.\n\n\n\n\n\nCurtiu? Então vem saber mais sobre o desafio que temos pra você! ❤️💙💛\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\nComo Desenvolvedora Frontend Sênior você vai:\n\n\n\n\n\n Atuar como parte da equipe ágil;\n\nColaborar com outros membros da equipe, Engenheirxs, PO, QA, Designers, Scrum Master e Tech Leader para resolver os desafios existentes;\n\nDesenvolver, implantar e operar aplicações de acordo com diretrizes das demais áreas;\n\nGerar documentação técnica;\n\nCriação de execução de testes unitários;\n\nGarantir a validação dos dados fornecidos pelos usuários;\n\nCriar código e componentes web reutilizáveis para uso futuro.\n\nREQUISITOS E QUALIFICAÇÕES\n\nPara esse desafio precisamos que você:\n\n\n\n\n\nTer experiência construindo interfaces de usuário complexas para a Web utilizando Web Components;\n\nCompreensão completa do React.js e seus princípios fundamentais, incluindo Virtual DOM, Estado (State), Propriedades (Props) e Ciclo de Vida (React Lifecycle);\n\nSólido conhecimento em testes unitários, performance e integrados;\n\nProficiência em Javascript (ES6+), HTML e CSS. Conhecimento em Typescript.\n\n\n\nAlém disso será diferencial se você:\n\n\n\nTer experiência com Styled-components e css tailwind\n\nINFORMAÇÕES ADICIONAIS\n\nPara trabalhar na Elo, buscamos pessoas que:\n\n\n\nTenha atitude protagonista e empenham-se em superar resultados\n\nRespondem rapidamente às mudanças, com foco e simplicidade na execução de seu trabalho\n\nJogam muito bem em time, compartilhando conhecimento e reconhecendo o desempenho e importância de cada colega\n\nValorizam o diálogo aberto e feedbacks honestos!\n\n\n\nEm troca oferecemos para você:\n\n\n\nParticipação nos Resultados (PPR);\n\nAssistências médica e odontológica (Bradesco);\n\nSeguro de vida (Bradesco Seguros);\n\nPrevidência privada (100% custeado pela Elo);\n\nVale refeição/alimentação de R$ 1.800;\n\nAlelo Mobilidade;\n\nAlelo Cesta Natal;\n\nAlelo Cultura (benefício a ser usado em teatro, cinema ou livrarias);\n\nZenklub (plataforma de saúde e bem estar);\n\nAcesso ao clube de vantagens Bradesco;\n\nLicença parentalidade estendida;\n\nAuxílio idiomas;\n\nGympass (rede de academias e estúdios para práticas esportivas).\n\n\n\nImportante:\n\n\n\nColocamos nossa GENTE em primeiro lugar e, para respeitar a diversidade de perfis do time Elo, todos os colaboradores são elegíveis e podem optar por escolher a rotina de trabalho que mais se encaixa ao dia a dia, sem dias obrigatórios, com a flexibilidade de ser acordado com a liderança quais momentos fazem mais sentido aquela ida ao escritório ;) \n\n\n\nAh, é importante falar que papais e mamães com filhos até 2 anos de idade podem optar pelo modelo 100% remoto, ok?\n\n\n\nNosso escritório fica localizado em Barueri/SP na Alameda Xingu, 512 - Alphaville Industrial. Converse com nosso time sobre nossas facilidades de transporte e mobilidade.\n\n\n\nFAÇA PARTE DESSE ECOSSISTEMA DE INOVAÇÃO QUE CONECTA PESSOAS A NEGÓCIOS\n\nMais do que uma empresa de soluções de pagamento, a Elo é um hub completo de tecnologia 100% brasileiro.\n\n\n\nCostumamos dizer por aqui que nossa gente vem em primeiro lugar! Não podemos e não queremos ser iguais. A gente valoriza a diversidade de ideias e pessoas, então pode vir do seu jeito!\n\n\n\n\n\nSomos mais de 500 colaboradores vivendo intensamente a cultura de inovação, trilhando um caminho da transformação digital e evoluindo nosso portfólio de produtos e serviços.\n\n\n\n\n\nEm pouco mais de dez anos de mercado, contamos com mais de 140 milhões de cartões emitidos e parceria com 30+ emissores. Na frente de inovação aberta, fortalecemos a expansão de produtos com foco em Open Banking, Segurança, Soluções em Dados, Prevenção à Fraude, Blockchain, Mobilidade e Inteligência Artificial.\n\n\n\n\n\nVem com a gente acelerar essa trajetória de crescimento e criar o futuro dos meios de pagamento!",
    "Etapas": "-"
  },
  {
    "createdAt": "24/05/2023",
    "company": "Stefanini Group",
    "platform": "GUPY",
    "idInPlatform": "4472174",
    "title": "Desenvolvedor (a) FrontEnd Sr",
    "url": "https://stefanini.gupy.io/job/eyJqb2JJZCI6NDQ3MjE3NCwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nPresente em mais de 40 países com +30k de funcionários, somos a quinta multinacional brasileira mais internacionalizada e estamos entre as 100 maiores empresas de TI do mundo. Nossas equipes atuam para encontrar as soluções ideais para seus parceiros e impulsionar a inovação necessária para garantir que sua empresa prospere na era digital. Com abrangente análise de negócios e ampla visão de mercado, criamos soluções personalizadas que proporcionam transformações digitais perfeitas, garantindo resultados rápidos e gerando impacto em toda a organização.\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\nSua missão será fazer parte de um importante projeto em uma das 100 maiores multinacionais de TI do mundo\n\n\n\nREQUISITOS E QUALIFICAÇÕES\n\nForte experiência de front-end usando React ou Vue.\n\n\n\nExperiência em microfrontends\n\n\n\nExperiência na criação component/design and library\n\n\n\nExperiência testar com Jest ou Cypress ou similar.\n\n\n\nExperiência com desenvolvimento utilizando gitops CI/CD\n\n\n\nExperiência de back-end for front end é um diferencial\n\n\n\nExperiência com React Native é um diferencial\n\n\n\nExperiência com desenvolvimento utilizando gitops CI/CD\n\n\n\nConhecimento/Experiência Cloud ou Cloud Native\n\n\n\nExperiência com Kubernetes e Docker\n\n\n\n\n\nDesejável:\n\n\n\nSer oriundo do segmento de Consórcio\n\n\n\nConhecimento/Experiência AWS\n\n\n\nINFORMAÇÕES ADICIONAIS\n\nO que oferecemos:\n\n\n\n\n\nAssistência psicológica\n\n\n\nHome office periódico\n\n\n\nPersonalização da carteira de benefícios\n\n\n\nPlano de saúde\n\n\n\nPlano odontológico\n\n\n\nSeguro de vida\n\n\n\nVale alimentação\n\n\n\nVale refeição\n\n\n\nTHIS IS STEFANINI GROUP\n\nSomos uma multinacional brasileira com mais de 30 anos de atuação no ecossistema de inovação.\n\n\n\n\n\nEntregamos soluções eficazes que auxiliam os nossos clientes em suas jornadas digitais, sempre aplicando o nosso propósito de tornar a tecnologia um agente de mudança para um mundo melhor 🚀\n\n\n\n\n\n| + de 40 países | + de 30 empresas no Grupo | + de 30 mil colaboradores | + de 80 soluções |\n\n\n\n\n\nTemos 7 pilares que guiam a nossa cultura, são eles:\n\n\n\n\n\n➡️ Inovar com o cliente\n\n\n\n➡️ Fazer a diferença\n\n\n\n➡️ Liderar pelo exemplo\n\n\n\n➡️ Agir como empreendedor\n\n\n\n➡️ Ser ético e de acordo com o que fala\n\n\n\n➡️ Acreditar e respeitar as pessoas\n\n\n\n➡️ Ter humildade em aprender\n\n\n\n\n\nAcreditamos que cocriar com diversidade é sinônimo de produtividade. E essa mentalidade tem nos levado a lugares incríveis! Por isso, valorizamos a pluralidade e equidade, independente de raça, cor, orientação sexual, ascendência, religião, gênero, nacionalidade, identidade de gênero, deficiência ou idade. Entendemos e incentivamos a importância de ser você! 😉\n\n\n\n\n\n#ORGULHODESERSTEFANINI",
    "Etapas": "-"
  },
  {
    "createdAt": "24/05/2023",
    "company": "Afya",
    "platform": "GUPY",
    "idInPlatform": "4000366",
    "title": "AFYA | Pessoa Engenheira de Software Frontend Sênior",
    "url": "https://afya.gupy.io/job/eyJqb2JJZCI6NDAwMDM2Niwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nSomos o futuro da Saúde e Educação!   \n\n\n\n\n\n\n\nA Afya é o maior ecossistema de educação em saúde e healthtechs do Brasil. Nascemos do sonho de democratizar o acesso à saúde a todas as pessoas do país.  \n\n\n\n\n\n\n\nAcompanhamos os profissionais de saúde em toda a sua jornada. Somos o único grupo do país parceiro de longo prazo do médico, com entrega de valor em todas as etapas acadêmicas, no exercício da profissão e no seu relacionamento com o mercado de saúde.  \n\n\n\n\n\n\n\nNosso propósito é revolucionar o jeito de ensinar, aprender e aplicar a medicina para formar os melhores profissionais médicos em todas as fases de sua trajetória, combinando educação e saúde para potencializar a formação, atualização, assertividade e produtividade.  \n\n\n\n\n\n\n\nQueremos nos tornar referência na jornada médica, capacitando nossos clientes para transformarem seus sonhos em experiências extraordinárias ao longo da vida.   \n\n\n\nDesde a nossa existência, apoiamos milhares de vidas, impactando positivamente ponta a ponta do clico médico e ajudando a transformar a saúde no Brasil. 🚀  \n\n\n\n \n\n\n\n\n\n🔎 SOBRE O PRODUTO:  \n\nPortal Afya, canal que tem como o objetivo de tornar o ecossistema Afya conhecido e relevante para estudantes, médicos e empresas de saúde.\n\n\n\n \n\n\n\n♿ Todas as nossas oportunidades são extensivas à pessoas com deficiência e reabilitadas do INSS. \n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\n💻🩺 Como será seu dia-dia?  \n\n(colocar as responsabilidades da função, em bullet points, sempre começando com o verbo no infinitivo: Garantir, Definir, Propor, Desenhar, Acompanhar, etc.)\n\n\n\n \n\n\n\nPessoa responsável por compreender, manusear e se utilizar de linguagens de programação para construir sistemas complexos voltados ao serviço do usuário;\n\nPossuir domínio dos principais aspectos da sua área de conhecimento;\n\nConectar outras áreas de conhecimento com a sua.\n\nAcompanhar tendências de mercado e inovações da sua área.\n\nREQUISITOS E QUALIFICAÇÕES\n\n🔎 Buscamos as seguintes Skills (mas não esperamos que uma única pessoa possua todos eles): \n\nEnsino Superior Completo; \n\nSólido conhecimento em banco de dados e domínio em React, Vue e Javascript;\n\nExperiência com infraestrutura em nuvem na AWS ou em algum outro cloud provider;\n\nConhecimento em Docker;\n\nConhecimento em testes automatizados;\n\nDomínio de sistemas operacionais baseados em Linux/Unix; Conhecimento em CI/CD;\n\nVisão sistêmica do negócio e consegue propor ações inovadoras que impactem resultados e/ou promova colaboração entre áreas;\n\nRealizar o planejamento em nível mais estratégico;\n\nAgir em conformidade aos requisitos legais e adequação às normas internas, por meio da participação efetiva nos treinamentos e relato de possíveis desvios. Zelar pelo sigilo das informações, conforme Código de Ética Afya.\n\nINFORMAÇÕES ADICIONAIS\n\nAlém de transformar a saúde no Brasil, você ganha uma lista de benefícios:  \n\n🌞Para o dia a dia:   \n\n\n\nVale alimentação / refeição;  \n\nFlexibilidade de horários e locações;  \n\n💰UP na remuneração:  \n\n\n\nPLR;   \n\nTech Coins (Créditos via Cartão Flash que pode ser utilizado como quiser);  \n\n👩‍👩‍👧‍👦Família, Saúde e Bem-estar:  \n\n\n\nGympass;  \n\nAssistência Médica e Odontológica;  \n\nSeguro de Vida;  \n\nDay Off de Aniversário (Um dia de folga para tirar no dia ou durante o mês do seu aniversário.);  \n\n📖Desenvolvimento e Aprendizado:  \n\n\n\nPlataformas com +40 Cursos voltados para o nicho de negócio (UCA)   \n\nAcademia de idiomas (AIA). \n\nTRANSFORMAR A SAÚDE NO BRASIL\n\nSEJA BEM-VINDO(A) À AFYA 💖\n\nSomos o futuro da Saúde e Educação!  \n\n\n\n\n\nA Afya é o maior ecossistema de educação em saúde e healthtechs do Brasil. Nascemos do sonho de democratizar o acesso à saúde a todas as pessoas do país. \n\n\n\nAcompanhamos os profissionais de saúde em toda a sua jornada. Somos o único grupo do país parceiro de longo prazo do médico, com entrega de valor em todas as etapas acadêmicas, no exercício da profissão e no seu relacionamento com o mercado de saúde. \n\n\n\n\n\n\n\nTemos orgulho de nossa liderança na formação médica de alta qualidade, na oferta de serviços digitais e na geração de impacto social através da promoção da saúde e prevenção de doenças nas comunidades no entorno das nossas operações. \n\n\n\n\n\n\n\nNosso propósito é revolucionar o jeito de ensinar, aprender e aplicar a medicina para formar os melhores profissionais médicos em todas as fases de sua trajetória, combinando educação e saúde para potencializar a formação, atualização, assertividade e produtividade. \n\n\n\n\n\n\n\nQueremos nos torna-se referência na jornada médica, capacitando nossos clientes para transformarem seus sonhos em experiências extraordinárias ao longo da vida.  \n\n\n\nDesde a nossa existência, apoiamos milhares de vidas, impactando positivamente ponta a ponta do clico médico e ajudando a transformar a saúde no Brasil. 🚀 \n\n\n\n\n\n\n\n🩺 Ecossistema: \n\nO nosso ecossistema Afya está presente em todo Brasil e já conta com +30 instituições e +10 healthtechs, como a PEBMED, iClinic, Medcel, CliqueFarma, Glic, Cardiopapers, Além da Medicina e muito mais. Contamos com mais de 265 mil médicos no ecossistema, representando mais de 40% dos médicos do Brasil.  \n\n\n\n\n\n\n\n🔍 Curiosidade: \n\nVocê sabia que a Afya está na bolsa de valores?! \n\n\n\nEm 19 de julho de 2019, fizemos uma oferta pública de ações (IPO) na Nasdaq - bolsa de valores norte-americana, que tem como principal característica reunir empresas especializadas em alta tecnologia. A Afya se destacou como a primeira empresa especializada em educação médica, em termos globais, a negociar ações.\n\n\n\n\n\n🚀 Como atingimos nossos objetivos? \n\nMontando um time de pessoas incríveis e diversas, capazes de colocar os nossos clientes no centro do processo de criação e desenvolvimento do nosso sistema. Por aqui somos encantados e comprometidos com nosso propósito, buscamos entregar o melhor com brilho nos olhos, afinal, estamos ajudando a transformar vidas. Somos colaborativos, temos pensamento digital e buscamos inovação, agindo como donos do negócio e trazemos excelência em nossa execução. \n\n\n\n\n\n💡 Diversidade: \n\nA diversidade faz parte do nosso DNA, acreditamos que a diversidade contribui com diferentes visões de mundo, tornando nosso ambiente mais dinâmico e criativo!  \n\n\n\nSem padrões, não temos espaço para o preconceito: acreditamos em pessoas e seus poderes e potenciais, independentemente das diferenças que apresentam. Por isso, lutamos por um ambiente mais justo, no qual a acessibilidade e a inclusão sejam propósitos diários. \n\n\n\n\n\n\n\nA Afya quer garantir um espaço diverso e igualitário para todo mundo. Aqui temos um espaço de respeito, empatia, acolhimento e bastante debate, contando com grupos de afinidade para nos ajudar a ter uma cultura e ambiente mais inclusivo e representativo. Trabalhamos diariamente por um ambiente mais acessível e inclusivo para todos.   \n\n\n\n\n\n\n\n💻 Desenvolvimento e Oportunidades de Carreiras \n\nAqui, a oportunidade de crescer é constante e para todos. Na Afya, temos o Ciclo de Gente composto por avaliações frequentes e estruturadas com base nas nossas competências, visando uma cultura de feedback contínuo, com planos de desenvolvimento individuais, oportunidades de reconhecimento e progressão na carreira. \n\n\n\n\n\n\n\nRealizamos ainda programas de desenvolvimento da liderança, programa de trainee, cursos de linguagens e uma universidade corporativa contando com uma plataforma acessível e democratizado a todos com mais de 70 conteúdos disponíveis fortalecendo a gestão do conhecimento interno, entre outras iniciativas. \n\n\n\n\n\nGente é tudo pra gente! 😍",
    "Etapas": "-"
  },
  {
    "createdAt": "24/05/2023",
    "company": "Itau",
    "platform": "GUPY",
    "idInPlatform": "3079680",
    "title": "ANALISTA DE SISTEMAS SR (Frontend)",
    "url": "https://vemproitau.gupy.io/job/eyJqb2JJZCI6MzA3OTY4MCwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nUMA ESTRADA DE POSSIBILIDADES PARA VOCÊ\n\nO nosso propósito é grande: guiar o desejo de movimento nas pessoas. Isso significa que atravessamos o universo automotivo e transformamos o Brasil em um ecossistema sustentável, em que todas as pontas do mercado têm acesso à inovação, de forma simples e 100% digital. Muito além de um marketplace, estamos presentes em toda jornada dos nossos clientes, levando tecnologia, capacitação e oportunidades.\n\n\n\n \n\n\n\nSobre o iCarros\n\n\n\nSomos uma empresa do Itaú Unibanco, que acredita no poder da mobilidade e faz parte dela! Nascemos com o objetivo de oferecer soluções para toda a cadeia automotiva, desenvolvendo produtos para melhorar a experiência de consumo e conectando pessoas às boas oportunidades de compra e venda de veículos. \n\n\n\nQueremos ir muito além: existimos para entregar facilidade, tecnologia e sonhos, colocando sempre o cliente no centro das nossas decisões.\n\n\n\n \n\n\n\nPor que trabalhar aqui?\n\n\n\nNós aceleramos todos os dias, com respeito, paixão e empatia. Acreditamos que a beleza do nosso negócio está na diversidade das pessoas, que podem - e devem - ser realmente quem são, sendo valorizadas individualmente, com integridade e ética\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\nCriação de interfaces responsivas;\n\nAplicações client side;\n\nSEO.\n\nREQUISITOS E QUALIFICAÇÕES\n\nHTML;\n\nCSS;\n\nJS;\n\nReactJS;\n\nPré/Pós processadores CSS;\n\nControle de versionamento GIT;\n\nExperiência com Testes;\n\nModule Bundlers (webpack, rollup);\n\nState Management;\n\nPackage Manager;\n\nTypeScript.\n\n\n\nO que seria muito legal se você soubesse:\n\n\n\n\n\nAWS;\n\nCI/CD;\n\nNextJS;\n\nVueJS;\n\nAngular;\n\nSvelte.\n\nINFORMAÇÕES ADICIONAIS\n\nCom quais benefícios vou poder contar?\n\n\n\n\n\nVale Transporte\n\nVale Refeição (Restaurantes) / Vale Alimentação (Supermercados)\n\nConvênio médico e odontológico\n\nSeguro de Vida\n\nPrevidência privada\n\nDescontos exclusivos em nossos produtos financeiros\n\nLicença maternidade estendida\n\nAuxílio Creche / Babá (para papais e mamães)\n\nIncentivo a estudos\n\nGym Pass\n\nAcesso aos Clubes Itaú em São Paulo (Guarapiranga / Itanhaém e São Sebastião)\n\n+ Algumas vantagens que você pode conhecer durante o processo 😊\n\n\n\nO Itaú irá utilizar os dados fornecidos para fins de processos seletivos, inclusive em bancos de vagas alocados em plataformas terceiras. Caso deseje solicitar oposição a este uso, ou exercer quaisquer um dos seus direitos, entre em contato através de nossos canais, disponíveis na Política de Privacidade de candidatos do Itaú Unibanco (https://www.itau.com.br/privacidade/candidatos/). Não há necessidade de aceitar, trata-se apenas de uma ciência.\n\n\n\n🧡 O ITAÚ UNIBANCO\n\nSomos o maior banco privado brasileiro em valor de mercado e a marca mais valiosa do Brasil, avaliada em R$ 40,5 bilhões segundo o ranking Interbrand 2021, e estamos em 1º lugar entre as 10 melhores empresas para se trabalhar no Brasil em 2022 com mais de 10 mil funcionários, segundo o ranking Great Places to Work.\n\n\n\n \n\n\n\nCom a maior prateleira de produtos do setor no país e por meio de nossas marcas e parcerias comerciais, oferecemos um amplo leque de oportunidades de carreira em diversas áreas de especialização, tudo com um grande propósito – encantar os nossos clientes, entregando o que eles precisam na hora que eles precisam!\n\n\n\n \n\n\n\nHoje contamos com um time de 100,4 mil colaboradores (os itubers) espalhados pelo Brasil e exterior, em que estamos presentes em 18 países.",
    "Etapas": "-"
  },
  {
    "createdAt": "24/05/2023",
    "company": "SiDi",
    "platform": "GUPY",
    "idInPlatform": "903806",
    "title": "Desenvolvedor Cloud - Frontend",
    "url": "https://sidi.gupy.io/job/eyJqb2JJZCI6OTAzODA2LCJzb3VyY2UiOiJndXB5X3BvcnRhbCJ9?jobBoardSource=gupy_portal",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nQuer trabalhar em um dos maiores institutos de ciência e tecnologia do Brasil?\n\n\n\n\n\n\n\nNós valorizamos o conceito de aprendizado contínuo (o candidato ideal não é aquele que sabe tudo mas sim aquele que tem a habilidade de aprender rapidamente o que não sabe, de praticar e de compartilhar com outros o que aprendeu).\n\n\n\n\n\n\n\nVocê é questionador, atuante e pró-ativo, conhece diferentes tecnologias e tem interesse em descobrir novas abordagens? Identifica pontos de melhoria e automação de processos já existentes?\n\n\n\nSe você gosta de trabalhar de forma colaborativa e integrada com os demais membros da equipe, então venha conhecer o SiDi, e saiba mais sobre esta oportunidade.\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\nDesenvolvimento de aplicações web\n\nManutenção de sistemas para correção de falhas/erros\n\nImplementação de melhorias\n\nAtuar como parte da equipe ágil\n\nArquitetar, projetar, desenvolver, implantar e operar aplicações na cultura DevOps\n\nDesenvolver as funcionalidades de contato com o usuário\n\nOtimizar a aplicação para melhor velocidade e escalabilidade\n\nGarantir a validação dos dados fornecidos pelos usuários\n\nCriar código e bibliotecas reutilizáveis para uso futuro\n\nColaborar com outros membros da equipe para resolver os desafios existentes\n\nREQUISITOS E QUALIFICAÇÕES\n\nExperiência em desenvolvimento Frontend com algum framework (Angular, Angular.js, React.js ou Vue.js)\n\nPreocupação com fidelidade das telas em relação aos protótipos\n\nBoa modularização e reuso de código\n\nExperiência de HTML5, CSS3, Javascript, ES6\n\nExperiência com desenvolvimento de sites responsivos\n\n\n\nConhecimento em:\n\n\n\nGerenciamento de estado de SPA's\n\nAPIs REST\n\nTestes unitários, performance e integrados\n\nBancos de dados relacionais e não relacionais\n\nArquitetura e configuração de aplicações em Cloud\n\nCultura DEVOPS (Jenkins, Pipeline scripts)\n\n\n\nFormação Acadêmica:\n\n\n\nGraduação completa em Engenharia da Computação, Ciência da Computação, Engenharia Elétrica e/ou áreas correlatas.\n\n\n\nIdiomas:\n\n\n\nInglês avançado\n\nINFORMAÇÕES ADICIONAIS\n\nO que esperamos de todos os #SiDiers:\n\n\n\nAbrir a mente para o novo\n\n\n\nManter diálogo aberto e direto\n\n\n\nDesenvolver-se continuamente\n\n\n\nFazer o melhor, sempre\n\n\n\nConstruir em parceria\n\n\n\nPensar grande, fazer rápido\n\n\n\n \n\n\n\nO que oferecemos?\n\n\n\n \n\n\n\n• Qualidade de vida: Jornada de 40 horas semanais com regime CLT, horário flexível e banco de horas trimestral\n\n\n\n• Bem-Estar: Gympass, Ginástica Laboral, Massagista e Apoio Psicológico\n\n\n\n• Saúde: Convênio Médico e Odontológico para você e sua família\n\n\n\n• Filhos: Auxílio creche até 4 anos, licença-maternidade de 120 dias e licença-paternidade estendida\n\n\n\n• Educação: Programa de incentivo para a continuidade dos estudos e especialização, incentivo para que nossos SiDiers se tornem fluentes em outras línguas e ciclos de palestras semanais sobre trend topics mundiais\n\n\n\n• Alimentação: Vale Refeição e Vale Alimentação flexíveis;\n\n\n\n• Reconhecimento: Bônus anual por desempenho e premiações para SiDiers que fizeram algo incrível\n\n\n\n• Diversidade: Comitês sobre Bem-estar, Diversidade, Saúde Mental, Social, Sustentabilidade e Inclusão das mulheres na tecnologia\n\n\n\n• Escritórios Modernos: Ambientes descontraídos e colaborativos com espaços de convivência, minimercado, copas, refeitório*, cestas de frutas*, bebidas à base de café*, etc\n\n\n\n• Ainda quer mais? Dezenas de parcerias com benefícios e descontos!\n\n\n\n \n\n\n\n \n\n\n\nPara nós, inclusão não é apenas somar mais um ao nosso time, é somar diferenças e particularidades. É justamente dessa mistura de técnicas, habilidades e histórias que nos inspiramos para fazer diferentes pontos de vista olharem para um mesmo horizonte, sempre para frente.\n\n\n\nTrabalhamos em um ambiente de oportunidades iguais, independente de gênero, orientação sexual, religião ou deficiência.\n\n\n\n \n\n\n\nTodas as nossas vagas estão disponíveis para PCDs.\n\n\n\nMAIS QUE UM TIME, #SIDIERS 💜💚\n\nSomos um dos maiores institutos de ciência e tecnologia do Brasil e, com um time com mais de 700 SiDiers que não para de crescer, já estamos em Campinas, Manaus e Recife, os maiores parques tecnológicos e de inovações do Brasil. Pois quem tem a vontade de criar projetos que irão transformar o mundo, não pode parar de se transformar. Em quase 20 anos de história, nos especializamos em solucionar problemas e trazemos em nossa bagagem mais de 1.100 projetos que impactam a vida de milhões de pessoas, levando inovação e fazendo o futuro acontecer agora.",
    "Etapas": "-"
  },
  {
    "createdAt": "24/05/2023",
    "company": "The Bridge",
    "platform": "GUPY",
    "idInPlatform": "4766072",
    "title": "Frontend Developer React.js Pleno - 100% Remoto",
    "url": "https://thebridgesocial.gupy.io/job/eyJqb2JJZCI6NDc2NjA3Miwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nNosso cliente é um(a) empresa One Click Checkout que nasceu para facilitar a experiência do usuário em compras online. Para isso, está ampliando o time de desenvolvedores FrontEnd e busca uma pessoa desenvolvedora em FrontEnd Pleno para compor a equipe.\n\n\n\n\n\nVocê estará integrado a uma Squad ágil no desenvolvimento de aplicações Web FrontEnd além de realizar a manutenção e expansão da aplicação\n\n\n\n\n\nQuer saber mais? Logo abaixo você vai encontrar alguns detalhes sobre a vaga:\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\n✨ Você terá como responsabilidade:\n\n\n\nDesenvolver aplicações de alta complexidade com qualidade;\n\nApoio para o time de backend;\n\nManutenção e controle do desempenho da aplicação;\n\nConstruir APIs;\n\nParticipar de decisões de arquitetura e escolha de ferramentas.\n\nREQUISITOS E QUALIFICAÇÕES\n\n✅ É importante que você tenha conhecimento e/ou experiência em:\n\n\n\nReactJS e React;\n\nTestes Unitarios;\n\nAgilidade (Scrum, Kanban, XP);\n\nJavascript/Typescript\n\nCI e CD;\n\nGit.\n\nINFORMAÇÕES ADICIONAIS\n\n🚀 Seria legal/ é um diferencial se você tiver conhecimento/ experiência em:\n\n\n\nDesenvolvimento Android e IOS\n\nAPP Center;\n\nRedux;\n\nCloud(AWS);\n\nBoa comunicação com o UX/UI e time de produtos\n\n\n\n🤩 Nosso cliente oferece:\n\n\n\nContratação PJ;\n\nCartão Flash - R$ 800,00;\n\nFérias Remuneradas;\n\nPlano de Equity.\n\n\n\n📌 Este processo será conduzido considerando as seguintes etapas: \n\n\n\nPapo com a The Bridge;\n\nPapo com o Gestor;\n\nPapo Técnico;\n\nLive coding;\n\nPapo com CEO;\n\nOffer;\n\n\n\n* As etapas citadas acima poderão sofrer alterações de acordo com o andamento do processo seletivo. Mas não se preocupe, estaremos sempre te atualizando :)\n\n\n\n\n\n\n\nAcredita que este desafio é pra você? Clique em “Candidatar-se para vaga”, já estamos te esperando! 🤩🚀💙\n\n\n\n\n\n\n\n﻿#WeBuildYouCross 🚀💙\n\n\n\n\n\n\n\n\n\nBUILDING FUTURES 🚀\n\nA The Bridge é uma rede global para profissionais de tecnologia, UX e digital. Aqui, as empresas descobrem talentos extraordinários, enquanto profissionais encontram as melhores oportunidades digitais em todo o mundo. Nosso propósito é construir pontes, criar oportunidades e transformar o futuro das pessoas.\n\n\n\n\n\nCom uma operação em constante expansão, a The Bridge está presente em grande parte da América Latina e recentemente alcançou Miami, nos Estados Unidos. Mas claro, esse é só o começo! \n\n\n\n\n\n\n\nNossos times pelo mundo: Brasil, Chile, Colômbia, México e EUA\n\nNossa rede global: +230K profissionais\n\nMais de 400 profissionais impactados em 2021\n\n\n\nSomos um time multicultural. Acreditamos na criação de um ambiente seguro, de acolhimento e de suporte para pessoas diversas, valorizando as diferenças. Por isso, respeito, conscientização e multiculturalismo, são valores inegociáveis e que nos guiam. Dentro do nosso Comitê de Diversidade e Inclusão, 'The Bridge of Diversity', temos os grupos de afinidade: Woman Empowerment (Mulheres), Papo Reto (Homens), Proud to be (LGBTQIA+) e Roots (Etnia), onde nossos Bridgers encontram um espaço de representatividade e trocas.\n\n\n\n\n\nQueremos acolher e incluir as diferentes formas de ser, construindo experiências únicas a todas as pessoas que nos conectamos!\n\n\n\n\n\n\n\n#WeBuildYouCross🚀\n\n\n\n\n\n💻🌐 Acompanhe também nossas oportunidades internas por aqui: https://thebridge.gupy.io/",
    "Etapas": "-"
  },
  {
    "createdAt": "24/05/2023",
    "company": "SOUTH SYSTEM",
    "platform": "LINKEDIN",
    "idInPlatform": "3614789146",
    "title": "Pessoa Desenvolvedora Front-End",
    "url": "https://www.linkedin.com/jobs/view/3614789146/?alternateChannel=search&refId=8NzoAOOrHr15NaCQijkI0Q%3D%3D&trackingId=ZpK2Kc6ByPVMVPPTtw%2B5lg%3D%3D",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": true,
    "type": "REMOTE",
    "description": "Sobre a vaga\n\nPessoa Desenvolvedora React\n\n\n\nLocal: Remoto\n\n\n\nEstamos em busca de uma Pessoa Desenvolvedora React para ingressar em nossa nave e juntos, decolar o foguete que impulsiona pessoas para inovar o mundo.\n\n\n\nE antes de apresentar a vaga, queremos te mostrar as razões para ser South System:\n\nAs +350 pessoas do nosso time nos elegeram 2 vezes uma das melhores empresas para se trabalhar no país (GPTW) e nos deram 4.9 estrelas no Glassdoor e Indeed;\n\nSomos Talent Awards pelo linkedin;\n\nSomos Carbon neutral – contribuímos com a compensação das emissões de carbono;\n\nEstamos operando com oportunidades em home office e também com oportunidades híbridas;\n\nContemplamos benefícios variados como:\n\n\n\nAcesso livre a plataforma de cursos Udemy com certificações exclusivas;\n\n\n\nSaúde mental, apoio com psicólogos;\n\n\n\nBenefício de home office;\n\n\n\nBenefício de educação financeira;\n\n\n\nCartão de benefícios flash.\n\nNosso código de cultura é norteado por atitudes e práticas que fazem parte do nosso dia a dia:\n\n\n\nApoio e incentivo ao crescimento e desenvolvimento das pessoas;\n\n\n\nRespeito, lealdade, colaboração e engajamento fazem parte do nosso DNA, cultivamos um ambiente seguro para todos;\n\n\n\nSomos diversos e acreditamos no poder da inclusão e da diversidade dos times;\n\n\n\nUnimos pessoas e inovação para prover soluções de TI.\n\nAmamos nosso planeta e queremos fazer dele um lugar melhor para as próximas gerações por isso cultivamos diversas ações de sustentabilidade;\n\nMantemos e apoiamos ações sociais.\n\n\n\nAgora, vamos falar dessa oportunidade!\n\n\n\nNossos profissionais atuam em projetos alocados em clientes, ou projetos de fábrica, e todos têm acompanhamento das nossas business partners, com suporte especializado para que tenham um bom desempenho e progresso de carreira, nossas squads são multidisciplinares disponíveis de forma global atuando no modelo home office. Esta oportunidade é para um cliente no segmento financeiro.\n\n\n\nSeu desafio no time:\n\nAtuar com desenvolvimento e manutenção de UI's com REACT;\n\nAtuar com BFF's com NODE, e alguns Lambda Function em NODE.\n\n\n\nPerfil que buscamos:\n\nExperiência com desenvolvimento utilizando React;\n\nExperiência em BFF's com Node;\n\nExperiência com Lambda Function;\n\nConhecimento em Azure DevOps;\n\nVivência com Git Flow;\n\nExperiência com Storybook;\n\nVivência com testes unitários.\n\n\n\nDiferenciais que irão somar pontos:\n\nAtuação em projetos de desenvolvimento no segmento financeiro.\n\n\n\nAlém disso, valorizamos a desenvoltura, flexibilidade, automotivação e trabalho em equipe. Defendemos a inclusão e a diversidade, por isso, criamos vagas afirmativas respeitando e priorizando os recortes minoritários em nosso processo de seleção, além de oferecermos núcleos e ações afirmativas dentro da empresa para acompanhamento, inclusão e desenvolvimento de todas as pessoas.\n\n\n\nJunte-se a nós e ajude a impulsionar e transformar o mundo!",
    "Etapas": "24/05/2023 - Aplicação para a vaga\n31/05/2023 - Email com recusa"
  },
  {
    "createdAt": "24/05/2023",
    "company": "Vhsys",
    "platform": "GREEN_HOUSE",
    "idInPlatform": "5499927003",
    "title": "Desenvolvedor(a) Front End Sênior",
    "url": "https://boards.greenhouse.io/vhsys/jobs/5499927003?source=LINKEDIN",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "Etapas": "-"
  },
  {
    "createdAt": "24/05/2023",
    "company": "Datum",
    "platform": "GUPY",
    "idInPlatform": "4745101",
    "title": "Pessoa Desenvolvedora FrontEnd React/Node PL/SR",
    "url": "https://datum.gupy.io/job/eyJqb2JJZCI6NDc0NTEwMSwic291cmNlIjoiZ3VweV9wb3J0YWwifQ==?jobBoardSource=gupy_portal",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nEstamos buscando uma pessoa que ouse protagonizar ocupando a posição de Pessoa Desenvolvedora FrontEnd React/Node PL/SR. 💜\n\n\n\n\n\nJunte-se à Datum e faça parte da 7ª melhor empresa para trabalhar no Rio Grande do Sul pelo GPTW!\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\nCriar sites;\n\nAtualizar sites existentes, realizando a migração para nuvem GCP, visando uma evolução tecnológica;\n\nGarantir atendimento nas questões de vulnerabilidade e segurança do site;\n\nREQUISITOS E QUALIFICAÇÕES\n\nReact;\n\nJavascript (Vanilla);\n\nHTML5;\n\nCSS3 / Sass;\n\nGoogle Cloud Platform (GCP); \n\n\n\nDiferencial\n\n\n\nNodeJS, Webpack, Typescript, GraphQL, Styled Components, Material-UI;\n\nCI/CD;\n\nDocker;\n\nFirebase;\n\nSEO.\n\nConhecimento em ecommerce;\n\nINFORMAÇÕES ADICIONAIS\n\nAqui na Datum, nossos datunianos usufruem de benefícios e programas que atendem diversas áreas da vida.\n\n\n\n\n\nPara sua saúde, oferecemos assistência médica e odontológica sem coparticipação em exames e consultas.\n\nSeguro de vida\n\nQuer mais bem-estar? Oferecemos Gympass, Zenklub (com duas sessões gratuitas por mês) e ginástica laboral para dar aquela alongada durante o expediente.\n\nQuando bater aquela fome, utilize nosso benefício de alimentação Caju para fazer compras em qualquer supermercado ou restaurante.\n\nAma viajar? Aqui temos o Férias & Co, um benefício que te ajuda a viabilizar aquela viagem dos sonhos.\n\nTem filhos? Temos auxílio creche.\n\nQuer aprender um novo idioma? Temos parceria com a escola CCAA, com descontos de até 40% nos cursos, e também o English Live que oferece 30% de desconto na mensalidade.\n\nPara deixar seu ambiente de trabalho com a sua cara, conte com o nosso auxílio home office.\n\nQuer protagonizar? Participe do Protagonistas, nosso game da vida real, e ganhe prêmios incríveis!\n\nO QUE VOCÊ OUSA SER?\n\nImpactamos o mercado global de TI há 23 anos com inovação, tecnologia e gestão de times ágeis. Atuamos no desenvolvimento de software, de plataformas e de aplicativos mobile, outsourcing de profissionais altamente capacitados e consultoria em TI.\n\n\n\n\n\nAtualmente, lideramos mais de 80 projetos e uma carteira de mais de 40 clientes ativos nos segmentos de varejo, bancos e fintechs, entre outros.\n\n\n\n\n\nTrabalhamos constantemente para oferecer um ambiente inspirador e agradável para quem faz parte da Datum, desde a chegada na empresa. Por isso, temos parcerias com Gympass e Zenklub, além de oferecer weeklies com profissionais de nutrição, psicologia e educação financeira.\n\n\n\n\n\nNossos datunianos – forma que chamamos carinhosamente nossas pessoas colaboradoras – são motivados, através da nossa cultura, a incorporarem a ousadia no seu dia a dia. Juntos vamos além, respeitamos, abraços as diferenças, inspiramos e fazemos mais! 💜\n\n\n\n\n\nJunte-se à Datum e faça parte da 7ª melhor empresa para trabalhar no Rio Grande do Sul pelo GPTW!",
    "Etapas": "-"
  },
  {
    "createdAt": "24/05/2023",
    "company": "ART IT Intelligent Technology",
    "platform": "LINKEDIN",
    "idInPlatform": "3615623812",
    "title": "Especialista em Desenvolvimento Front End- Remoto",
    "url": "https://www.linkedin.com/jobs/view/3615623812/?alternateChannel=search&refId=dVuX5NTkq2BPZX9tlgOgLA%3D%3D&trackingId=1mT%2BNL0sROSPd%2BckaF07kw%3D%3D",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "Sobre a vaga\n\nEspecialista em Desenvolvimento Front End- Remoto\n\n\n\n\n\nExperiência com desenvolvimento Web sendo, sua experiência mais sólida e recente com React JS;\n\n\n\nDesenvolvimento de interfaces Web responsivas utilizando React JS;\n\n\n\nDesenvolvimento de elementos visuais em HTML, CSS, Javascript e Typescript;\n\n\n\nManipulação avançada de API’s REST;\n\n\n\nPlanejamento de funcionalidades e estimativas de esforço;\n\n\n\nHTML5, CSS3 (flexbox, grid), JavaScript ES6+;\n\n\n\nPré-compiladores de Estilo. (SASS, LESS, PostCSS);\n\n\n\n\n\n\n\nSobre a ART IT\n\n\n\n\n\nEstamos no mercado há 20 anos, nossos clientes são os líderes de seus respectivos mercados.\n\n\n\nNosso dia a dia é anywhere office e com horário flexível.\n\n\n\nPara conhecer mais sobre a cultura da ART, acesse: https://artit.com.br/carreira/\n\n\n\n\n\nContratação direta com uma grande empresa de Pesquisa e desenvolvimento\n\n\n\n\n\nContratação CLT :\n\n\n\n\n\n*Vale Refeição ou Alimentação\n\n\n\n\n\n*Plano de Saúde\n\n\n\n\n\n*Plano Odontológico\n\n\n\n\n\n*Gympass\n\n\n\n\n\n*PLR\n\n\n\n\n\n*Entre outros Benefícios",
    "Etapas": "-"
  },
  {
    "createdAt": "24/05/2023",
    "company": "Corra",
    "platform": "LINKEDIN",
    "idInPlatform": "3606157019",
    "title": "ReactJS Developer",
    "url": "https://www.linkedin.com/jobs/view/3606157019/?refId=2257e9c7-f57d-4196-bfd2-ded85bad8b8d&trackingId=4WHavgHxT5%2B7gEVmlwjYtg%3D%3D",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "Sobre a vaga\n\nCorra is the global digital agency that B2B and B2C brands trust to accelerate their growth. Working at the intersection of commerce technology and customer experience strategy, we are known for our unmatched ability to deliver comprehensive digital solutions to leading B2C and B2B retailers. In recent years, Corra has taken a leadership position with all things Headless and PWA within the commerce space and has launched more PWA/Headless builds than any other agency within our space.\n\n\n\n\n\nOver the past 15+ years, we have helped merchants enable and scale their commerce vision, channeling our expertise and passion in the Magento Commerce, Adobe Experience Cloud, Shopify Plus, commercetools, fabric and Contentful platforms along with many vetted technology partners.\n\n\n\n\n\nWinner of multiple Best Places to Work awards, we offer exciting and challenging projects with industry leading companies, competitive health benefits, flexible work arrangements, ongoing career development, company outings and tons of other bonuses.\n\n\n\n\n\nCorra is looking for a ReactJS Developer to join our team. This role will work with our project and support teams to provide our clients with high quality technology services. They will work with the team on new ecommerce projects from initial business development and discovery phases, to UX/UI Design, to implementation and deployment of the solution. In addition, they will maintain and enhance existing ecommerce websites while adhering to best practices. Preferably an experienced ecommerce professional, this person will have a passion for researching and learning the latest digital technologies.\n\n\n\n\n\nResponsibilities\n\n\n\nWork with the Corra team on new ecommerce projects, from initial business development and discovery phases through implementation and deployment of the completed project\n\nMaintain and enhance existing ecommerce websites while adhering to best practices\n\nPlay a significant role in the requirements gathering, working with Design and Delivery Managers by providing technical suggestions\n\nWork with Corra Design team to provide UX/UI technology direction to meet client budgets\n\nPartake in Scrum and Sprint planning calls and provide technical input (approach, estimate)\n\nPerform code review before deployment and provide technical review/ feedback to engineers\n\nHave a detailed technical understanding on work happening in assigned projects\n\nHave technical ownership of groups of projects\n\n\n\nRequirements\n\n\n\nReact experience required\n\nSignificant Frontend experience, including experience in HTML, CSS, and strong Javascript skills (including frameworks/libraries such as jQuery). NodeJS is a plus\n\nExperience using GraphQL API\n\n\n\nPreferred Qualifications\n\n\n\nFamiliarity with PWA concept\n\nWorking experience with the ecommerce development process, and the ability to create solutions for common questions/concerns on this type of platform\n\nUnderstanding of common web analytics suites (Google Analytics, Omniture) and experience implementing these systems\n\nComfortable researching and adopting new web technologies\n\nFamiliar with SEO / SEM best practices\n\nUnderstanding of ADA compliance and coding practices around it\n\n\n\nCorra provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex (including pregnancy), sexual orientation, gender identity or expression, parental status, national origin, disability status, genetic information (including family medical history), protected veteran status or military service, citizenship or immigration status, political affiliation, or other non-merit-based factors and other characteristic protected by federal, state or local laws.\n\n\n\n\n\nThis policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.",
    "Etapas": "-"
  },
  {
    "createdAt": "24/05/2023",
    "company": "Edoo",
    "platform": "LINKEDIN",
    "idInPlatform": "3609468693",
    "title": "Full Stack Engineer (Pleno ou Sênior)",
    "url": "https://www.linkedin.com/jobs/view/3609468693/?refId=eae398bb-c5c6-479c-a204-55582c84616b&trackingId=%2F1AFMLJtTO2ybacC%2FrzG6A%3D%3D",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "Sobre a vaga\n\nA EduJob é uma startup que mistura Recrutamento e Educação: HR Tech + Ed Tech. Todos os nossos projetos e iniciativas são focados em causar impacto social, gerando renda e promovendo aprendizado.\n\n\n\nAtualmente temos mais de 800 mil pessoas na nossa base de usuários e precisamos de ajuda para melhorar ainda mais o nosso serviço.\n\n\n\nEstamos crescendo rápido e com muitos projetos e o nosso foco com essa vaga é proporcionar a melhor experiência para nossos recrutadores e candidatos. 🚀🚀\n\n\n\n\n\nAtribuições Principais:\n\n\n\nImplementar funcionalidades com adaptações, melhorias, e novas soluções;\n\nIntegrar nossa ferramenta com novas plataformas através de APIs;\n\nDesenvolver funcionalidades back-end e front-end;\n\nIdentificar fluxos que não estão atuando corretamente em nossa ferramenta;\n\nAnalisar e melhorar a performance das funcionalidades;\n\nResponsável pelo desenvolvimento da solução de acordo com o que foi designado;\n\nResponsável por apoiar tecnicamente a arquitetura técnica e o projeto;\n\nResponsável por auxiliar tecnicamente a equipe de desenvolvimento bem como participar de revisões de código;\n\nTrabalhar com o Líder Técnico para alinhar os requisitos e necessidades de desenvolvimento;\n\n\n\nHard skills:\n\n\n\nCurso superior completo na área;\n\nExperiência em desenvolvimento de software web;\n\nExperiência em Lógica de Programação;\n\nExperiência com Javascript, NodeJS ou TypeScript;\n\nExperiência com HTML e CSS;\n\nExperiência com Banco de Dados SQL e NoSQL;\n\nExperiência em Desenvolvimento Ágil;\n\nCapacidade de conduzir as melhores práticas do ciclo de vida da engenharia de software;\n\nCapacidade de criação e gestão de documentos técnicos do projeto;\n\n\n\nSoft skills:\n\n\n\nBoa comunicação;\n\nProatividade;\n\nTrabalho em equipe;\n\nSer auto gerenciável;\n\nBoa organização pessoal e gestão do tempo;\n\nCapacidade de lidar com situações adversas;\n\nRaciocínio lógico;\n\nCriatividade para encontrar soluções alternativas;\n\nFoco;\n\nHabilidade com resolução de problemas.\n\n\n\nVai se encaixar bem se...\n\n\n\nQuer causar Impacto Social através da geração de renda e educação;\n\nGosta de trabalhar com equipes remotas, dinâmicas e orientadas para resultados;\n\nGosta de ser constantemente desafiado a aprender e fazer mais;\n\nVocê abraça o conflito de idéias e gosta de questionar o status quo;\n\nVocê aprende rápido e facilmente se adapta a novas situações e prioridades;\n\nAcredita em construir ótimos produtos e fazer um ótimo trabalho;\n\n\n\nFaixa Salarial: Entre R$6.000 e R$9.000, dependendo da experiência.\n\n\n\n\n\n* Vaga com prioridade para grupos minoritários na área de tecnologia, como mulheres, negros, indígenas, LGBTQIA+ e PCDs. Ainda que não preencha todos os requisitos, sua candidatura é bem vinda e nos colocamos à disposição para discutir qualquer questão relacionada a isto também.",
    "Etapas": "-"
  },
  {
    "createdAt": "24/05/2023",
    "company": "TRACTIAN",
    "platform": "Própria",
    "idInPlatform": "reckbgfc6aHIu5E8H",
    "title": "Front-End Web Developer Pl/Sr",
    "url": "https://tractian.com/carreiras/vagas/reckbgfc6aHIu5E8H",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "Why join us\n\nTRACTIAN is reimagining industrial systems so that every frontline maintenance worker can realize their full potential. We're building software and hardware in one place—disrupting long-standing institutions with products and experiences that better serve the ambitions of our clients.\n\n\n\nWorking at TRACTIAN allows you to push your limits, challenge the status quo and collaborate with some of the brightest minds in the industry. Our team members have the autonomy needed to accomplish challenging goals. We are a growth-stage startup and you will work directly with the founders, helping to define the vision, product and user experience.\n\n\n\nProduct at TRACTIAN\n\nThe Product organization identifies and scopes out the most impactful opportunities for Tractian to tackle. Our Product team have a deep understanding of the business and are responsible for aligning cross-functional teams across the company around key decisions. They work most closely with the Engineering, Data and Design teams to set a well thought-out product strategy and define a roadmap that ensures Tractian's products continue to evolve for the benefit of our customers.\n\n\n\nWhat you'll do\n\nAs a Front-End Web Developer, you will be responsible for building innovative web products for Tractian growth team. We believe that engineers should accelerate the business through technology, and collaborate across multiple teams to accomplish that.\n\n\n\nResponsibilities\n\nPerform the creation of our new platform for free courses for maintenance\n\n\n\nCreate landing pages and new responsive pages in both Portuguese and English\n\n\n\nBe the technological bridge between our Marketing and Sales team\n\n\n\nPerform integrations between services and create REST APIs\n\n\n\nWork with the founders and together with other full-stack engineers\n\n\n\nDevelop the highly scalable and secure infrastructure to enable Tractian to handle large numbers of users and data\n\n\n\nRequirements\n\n2+ years of experience working with Javascript, ReactJS, NextJS\n\n\n\n2+ years of experience in developing responsive applications\n\n\n\nPrevious exposure to NoSQL databases (MongoDB)\n\n\n\nExpertise with frameworks and page design\n\n\n\nPro in learning new technologies and concepts\n\n\n\nBonus Points\n\nExperience with UX and design notions\n\n\n\nCompensation\n\nCompetitive salary and stock options\n\n\n\nR$800/mo for you to use with food in supermarkets, restaurants and delivery\n\n\n\nGymPass so you don't sit/work all day\n\n\n\nOptional fully funded English / Spanish courses\n\n\n\n30 days of paid annual leave\n\n\n\nEducation and courses stipend\n\n\n\nEarn a trip anywhere in the world every 4 years\n\n\n\nDay off during the week of your birthday\n\n\n\nR$200 a month for remote work allowance\n\n\n\nMental health support: we cover 40% of the cost of your therapy\n\n\n\nHealth plan with national coverage and without coparticipation\n\n\n\nDental Insurance: we help you with dental treatment for a better quality of life.\n\n\n\nSports Incentive: R$300/mo extra if you practice activities\n\n\n\nUp to R$5.000 bonus for referring new Blue Caps",
    "Etapas": "-"
  },
  {
    "createdAt": "24/05/2023",
    "company": "Arke",
    "platform": "LINKEDIN",
    "idInPlatform": "3574872482",
    "title": "Frontend Developer",
    "url": "https://www.linkedin.com/jobs/view/3574872482/?refId=75718a20-37fb-4a10-a269-4e7348be74c8&trackingId=%2BL4LC7BNTiiRNwVBhURk7A%3D%3D",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": true,
    "type": "REMOTE",
    "description": "Sobre a vaga\n\nIn Short\n\n\n\nArke is actively searching for a qualified frontend developer in Brazil, either CLT or PJ. This individual will work with our Brazil Country Head to build and lead a team of developers. You will be responsible for building the ‘client-side’ of our web applications and leading other frontend developers. You should be able to translate our company and customer needs into functional and appealing interactive applications. If you’re interested in creating a user-friendly environment by writing code and moving forward in your career, then this job is for you. We expect you to be a tech-savvy professional, who is curious about new digital technologies and aspires to combine usability with visual design. Ultimately, you should be able to create a functional and attractive digital environment for our company, ensuring great user experience.\n\n\n\n\n\nPlease note, code samples are required.\n\n\n\n\n\nWhat You’ll Be Doing\n\n\n\nCollaborate with team members and clients to produce the best solution given a set of technical and business requirements\n\nEmploy modern development standards and practices with today’s tools and frameworks to develop software applications that surprise and delight\n\nContribute to the production of client deliverables such as detailed design documentation, test plans, and well-documented code\n\nFoster trusted partnerships with coworkers and clients\n\nProduce working prototypes that explore new approaches to UI design and delight customers\n\nDevelop tested and documented JavaScript, HTML and CSS(SASS/LESS)\n\nCreate high performance applications for mobile and desktop with cross-browser compatible\n\nMaintain a high fidelity to branding requirements\n\nEnsure that the integrity of design and user experience standards are held throughout development\n\nMaintain positive and productive working relationships with stakeholders, peers, and leadership\n\n\n\n\n\nWhat We’d Love to See\n\n\n\nProven work experience as a front-end developer\n\nHands on experience with markup languages\n\nExperience with HTML, CSS, and JavaScript; TypeScript preferred\n\nExperience with React preferred. Vue, Angular, or other front-end frameworks are a bonus.\n\nProficient with Git\n\nFamiliarity with browser testing and debugging\n\nIn-depth understanding of the entire web development process (design, development, and deployment)\n\nUnderstanding of layout aesthetics\n\nKnowledge of SEO principles\n\nFamiliarity with software like Adobe Suite, Photoshop, and content management systems\n\nAbility to perform well in a fast-paced environment\n\nExcellent analytical and multitasking skills\n\nIntermediate ability to speak English language\n\nFluent ability to read and write English language\n\nBachelor’s Degree or equivalent experience in Computer Science, Information Systems, Business Administration or related field\n\n\n\nWho We Are\n\n\n\nArke is a full-service experience design and technology consultancy that believes in providing more – much more. We change the way brands approach digital transformation and create defining moments to better connect brands with their customers. Arke’s core values are the soul of who we are and shape everything we do. We are authentically unique, operate with high standards, and love what we do.",
    "Etapas": "24/05/2023 - Aplicação para a vaga\n28/05/2023 - Email com recusa"
  },
  {
    "createdAt": "24/05/2023",
    "company": "Boticário",
    "platform": "GUPY",
    "idInPlatform": "4801592",
    "title": "Pessoa Desenvolvedora Frontend Especialista I (Marketplace - Engajamento)",
    "url": "https://grupoboticario.gupy.io/jobs/4801592?jobBoardSource=gupy_opportunities",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": true,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nO que é o gb.tech?  \n\n\n\n\n\nSomos o time de tecnologia do GB e nosso espírito inquieto nos faz estar sempre de olho nas tendências futuras. A tecnologia é fundamental para revolucionar toda a nossa jornada, da pesquisa e desenvolvimento de produtos até a venda final para nossos consumidores - e é através dela que estamos construindo o melhor e maior ecossistema de beleza para o mundo.\n\n\n\n\n\n\n\nCada novo processo, lançamento e solução exigem eficiência, habilidade e inovação. Só assim é possível manter a velocidade e o dinamismo do nosso crescimento e entregar beleza em cada canto do Brasil e em mais de 15 países. E é isso que o time do gb.tech está fazendo no Grupo Boticário.\n\n\n\n\n\nTemos o compromisso de construir um ambiente cada vez mais diverso e inclusivo. Valorizamos a Diversidade e estamos comprometidos com a promoção da inclusão e equidade em nossos times.\n\n\n\n\n\nComo parte da nossa estratégia em prol da diversidade e inclusão, buscamos a representatividade da sociedade em nossos times. Por isso, temos vagas destinadas aos grupos minorizados priorizados em nossa estratégia: Pessoas com Deficiência, Pessoas Negras (pretas e pardas), Mulheres (Cis e Trans), Pessoas da Comunidade LGBTQIA+ e Pessoas 50+.\n\n\n\n\n\n\n\nEssa ação faz parte de uma estratégia ligada aos nossos compromissos e fortalecimento de nossa cultura equânime.\n\n\n\nConheça mais sobre nossos compromissos em: https://www.umabelezadefuturo.com.br\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\nO que é o nosso time de Marketplace - Engajamento?\n\n\n\nNossa missão é oferecer mecanismos para que o seller consiga potencializar suas vendas através de promoções, ofertas exclusivas, campanhas, anúncios, entre outras formas criativas e atrativas de alcançar e fidelizar os consumidores.\n\n\n\n\n\nComo será o seu dia?\n\n\n\nAtuará em uma equipe multidisciplinar, estabelecendo vínculos com outras áreas de negócios em diversos níveis da organização;\n\nResponsável por implementar as melhores soluções de frontend para nossos clientes de forma colaborativa, visando sempre a melhor experiência de uso para nossos produtos;\n\nResponsável por codar, realizar testes unitários, implantar e monitorar, além de garantir a qualidade e boas práticas de programação;\n\nAprimorar aplicações identificando oportunidades de melhoria;\n\nFazer recomendações, projetar e implementar sistemas, identificando problemas e padrões comuns;\n\nRevisar códigos existentes através de Code Review e pair programming;\n\nTer o sentimento de dono participando das decisões na implementação dos produtos;\n\nInvestigar e usar novas tecnologias quando relevantes;\n\nManter documentação atualizada e atuar como mentor técnico com os outros desenvolvedores, compartilhando melhores práticas de programação com o time.\n\nREQUISITOS E QUALIFICAÇÕES\n\nO que você precisa ter ou saber?\n\n\n\n\n\nLinguagens: Javascript, Typescript;\n\nFrameworks: React, Angular;\n\nServerless: AWS Batch e Lambda Function;\n\nRepositório de Código Fonte: GitHub;\n\nDevOps: Jenkins, GitHub Actions, Sonar, Fortify, Docker, Kubernetes;\n\nObservabilidade: New Relic;\n\nCloud: AWS, GCP;\n\nOutras Tecnologias: Rest, Elasticsearch, GraphQL;\n\nDocumentação de projetos: Jira, Miro, Figma.\n\nINFORMAÇÕES ADICIONAIS\n\nO que oferecemos?\n\n\n\n\n\nBenefícios:  \n\n\n\nNos preocupamos com o bem-estar das nossas pessoas, por isso oferecemos benefícios flexíveis que permitem uma vida mais saudável e completa. \n\n\n\n\n\nNesta vaga, a modalidade é 100% home office, com alguns encontros ao longo do ano. Prometemos que somente em caso de momentos incríveis de conexão e colaboração! Incrível né? Assim você pode trabalhar onde quiser e com quem quiser dentro do Brasil! \n\n\n\n\n\nE ainda tem mais, olha só os nossos benefícios:  \n\n\n\n⏰Jornada de Trabalho com carga horária flexível e sustentável;\n\n\n\n🥘Para quem gosta de cozinhar a própria comida? Oferecemos Vale Alimentação, com um bônus no Natal; \n\n\n\n🍔Prefere pedir a comida em casa mesmo? Temos Vale Refeição; \n\n\n\n🐶Tem aquele Pet super fofo e quer ajuda? Temos a opção do Auxílio Pet; \n\n\n\n🚑Tá, mas e a sua saúde? Oferecemos Plano de Saúde (extensível aos dependentes legais), Plano Odontológico, Seguro de Vida e Previdência; \n\n\n\n🏋️‍♂️Sabe a vida fitness? Deixa com o Gympass; \n\n\n\n👧🧑E as crianças pequenas? Você pode optar pelo Auxílio Babá ou Auxílio Creche. Crianças de 04 meses a 02 anos, possuem Nutrição Infantil Complementar;\n\n\n\n👶Acreditamos que todos possuem o direito de uma Licença Parental Universal igualitária de 120 dias para mulheres e homens (cis e trans);\n\n\n\n🤑PLR: Bônus anual conforme metas. \n\n\n\n🤩 Além do Desconto de até 40% em nossos produtos. Agora sim viu vantagem, né? \n\n\n\n \n\n\n\n Por que o Grupo Boticário?  \n\n\n\nAqui as pessoas são protagonistas da sua jornada. Com autonomia e liberdade para criar e inovar, são capazes de encontrar soluções de alto impacto; \n\n\n\n\n\nTemos espaço de sobra para criar e inovar, incentivando o espírito inquieto que nos caracteriza. Acreditamos em um ambiente profissional feito de trocas, pautado pela ética e responsabilidade, que inspire as pessoas a atingirem seu maior potencial para alcançarem resultados incríveis. \n\n\n\n\n\nSomos um lugar para quem acredita que superar obstáculos faz parte da evolução. Faz parte da adrenalina do nosso dia a dia, porque só assim somos capazes de crescer e nos transformar. \n\n\n\n\n\nCaso tenha dúvidas sobre como o Grupo Boticário trata os seus dados, acesse https://privacidade.grupoboticario.com.br/.\n\n\n\nGRUPO BOTICÁRIO\n\nPor pessoas e para pessoas. O Grupo Boticário tem o propósito de transformar a vida das pessoas, e assim, transformar o mundo ao redor delas.\n\n\n\n\n\nNascemos há mais de 4 décadas, e hoje somos mais de 15 mil colaboradores e atuamos em mais de 50 países, por meio de O Boticário, Eudora, quem disse, berenice?, Vult, Beleza na Web, Dr. Jones, Truss, Mooz, O.U.I, Casa Magalhães, GAVB, Fundação e Instituto Grupo Boticário.\n\n\n\n\n\nSomos um ecossistema completo, unidos em rede, atuamos na cadeia completa: do laboratório de pesquisa, aos canais de venda, sempre com muita inovação, tecnologia e olhar atento ao consumidor e ao futuro.\n\n\n\n\n\nEm 2022, fomos eleita como a 6a companhia de beleza mais sustentável do mundo e uma das melhores empresas para trabalhar no Brasil pelo GPTW.\n\n\n\n\n\nVem fazer beleza com a gente!",
    "Etapas": "24/05/2023 - Aplicação para a vaga\n27/05/2023 - Email com recusa"
  },
  {
    "createdAt": "24/05/2023",
    "company": "Boticário",
    "platform": "GUPY",
    "idInPlatform": "4026939",
    "title": "Pessoa Desenvolvedora Frontend React Especialista I (Franqueados)",
    "url": "https://grupoboticario.gupy.io/jobs/4026939?jobBoardSource=gupy_opportunities",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nO que é o gb.tech? \n\n\n\n \n\n\n\nSomos o time de tecnologia do GB e nosso espírito inquieto nos faz estar sempre de olho nas tendências futuras. A tecnologia é fundamental para revolucionar toda a nossa jornada, da pesquisa e desenvolvimento de produtos até a venda final para nossos consumidores - e é através dela que estamos construindo o maior ecossistema de beleza do mundo.  \n\n\n\n \n\n\n\nCada novo processo, lançamento e solução exigem eficiência, habilidade e inovação. Só assim é possível manter a velocidade e o dinamismo do nosso crescimento e entregar beleza em cada canto do Brasil e em mais de 15 países. E é isso que o time do gb.tech está fazendo no Grupo Boticário. \n\n\n\n\n\nTemos o compromisso em construir um ambiente cada vez mais diverso e inclusivo. Valorizamos a Diversidade e estamos comprometidos com a promoção da inclusão e equidade em nossos times.\n\n\n\n\n\nComo parte da nossa estratégia em prol da diversidade e inclusão, buscamos a representatividade da sociedade em nossos times. Por isso, temos vagas destinadas aos grupos minorizados priorizados em nossa estratégia: pessoas com deficiência, pessoas negras (pretas e pardas), mulheres (cis e trans), pessoas da comunidade LGBTQIA+ e pessoas 50+.\n\n\n\n\n\nEssa ação faz parte de uma estratégia ligada aos nossos compromissos e fortalecimento de nossa cultura equânime.\n\n\n\nConheça mais sobre nossos compromissos em: https://www.umabelezadefuturo.com.br\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\nResponsável por implementar as melhores soluções de frontend com React de forma colaborativa, visando sempre a qualidade, performance, melhores práticas de programação, simplicidade e melhor experiência de uso para nossos produtos\n\nResponsável por desenvolver, realizar testes unitários, implantar e monitorar além de garantir a qualidade e boas práticas de programação\n\nAprimorar aplicações identificando oportunidades de melhoria, fazer recomendações, projetar e implementar sistemas\n\nMelhorar a qualidade do sistema identificando problemas e padrões comuns, além de desenvolver procedimentos operacionais padrões\n\nManter, melhorar e revisar códigos existentes através de Code Review\n\nInvestigar e usar novas tecnologias quando relevante\n\nManter documentação atualizada.\n\nREQUISITOS E QUALIFICAÇÕES\n\nRequisitos e qualificações:\n\n\n\n\n\nExperiência com React\n\nExperiência com Typescript\n\nTestes unitários e Integrados (Jest)\n\nIntegração via API Rest\n\nFerramenta de monitoria (New Relic)\n\nMicro Front-end\n\nFerramentas de Build (Webpack)\n\nConhecimento em Metodologias Ágeis\n\n\n\nO que é desejável?\n\n\n\nDesign system\n\nConhecimentos avançados em acessibilidade\n\nAutomação de CI/CD (Azure pipelines, Github Actions)\n\nConhecimento em Cloud (AWS, S3, CloudFront)\n\nTer conhecimento em NodeJs\n\nINFORMAÇÕES ADICIONAIS\n\nO que oferecemos?\n\n\n\n\n\nBenefícios:  \n\n\n\nNos preocupamos com o bem-estar das nossas pessoas, por isso oferecemos benefícios flexíveis que permitem uma vida mais saudável e completa. \n\n\n\n\n\nLocal de trabalho: O nosso jeito de trabalhar nunca para de evoluir, e depois de tantos aprendizados e novas formas de fazer acontecer nos últimos meses, estamos testando 3 modalidades de trabalho: remoto, híbrido ou presencial. \n\n\n\n\n\nNesta vaga, a modalidade é 100% home office, com alguns encontros ao longo do ano. Prometemos que somente em caso de momentos incríveis de conexão e colaboração! Incrível né? Assim você pode trabalhar onde quiser e com quem quiser dentro do Brasil! \n\n\n\nE ainda tem mais, olha só os nossos benefícios:  \n\n\n\n⏰Jornada de Trabalho com carga horária flexível e sustentável;\n\n\n\n🥘Para quem gosta de cozinhar a própria comida? Oferecemos Vale Alimentação, com um bônus no Natal; \n\n\n\n🍔Prefere pedir a comida em casa mesmo? Temos Vale Refeição; \n\n\n\n🐶Tem aquele Pet super fofo e quer ajuda? Temos a opção do Auxílio Pet; \n\n\n\n🚑Tá, mas e a sua saúde? Oferecemos Plano de Saúde (extensível aos dependentes legais), Plano Odontológico, Seguro de Vida e Previdência; \n\n\n\n🏋️‍♂️Sabe a vida fitness? Deixa com o Gympass; \n\n\n\n👧🧑E as crianças pequenas? Você pode optar pelo Auxílio Babá ou Auxílio Creche. Crianças de 04 meses a 02 anos, possuem Nutrição Infantil Complementar;\n\n\n\n👶Acreditamos que todos possuem o direito de uma Licença Parental Universal igualitária de 120 dias para mulheres e homens (cis e trans);\n\n\n\n🤑PLR: Bônus anual conforme metas. \n\n\n\n🤩 Além do Desconto de até 40% em nossos produtos. Agora sim viu vantagem, né? \n\n\n\n \n\n\n\n Por que o Grupo Boticário?  \n\n\n\n \n\n\n\n• Aqui as pessoas são protagonistas da sua jornada. Com autonomia e liberdade para criar e inovar, são capazes de encontrar soluções de alto impacto; \n\n\n\n• Temos espaço de sobra para criar e inovar, incentivando o espírito inquieto que nos caracteriza. Acreditamos em um ambiente profissional feito de trocas, pautado pela ética e responsabilidade, que inspire as pessoas a atingirem seu maior potencial para alcançarem resultados incríveis. \n\n\n\n• Somos um lugar para quem acredita que superar obstáculos faz parte da evolução. Faz parte da adrenalina do nosso dia a dia, porque só assim somos capazes de crescer e nos transformar. \n\n\n\n• Caso tenha dúvidas sobre como o Grupo Boticário trata os seus dados, acesse https://privacidade.grupoboticario.com.br/.\n\n\n\n\n\nO Grupo Boticário promove a diversidade e queremos conosco pessoas que mudem o jogo e façam bonito, independente de sexo, raça, orientação sexual, religião, nacionalidade, idade ou deficiência.\n\n\n\n\n\nSe identifica com o nosso jeito? Então vem fazer beleza com a gente!\n\n\n\nGRUPO BOTICÁRIO\n\nPor pessoas e para pessoas. O Grupo Boticário tem o propósito de transformar a vida das pessoas, e assim, transformar o mundo ao redor delas.\n\n\n\n\n\nNascemos há mais de 4 décadas, e hoje somos mais de 15 mil colaboradores e atuamos em mais de 50 países, por meio de O Boticário, Eudora, quem disse, berenice?, Vult, Beleza na Web, Dr. Jones, Truss, Mooz, O.U.I, Casa Magalhães, GAVB, Fundação e Instituto Grupo Boticário.\n\n\n\n\n\nSomos um ecossistema completo, unidos em rede, atuamos na cadeia completa: do laboratório de pesquisa, aos canais de venda, sempre com muita inovação, tecnologia e olhar atento ao consumidor e ao futuro.\n\n\n\n\n\nEm 2022, fomos eleita como a 6a companhia de beleza mais sustentável do mundo e uma das melhores empresas para trabalhar no Brasil pelo GPTW.\n\n\n\n\n\nVem fazer beleza com a gente!",
    "Etapas": "-"
  },
  {
    "createdAt": "01/06/2023",
    "company": "Icaro Tech",
    "platform": "GUPY",
    "idInPlatform": "4810585",
    "title": "Desenvolvedor(a) de Software Front-End - React",
    "url": "https://icarotech.gupy.io/job/eyJqb2JJZCI6NDgxMDU4NSwic291cmNlIjoibGlua2VkaW4ifQ==?jobBoardSource=linkedin",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": true,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\n🚩Qual a missão de um Desenvolvedor(a) Front-end na Icaro Tech?\n\n\n\n \n\n\n\nTransformar digitalmente a operação de nossos clientes simplificando a vida dos seus usuários é a nossa missão. A sua missão é traduzir isso para os desafios do dia-a-dia. 🚀\n\n\n\n \n\n\n\nComo parte do nosso time de Engineering, você vai se dedicar no desenvolvimento de sistemas web. Os desafios do dia a dia incluem programação, aplicação de boas práticas, entendimento e refinamento de requisitos e colaboração com o time.\n\n\n\n \n\n\n\nAlém de todos os desafios, você também terá acesso a um plano de desenvolvimento estruturado, com avaliações e feedbacks contínuos, e com um plano de carreira atrativo e abrangente. 🎯\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\nVocê será responsável por:\n\n\n\nDesenvolver utilizando boas práticas e testes;\n\nEntender e apoiar na estimativa de requisitos;\n\nDocumentar suas entregas;\n\nApoiar outros desenvolvedores;\n\nReportar as atividades técnicas.\n\nREQUISITOS E QUALIFICAÇÕES\n\nO que você precisa saber:\n\n\n\nExperiência com desenvolvimento front-end React;\n\nConhecimentos de Engenharia de Software (documento de requisitos e estimativa);\n\nExperiência em Git.\n\n\n\nVocê se destaca se tiver:\n\n\n\nExperiência com Typescript;\n\nExperiência com alguma estrutura de testes unitário para front-end, como Jest;\n\nExperiência com Linux e Docker;\n\nConhecimento de design patterns, clean code, clean architecture;\n\nConhecimento de APIs REST;\n\nConhecimento em AntDesign;\n\nNoções de Programação Orientada a Objetos;\n\nExperiência com projetos ágeis (SCRUM, Kanban);\n\n\n\nO que você precisa ter:\n\n\n\nComunicação clara e eficiente;\n\nTrabalho em equipe;\n\nProatividade;\n\nVontade de ter novos aprendizados;\n\nCompromisso com resultados;\n\nVisão crítica.\n\nINFORMAÇÕES ADICIONAIS\n\nDentro da Icaro nós incentivamos muito nossos profissionais a cultivar nossa Cultura, e apesar de cada um ter seu próprio jeito de ser, todos temos algo em comum: somos Icaronautas 🚀\n\n\n\n\n\nO que faz de nós um Great Place to Work? 😍\n\n\n\n\n\nNo dia-a-dia:\n\n\n\nWork anywhere: pode trabalhar remoto ou de um dos nossos escritórios\n\nBirthday dayoff\n\nHorário flexível\n\nVale alimentação\n\nVale refeição\n\nVale transporte\n\nNo dress code\n\n\n\nSaúde e bem-estar:\n\n\n\nGympass\n\nPlano de saúde\n\nPlano odontológico\n\nParcerias com profissionais e estabelecimentos\n\n\n\nDesenvolvimento contínuo:\n\n\n\nAuxílio pós-graduação\n\nBolsa de idiomas\n\nPrograma de treinamento e capacitação\n\nPrograma de tutoria e mentoria\n\n\n\nApoio e cuidado:\n\n\n\nAuxílio Home Office\n\nAuxílio creche\n\nSeguro de Vida\n\nIndicação premiada\n\nParticipação nos lucros\n\nBreaktime: acompanhamento do RH\n\nVENHA FAZER PARTE DO NOSSO TIME DE ICARONAUTAS 🚀\n\nQuem somos?\n\n\n\n\n\nDesde 1997 a Icaro Tech usa o poder do conhecimento e da tecnologia da informação para oferecer as melhores soluções em Operações Inteligentes e tem como missão principal simplificar a vida das pessoas!!!\n\n\n\n\n\nRazões para trabalhar conosco:\n\n\n\n\n\nCultivamos um ambiente positivo e colaborativo\n\nNossa liderança está sempre de portas abertas\n\nInvestimos em nossos talentos\n\nSomos apaixonados por tecnologia\n\nSomos inconformados com resultados não atingidos\n\n\n\n#SomosUmTime 🚀💙",
    "Etapas": "01/06/2023 - Aplicação para a vaga\n12/06/2023 - Email com recusa"
  },
  {
    "createdAt": "01/06/2023",
    "company": "Conta Simples",
    "platform": "GUPY",
    "idInPlatform": "4783918",
    "title": "Engenheira(o) de Software Frontend Pleno",
    "url": "https://contasimples.gupy.io/job/eyJqb2JJZCI6NDc4MzkxOCwic291cmNlIjoibGlua2VkaW4ifQ==?jobBoardSource=linkedin",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nNosso time de tecnologia\n\n\n\nNosso time é focado em desenvolver uma ferramenta cada vez melhor e mais segura para nossos clientes, trazendo para o dia a dia o espírito de agilidade e inovação. Trabalhamos por tribos e squads e prezamos pela integração e colaboração.\n\n\n\nSe você é movido(a) por desafios, gosta de trabalhar em equipe e sempre quis trabalhar em uma startup em alto crescimento, essa oportunidade é pra você!\n\n\n\n\n\n\n\nDesafios da posição\n\n\n\nParticipar da definição, desenvolvimento, implantação, monitoria e manutenção de soluções escaláveis e com qualidade. Deve ter autonomia para desenvolver e conduzir atividades e iniciativas de baixa e média complexidade.\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\n\n\n\n\nPrincipais Responsabilidades\n\n\n\nContribuir com o time na implementação de boas práticas de desenvolvimento e code design;\n\nDefinir e implementar a melhor arquitetura para novos projetos e melhorias nos projetos atuais;\n\nDesenvolver produtos e serviços que atendem as necessidades dos nossos clientes;\n\nParticipar da implementação e gerenciamento de soluções;\n\nEstar próximo dos nossos clientes, sendo livre para apresentar soluções de negócio.\n\nREQUISITOS E QUALIFICAÇÕES\n\nO que esperamos de você\n\n\n\nConhecimento em Javascript e React;\n\nConhecimentos em desenvolvimento de testes automatizados utilizando frameworks (como Jest, Testing Library, Jasmine, Mocha, etc);\n\nConhecimento de boas práticas de desenvolvimento de software (design patterns, SOLID, Clean code);\n\nConhecimentos de cloud computing (desejável AWS) e arquitetura serverless;\n\nSólidos conhecimentos dos protocolos de comunicação REST e GraphQL.\n\nINFORMAÇÕES ADICIONAIS\n\nO que oferecemos\n\n\n\nContrato PJ com recesso remunerado + benefícios.\n\n\n\nDá uma olhada (em alguns) dos benefícios de ser Simpler:\n\n\n\nPlano de saúde (amplitude nacional) sem custo de mensalidade e coparticipação para os nossos #Simplers e até +2 dependentes legais (filho(a)s até 24 anos de idade)\n\nPlano odontológico (amplitude nacional) sem custo de mensalidade e coparticipação para os nossos #Simplers e até +2 dependentes legais (filho(a)s até 24 anos de idade)\n\nFlex food no cartão Swile \n\nAuxílio home office\n\nGympass e Totalpass - extensivo a dependentes legais (filho(a)s e cônjuges)\n\nDay off mensal (um dia por mês para você relaxar!)\n\nBirthday-off (para você curtir o seu dia com quem você ama!)\n\nParceria com Instituições Educacionais \n\nParceria com a plataforma Vittude com diversos psicólogos disponíveis para cuidar da sua saúde mental\n\nParceria com a plataforma de descontos New Value com descontos incríveis para compras, cursos e serviços!\n\nLicença parental (maternidade 180 dias e paternidade 45 dias)\n\nSeguro de vida\n\nAuxílio Creche\n\nModelo de trabalho 100% remoto\n\nÉ SIMPLES. VEM CRESCER COM A GENTE!\n\nA Conta Simples (operação fintech) existe para libertar as empresas de tudo que as limita para que destravem o seu máximo potencial!\n\n\n\nNosso objetivo é oferecer soluções que resolvam diferentes dores da jornada do financeiro de uma empresa.\n\n\n\nSomos all-in-one, a união de múltiplos cartões corporativos, conta-corrente digital e software de gerenciamento de gastos em um só lugar.\n\n\n\nSimplificamos a rotina do financeiro para que a gestão siga livre de burocracias, geramos controle com economia de tempo. Aqui, nós jogamos juntos pelo mesmo objetivo.\n\n\n\n \n\n\n\nDesde o nosso primeiro ano, em 2019, tivemos um crescimento exponencial e somos uma das scale-ups que mais se destaca no cenário de fintechs voltadas para empresas. \n\n\n\nFomos a segunda startup brasileira a receber aporte da Y Combinator, estamos na lista das 100 Startups to Watch (PEGN), estamos entre as 50 Startups que mudam o Brasil (Exame), E não para por aí: nossos #Simplers já nos reconhecem como um dos melhores lugares para se trabalhar, temos nota 4,9 no Glassdoor, além de sermos certificados pela Great Place to Work.\n\n\n\n \n\n\n\nEm 2022, fizemos a nossa primeira aquisição, com o objetivo de potencializar o resultado de empresas e empreendedores através do financeiro.\n\n\n\nO Hackr Ads (operação SaaS - software as service), é uma plataforma de criação e otimização de anúncios/campanhas e gerenciamento de resultados.\n\n\n\n \n\n\n\nAlém de alavancar as empresas dos nossos clientes com muita inovação e simplicidade, sabemos que o cuidado começa de dentro. \n\n\n\n \n\n\n\nVenha fazer parte do nosso time! #VemSerSimpler 💚",
    "Etapas": "-"
  },
  {
    "createdAt": "01/06/2023",
    "company": "Sicredi",
    "platform": "GUPY",
    "idInPlatform": "3986503",
    "title": "Pessoa Desenvolvedor(a) Front End",
    "url": "https://techsicredi.gupy.io/job/eyJqb2JJZCI6Mzk4NjUwMywic291cmNlIjoibGlua2VkaW4ifQ==?jobBoardSource=linkedin",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nVocê já pensou em desenvolver uma nova experiência de uma instituição financeira? O Sicredi é uma empresa que valoriza o relacionamento e atendimento ao usuário de forma próxima. Nessa oportunidade, convidamos você a compor um time de produto e construir a nossa experiência.\n\n\n\nTudo isso, em um ambiente com pessoas inspiradas por tecnologia, por inovação e por fazer o bem, capazes e engajadas para construir uma plataforma digital cooperativa para o futuro. Temos o desafio de reescrever e modernizar todo o nosso Core Bancário e estamos aproveitando esse momento para fazer uma mudança cultural, mais horizontal, simples e participativa.\n\n\n\nPor isso, queremos compartilhar o nosso dia-a-dia de trabalho complexo e dinâmico com pessoas com habilidades técnicas, que tenham visão de dono sobre o negócio e que dediquem sua energia para fazer algo com um propósito que impactará a comunidade como um todo. Comprometimento e vontade de fazer acontecer são essenciais!\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\nAtribuições:\n\n\n\n- Desenvolvimento de aplicações de front-end para ambiente web responsivo;\n\n\n\n- Desenvolver novas funcionalidades e dar manutenção nas aplicações dos time;\n\n\n\n- Desenvolver testes unitários nos componentes e aplicações;\n\n\n\n- Desenvolver automação de testes end-to-end (funcionais);\n\n\n\n- Desenvolvimento orientado a padrões e princípios de qualidade de código (ex. Clean Code, SOLID, KISS, T-DRY, YAGNI, etc);\n\n\n\n- Desenvolvimento orientado a segurança na web (princípios OWASP);\n\n\n\n- Atuação em times ágeis multidisciplinares em colaboração com UX designers, QAs, desenvolvedores front e back end;\n\n\n\n- Práticas e métodos ágeis de desenvolvimento (scrum, kanban, code review, xp, etc);\n\n\n\n- Participar das cerimônias realizadas pelos times (dayli, discovery, refinamento, plannig, etc);\n\n\n\n- Concepção colaborativa de produtos com diferentes times técnicos e de negócio;\n\n\n\n- Contribuir com o desenvolvimento e manutenção de bibliotecas do Design System;\n\n\n\n \n\n\n\nRequisitos:\n\n\n\n- Boa Lógica de programação;\n\n\n\n- Experiência em Programação Orientada a Objetos;\n\n\n\n- Experiência com Javascript/Typescript;\n\n\n\n- Experiência com HTML e CSS/SASS;\n\n\n\n- Boa comunicação;\n\n\n\n- Disposição e interesse em aprender e contribuir dentro do time;\n\n\n\n- Experiência com web-components e uso de ferramentas de desenvolvimento e documentação como Storybook\n\n\n\n \n\n\n\nDiferenciais:\n\n\n\n- Experiência com Cypress;\n\n\n\n- Experiência com Node.js / Spring Boot / Webflux;\n\n\n\n- Experiência com arquiteturas micro front-end;\n\n\n\n- Experiência com serviços BFF (back-end for front-end);\n\n\n\n- Experiência com desenvolvimento de produtos web para o setor financeiro ou comercial (e-commerce);\n\n\n\nREQUISITOS E QUALIFICAÇÕES\n\nHabilidades técnicas:\n\n\n\n- React / Angular 2+;\n\n\n\n- React Hooks / RXJS\n\n\n\n- Typescript;\n\n\n\n- Comunicação via api Rest e/ou GraphQL;\n\n\n\n- HTML / CSS / SASS / Styled Components;\n\n\n\n- Frameworks de testes unitários para front-end (Jasmine, Jest…)\n\n\n\n- Git;\n\n\n\n- Jenkins;\n\n\n\nINFORMAÇÕES ADICIONAIS\n\nNo Sicredi você vai ter:\n\n\n\n\n\n14º e 15º salários fixos;\n\n\n\nParticipações nos Lucros (de 2 até 5 salários, conforme a senioridade);\n\n\n\nBenefício saúde: Plano de Saúde e Odontológico sem coparticipação (apenas mensalidade por faixa etária), seguro de vida, auxílio nutrição e psicológico;\n\n\n\nVale Alimentação e Vale Refeição – com flexibilidade de % nos cartões VA/VR, sem coparticipação;\n\n\n\nLicença maternidade e paternidade estendida;\n\n\n\nAuxílio creche ou babá para crianças até 6 anos e 11 meses\n\n\n\nPrevidência Privada até 6% do salário;\n\n\n\nPlataforma de Treinamentos – Sicredi Aprende, com diversos cursos;\n\n\n\nCarga horário de 40h semanais – Utilizando sistema de banco de horas;\n\n\n\nAuxílio Home Office;\n\n\n\nTrabalho Remoto.\n\n\n\nOLÁ, SOMOS A COMUNIDADE TECH DO SICREDI!\n\nRespiramos códigos e tecnologia o tempo todo, mas, aqui, a tecnologia não está no centro de tudo e sim as pessoas.\n\n\n\n \n\n\n\nEstamos trabalhando já faz tempo em nossa transformação digital que tem o objetivo de colocar a pessoa usuária no centro de tudo. Nossa maior missão é simplificar a forma como a Fernanda, o João e a Sílvia resolvem os desafios financeiros de seus negócios, contribuindo, assim, para uma sociedade mais próspera. Sabe aquela conversa de nova\n\n\n\neconomia? Já vivemos isso por aqui há mais de 120 anos com o cooperativismo: para nós, compartilhar resultados e pensar nas comunidades faz parte do nosso propósito.\n\n\n\n \n\n\n\nTrabalhamos diariamente na evolução de nossos produtos digitais e temos certeza de que, em breve, todos eles serão acessados e utilizados de todos os cantos e você pode ser - junto com a gente - o responsável por isso! Já fizemos muita coisa que nos orgulha, mas ainda tem muito para o seu talento transformar por aqui.\n\n\n\n \n\n\n\nSobre o nosso dia a dia\n\n\n\n \n\n\n\nColaboração: somos próximos e gostamos de compartilhar conhecimento.\n\n\n\nPor aqui, não temos competição. \n\n\n\n \n\n\n\nClima leve: mesmo com muito trabalho, nossa rotina é alegre e cheia de bons momentos. Acreditamos que os maiores problemas podem ser resolvidos com cooperação.\n\n\n\n \n\n\n\nDesafios grandes: o que criamos e desenvolvemos por aqui impacta na vida financeira de milhões de pessoas das pequenas cidades aos grandes centros urbanos. .\n\n\n\n \n\n\n\nTecnologias atuais: por aqui, temos a oportunidade de trabalhar com ferramentas contemporâneas que facilitam o nosso dia a dia e melhoram a experiência de trabalho.\n\n\n\n \n\n\n\nAprendizado contínuo: aceleramos nosso conhecimento trocando com os colegas, líderes e em iniciativas de desenvolvimento dentro e fora do Sicredi.\n\n\n\n \n\n\n\nTrabalho 100% remoto ou híbrido: aqui você tem poder de escolha, mesmo fisicamente distantes, estaremos perto e nossos escritórios estarão sempre abertos para receber vocês.\n\n\n\n\n\nSobre o Sicredi: Somos a primeira instituição financeira cooperativa do Brasil, com mais de 6,5 milhões de associados e estamos presentes em todas as regiões do país com mais de 2,4 mil agências, distribuídas em mais de 100 cooperativas. Temos mais de 35 mil colaboradores, somos uma das melhores instituições financeiras cooperativas para se trabalhar no Brasil, de acordo com o ranking publicado pelo GPTW e pelo 9º ano consecutivo, ficamos entre as Melhores Empresas para Você Trabalhar segundo a revista Você S/A. Escolhemos trilhar um caminho coletivo, oferecendo soluções inteligentes para o desenvolvimento financeiro dos nossos associados e associadas, assim como das regiões em que atuamos.\n\n\n\n\n\nVem saber mais sobre a gente: https://www.sicredi.com.br/site/sobre-nos/\n\n\n\n\n\nE aí, quer ser tech no Sicredi?\n\n\n\nConfira nossas oportunidades e vamos juntos nessa!\n\n\n\n \n\n\n\nAh, mas antes conheça nosso pacote de benefícios e vantagens:",
    "Etapas": "-"
  },
  {
    "createdAt": "01/06/2023",
    "company": "Conta Azul",
    "platform": "GUPY",
    "idInPlatform": "4804228",
    "title": "Software Engineer Front-end",
    "url": "https://contaazulcarreira.gupy.io/job/eyJqb2JJZCI6NDgwNDIyOCwic291cmNlIjoibGlua2VkaW4ifQ==?jobBoardSource=linkedin",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nSOBRE A CONTA AZUL\n\n\n\nA Conta Azul é movida pela crença que todo empreendedor merece ter sucesso. Apesar do dia a dia cheio de responsabilidades, queremos que todo dono de um pequeno negócio consiga tempo para se dedicar ao que sempre sonhou quando decidiu abrir uma empresa. Por isso, usamos a tecnologia para criar uma plataforma em nuvem, onde o empreendedor juntamente com o seu contador, de forma simples e fácil, podem encontrar tudo o que precisam em tempo real. Buscamos pessoas motivadas neste propósito. Se você é esta pessoa, junte-se a nós!\n\n\n\n\n\n\n\nBuscamos alguém que ame trabalhar como frontend, que seja detalhista, analítico, criativo, inovador e que tenha sede de novos aprendizados. Fará parte do time de jornadas de empresas contábeis, com excelentes desafios e propósito nobre de transformar o Brasil por meio do empreendedorismo.\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\nDesenvolver features para nossos usuários internos e externos;\n\nAnálise de erros/bugs;\n\nPropor soluções e melhorias;\n\nApoiar no desenvolvimento do nosso design system;\n\nContribuir nos novos projetos/features;\n\nManter a qualidade de código no nível adequado;\n\nREQUISITOS E QUALIFICAÇÕES\n\nNECESSÁRIOS\n\n\n\nJavascript;\n\nCSS;\n\nAlgum framework/lib de mercado (VueJs ou ReactJs ou Angular);\n\nBoa comunicação;\n\nSer proativo(a);\n\nLidar com trabalho em equipe.\n\n\n\nDESEJÁVEIS \n\n\n\nKanban ou Scrum;\n\nVueJs;\n\nTestes unitários;\n\nMicrofrontends;\n\nCI/CD;\n\nAnálise de métricas de qualidade de código;\n\nResponsividade;\n\nINFORMAÇÕES ADICIONAIS\n\nBENEFÍCIOS\n\n\n\nPlano de saúde com cobertura nacional, sem desconto de mensalidade ou coparticipação para os Azuis, extensivo para dependentes (filhos e todos os cônjuges, inclusive de pessoas homoafetivas);\n\nPlano odontológico com cobertura nacional, sem descontos em folha para titular e dependente;\n\nBenefício flexível: R$ 1.000,00 para distribuir entre educação (Conta Azul reembolsa 70% da mensalidade), idioma (70% da mensalidade) atividades físicas e reembolso referente aos seguintes profissionais: psicólogos(as), nutricionistas, massoterapeutas e fisioterapeutas (50% do custo);\n\nAuxílio creche para filhos (de 0 a 24 meses) de colaboradores independente de gênero;\n\nPulpa: App para guardar dinheiro para o futuro dos filhos (até 10 anos) dos colaboradores. Você guarda R$ 50 e a Conta Azul mais R$ 50\n\nAuxílio Home Office mensal R$ 150,00 sem desconto\n\nAuxílio Home Office parcela única de R$ 1.500,00 para custear a estação de trabalho\n\nCartão Flash de vale refeição e alimentação mensal sem desconto\n\nZenklub: quantas sessões quiser com Psicólogos, Psicanalistas, Terapeutas e Coaches por R$ 20,00 cada \n\nPrograma de bônus conforme atingimento de metas\n\nBenefício Farmácia: App Vidalink com subsídio de 75% para medicamentos com receita para todos os colaboradores e dependentes com repasse integral\n\nLicença maternidade e paternidade estendidas\n\nBaby Blue Time: No retorno das licenças Paternidade ou Maternidade, o Azul terá direito pelos próximos 6 meses de ter a jornada reduzida em 1 hora por dia e que podem ser acumulados dentro da semana\n\nSeguro de vida\n\nE mais:\n\n\n\nAmbiente inovador que proporciona crescimento, com profissionais incríveis e de aprendizado constante\n\nEscritório com acessibilidade, que estimula a criatividade e produtividade, com comida e bebida à vontade\n\nHorário flexível (trabalhamos de segunda a sexta)\n\nDays Off Experience: Todos os Azuis com mais de 1 ano de casa poderão ter 4 folgas no ano\n\nLicença gratuita na plataforma Conta Azul.\n\n\n\nA Conta Azul é uma empresa que valoriza a inclusão: todas as nossas vagas estão abertas a pessoas com deficiência. \n\n\n\n\n\nPor dentro da Conta Azul:\n\n\n\nNossos times adoram compartilhar conhecimento. Veja o que estamos fazendo por aqui.\n\n\n\n\n\nAcesse:\n\n\n\nhttps://medium.com/cultura-contaazul\n\n\n\nhttps://medium.com/design-contaazul\n\n\n\nhttps://engineering.contaazul.com\n\n\n\nCONTA AZUL VAGAS\n\nConheça as vagas em aberto",
    "Etapas": "-"
  },
  {
    "createdAt": "01/06/2023",
    "company": "SMARTBREEDER",
    "platform": "GUPY",
    "idInPlatform": "4501380",
    "title": "Desenvolvedor Front End | React JS",
    "url": "https://sejaumsmartbreeder.gupy.io/job/eyJqb2JJZCI6NDUwMTM4MCwic291cmNlIjoibGlua2VkaW4ifQ==?jobBoardSource=linkedin",
    "numberOfInterviews": 0,
    "numberOfTests": 0,
    "recused": false,
    "type": "REMOTE",
    "description": "DESCRIÇÃO DA VAGA\n\nVenha fazer parte do nosso time!\n\n\n\n \n\n\n\nSe você deseja trabalhar em uma empresa\n\n\n\npioneira em Inteligência Agronômica Artificial, líder no mercado agro, criadora\n\n\n\nincansável de soluções inovadoras e fazer parte de um time que revoluciona a\n\n\n\nagricultura, chegou o momento!\n\n\n\n \n\n\n\nPara acompanhar e fazer parte do\n\n\n\ncrescimento da empresa, estamos à procura de um DESENVOLVEDOR FRONT END REACT\n\n\n\nJS PLENO que tenha inovação, criatividade, organização e pro atividade em seu\n\n\n\nDNA.\n\n\n\nConfira o perfil abaixo e venha ser um\n\n\n\nSMARTBREEDER!\n\n\n\n \n\n\n\n📍 Vaga Home Office\n\n\n\n\n\n \n\n\n\n⚠️Formação: áreas relacionadas a TI.\n\n\n\n\n\n\n\n 📌 Seria legal se você tivesse conhecimento em:\n\n\n\n✅ React e Redux;\n\n\n\n✅ Vivência de Git;\n\n\n\n✅Conhecimentos em Metodologias Ágeis;\n\n\n\n✅ Arquitetura Orientada a Serviços (SOA);\n\n\n\n✅ Metodologias de Testes automatizados.\n\n\n\n \n\n\n\n \n\n\n\n 📌 O que você vai fazer no seu dia a dia:\n\n\n\n✅ Construir e manter aplicativos React JS;\n\n\n\n✅ Criação de interface de usuários em plataforma Web;\n\n\n\n✅ Correção de bugs reportados por outras áreas de negócio.\n\n\n\n \n\n\n\n\n\n 📌 O que oferecemos?\n\n\n\n✅Programa de Capacitação em parceria com a Alura;\n\n\n\n✅Oportunidade de crescimento.\n\n\n\n\n\n\n\n\n\n✉️Cadastre o seu currículo! Caso você tenha o perfil para vaga entraremos em contato com você em breve!\n\n\n\nRESPONSABILIDADES E ATRIBUIÇÕES\n\n 📌 O que você vai fazer no seu dia a dia:\n\n\n\n✅ Construir e manter aplicativos React JS;\n\n\n\n✅ Criação de interface de usuários em plataforma Web;\n\n\n\n✅ Correção de bugs reportados por outras áreas de negócio.\n\n\n\n \n\n\n\nREQUISITOS E QUALIFICAÇÕES\n\n⚠️Formação: áreas relacionadas a TI.\n\n\n\n\n\n\n\n 📌 Seria legal se você tivesse conhecimento em:\n\n\n\n✅ React e Redux;\n\n\n\n✅ Vivência de Git;\n\n\n\n✅Conhecimentos em Metodologias Ágeis;\n\n\n\n✅ Arquitetura Orientada a Serviços (SOA);\n\n\n\n✅ Metodologias de Testes automatizados.\n\n\n\n \n\n\n\nINFORMAÇÕES ADICIONAIS\n\n 📌 O que oferecemos?\n\n\n\n✅Programa de Capacitação em parceria com a Alura;\n\n\n\n✅Oportunidade de crescimento.\n\n\n\n\n\n\n\n\n\n✉️Cadastre o seu currículo! Caso você tenha o perfil para vaga entraremos em contato com você em breve!\n\n\n\n🔹 O QUE NOS MOVE?\n\nSomos líderes em Inteligência Agronômica Artificial, com propósito de conduzir a [r]evolução para a agricultura. Nosso objetivo é elevar a sustentabilidade e a produtividade no campo através das nossas tecnologias, produtos, soluções e consultorias inteligentes, que recomendam melhores práticas de manejo no campo.\n\n\n\n\n\nPor muito tempo o agronegócio foi considerado um setor de baixa tecnologia, sem muitos atrativos para investimento em inovações e poucas oportunidades de desenvolvimento socioeconômico. Levamos a disrupção de antigos modelos mentais no campo, reformulando operações e implementando com a tecnologia, uma nova estrutura organizacional, gerando resultados para os nossos clientes de forma cada vez mais sustentável e eficiente. ​\n\n\n\n\n\n\n\nAcreditamos que a tecnologia aliada à cognição humana pode empoderar e transformar os resultados do produtor e gestor do futuro. ​\n\n\n\n#oAgroÉTech",
    "Etapas": "-"
  }
]